[
  {
    "id": "https://mijailovic.net/2025/09/07/dotnet/2025-09-07T09:30:00+00:00How to (actually) become an expert in .NET",
    "title": "How to (actually) become an expert in .NET",
    "link": "https://mijailovic.net/2025/09/07/dotnet/",
    "description": "The influencers want you to think that you must learn a gazillion different technologies to become a successful .NET developer. These days, the internet is full of .NET “roadmaps” that include everything but the kitchen sink: Azure, AWS, Redis, Docker, Postgres, GraphQL, gRPC, Dapper, ELK stack, CQRS, you name it.",
    "pubDate": "2025-09-07T09:30:00.000Z",
    "feedUrl": "https://mijailovic.net/feed.xml"
  },
  {
    "id": "https://mijailovic.net/2025/06/01/bandcamp-scams/2025-06-01T15:50:00+00:00How scammers trick fans on Bandcamp—and how to protect yourself",
    "title": "How scammers trick fans on Bandcamp—and how to protect yourself",
    "link": "https://mijailovic.net/2025/06/01/bandcamp-scams/",
    "description": "It’s Friday, and Invincible Shield, the long-awaited Judas Priest album, is finally out. To your surprise, it’s available on Bandcamp! You buy the album immediately, ecstatic that your favorite band has finally started releasing their music on your favorite music platform. You wake up the next day, only to find the album has vanished from your collection—you’ve fallen victim to a scam.",
    "pubDate": "2025-06-01T15:50:00.000Z",
    "feedUrl": "https://mijailovic.net/feed.xml"
  },
  {
    "id": "https://mijailovic.net/2025/05/14/high-performance-strings/2025-05-14T12:00:00+00:00High-performance string formatting in .NET",
    "title": "High-performance string formatting in .NET",
    "link": "https://mijailovic.net/2025/05/14/high-performance-strings/",
    "description": "One of the topics I covered in my previous post on memory optimizations was string formatting. As I was writing that post, I uncovered an embarrassing gap in my knowledge!",
    "pubDate": "2025-05-14T12:00:00.000Z",
    "feedUrl": "https://mijailovic.net/feed.xml"
  },
  {
    "id": "https://mijailovic.net/2025/04/10/memory-optimizations/2025-04-10T08:00:00+00:00Optimizing memory usage with modern .NET features",
    "title": "Optimizing memory usage with modern .NET features",
    "link": "https://mijailovic.net/2025/04/10/memory-optimizations/",
    "description": "After my service migrated from .NET Framework to .NET 8 (and later to .NET 9), it felt like a whole new world had opened to me. All the modern .NET features that I had only been reading about on the .NET Blog were finally available to me. Armed with Microsoft’s continuous, fleet-wide performance profiler, I embarked on a journey to find the places where my service was allocating the most memory and fix the unnecessary allocations by using the newly available .NET APIs. In this blog post, I’ll sh",
    "pubDate": "2025-04-10T08:00:00.000Z",
    "feedUrl": "https://mijailovic.net/feed.xml"
  },
  {
    "id": "https://mijailovic.net/2024/04/04/bandcamp-auth/2024-04-04T12:15:00+00:00Reverse engineering Bandcamp authentication protocol",
    "title": "Reverse engineering Bandcamp authentication protocol",
    "link": "https://mijailovic.net/2024/04/04/bandcamp-auth/",
    "description": "Did you know that the albums you purchase on Bandcamp can disappear from your collection without notice? This can happen for various reasons. For example, a seller might decide on a whim to remove the album from the platform. Bandcamp apparently allows this in their terms of use: Content you purchase in a Transaction cannot be guaranteed to be available to you perpetually. Users bear all risk from the denial of access to any Content purchased through the Service. The only way to make sure your a",
    "pubDate": "2024-04-04T12:15:00.000Z",
    "feedUrl": "https://mijailovic.net/feed.xml"
  },
  {
    "id": "https://mijailovic.net/2023/08/16/bug-finding-chronicles/2023-08-16T18:00:00+00:00My bug finding chronicles (and how to earn money through vulnerability research)",
    "title": "My bug finding chronicles (and how to earn money through vulnerability research)",
    "link": "https://mijailovic.net/2023/08/16/bug-finding-chronicles/",
    "description": "At least one person has asked me about my thought process when searching for denial-of-service vulnerabilities: how do I choose the target libraries, what specifically I look for in them, etc. “At least one person” meaning “exactly one person”, and that one person happens to be my wife, but I decided to write a whole post on this topic anyway! In this half-memoir, half-tutorial post, I’ll show you the most interesting bugs I’ve found so far and the methods I used to find them. I wouldn’t say I h",
    "pubDate": "2023-08-16T18:00:00.000Z",
    "feedUrl": "https://mijailovic.net/feed.xml"
  },
  {
    "id": "https://mijailovic.net/2023/07/23/sharpfuzz-anniversary/2023-07-23T17:00:00+00:00Five years of fuzzing .NET with SharpFuzz",
    "title": "Five years of fuzzing .NET with SharpFuzz",
    "link": "https://mijailovic.net/2023/07/23/sharpfuzz-anniversary/",
    "description": "It’s been almost five years since I created SharpFuzz, the only .NET coverage-guided fuzzer. I already have a blog post on how it works, what it can do for you, and what bugs it found, so check it out if this is the first time you hear about SharpFuzz: SharpFuzz: Bringing the power of afl-fuzz to .NET platform A lot of interesting things have happened since then. SharpFuzz now works with libFuzzer, Windows, and .NET Framework. And it can finally fuzz the .NET Core base-class library! The whole f",
    "pubDate": "2023-07-23T17:00:00.000Z",
    "feedUrl": "https://mijailovic.net/feed.xml"
  },
  {
    "id": "https://mijailovic.net/2023/04/01/denial-of-service/2023-04-01T08:30:00+00:00How StackOverflowException can bring down an expensive compute cluster",
    "title": "How StackOverflowException can bring down an expensive compute cluster",
    "link": "https://mijailovic.net/2023/04/01/denial-of-service/",
    "description": "In my previous post I talked about the dangers of StackOverflowException. I also promised to show you how denial of service looks like in real world. Today, I’m delivering on that promise! Let’s start by answering the fundamental question: how does a process crash lead to denial of service in the first place? Theoretical explanation Suppose you are running an HTTP web service and an attacker sends you a payload that will crash your server process. What happens next? First of all, crashing the se",
    "pubDate": "2023-04-01T08:30:00.000Z",
    "feedUrl": "https://mijailovic.net/feed.xml"
  },
  {
    "id": "https://mijailovic.net/2023/02/20/stack-overflow-exception/2023-02-20T18:20:00+00:00How safe are .NET serialization libraries against StackOverflowException",
    "title": "How safe are .NET serialization libraries against StackOverflowException",
    "link": "https://mijailovic.net/2023/02/20/stack-overflow-exception/",
    "description": "I have always been fascinated by .NET’s StackOverflowException. It’s interesting because it’s fundamentally different from most other exceptions—you can’t catch it with a try/catch block. When you overflow the stack, it’s game over—the runtime will terminate your process. This behavior is especially devastating for web services that are deserializing user-controlled data. If your data structure allows recursion, malicious users can easily craft a highly nested payload and use it to DDoS your web",
    "pubDate": "2023-02-20T18:20:00.000Z",
    "feedUrl": "https://mijailovic.net/feed.xml"
  },
  {
    "id": "https://mijailovic.net/2023/01/23/procrastination/2023-01-23T14:45:00+00:00Advanced lesson in procrastination",
    "title": "Advanced lesson in procrastination",
    "link": "https://mijailovic.net/2023/01/23/procrastination/",
    "description": "This story started while I was preparing my blog post about piracy. The idea was to make it clear that I am all for supporting artists with my money, while arguing that in some cases using piracy might be justified. I hadn’t even completed two sentences of the post before my brain decided to sabotage me with a seemingly innocent suggestion: “Hey, you should totally calculate the value of your Bandcamp collection, I bet it would make your position stronger!” Ok, mister brain, challenge accepted, ",
    "pubDate": "2023-01-23T14:45:00.000Z",
    "feedUrl": "https://mijailovic.net/feed.xml"
  },
  {
    "id": "697e64af4b1113c2c83dfc67",
    "title": "Noah Franche-Nolan: Music-Making as Spiritual Practice",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/noah-franche-nolan-music-making-as-spiritual-practice",
    "description": "Today we're putting The Tonearm's needle on pianist and composer Noah Franche-Nolan.Noah's latest album, Rose-Anna, is named after his Acadian great-grandmother, a church organist from Grand Falls, New Brunswick. The Acadians are French-speaking people with deep roots in Canada's Maritime provinces. The Acadians were expelled from their land by the British in the late 1700s and many of them migrated south to Louisiana where they became known by their more famous name, the Cajuns. Noah’s family c",
    "pubDate": "2026-02-01T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "69752d0179d88bc8ee7814c5",
    "title": "Michael Hallsworth: Escaping the Hypocrisy Trap",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/michael-hallsworth-escaping-the-hypocrisy-trap",
    "description": "Today we’re putting The Tonearm's needle on author and behavioral scientist Michael Hallsworth.Michel has spent the last two decades applying behavioral science to real-world problems at the Behavioural Insights Team. He's held positions at Princeton, Columbia, Imperial College London, and the University of Pennsylvania.Michael's new book, The Hypocrisy Trap, takes on something we all recognize instantly but rarely understand: why we're so quick to spot hypocrisy in others yet are blind to it in",
    "pubDate": "2026-01-25T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "696bf8b0f0f57e95a05c8f32",
    "title": "John Mlynczak: Why NAMM Still Matters in 2026",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/john-mlynczak-why-namm-still-matters-in-2026",
    "description": "We're putting The Tonearm's needle on&nbsp;John Mlynczak, President and CEO of the National Association of Music Merchants.NAMM is the trade association for the music, sound, and event industries. Basically, NAMM represents the companies that make the tools your favorite music artists use to create their work.John has spent years at Hal Leonard and PreSonus Audio, where music education meets technology. He built curricula, managed platforms, and taught teachers how to use tech in their classroom",
    "pubDate": "2026-01-18T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6962b7ba51136f5fcb501ae6",
    "title": "Patricia Brennan: Vibraphone Visions of the Universe",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/patricia-brennan-vibraphone-visions-of-the-universe",
    "description": "Today we're putting The Tonearm's needle on Patricia Brennan, a vibraphonist and composer who grew up in Veracruz, Mexico, playing salsa with her dad while listening to Hendrix and Zeppelin with her mom. She studied classical percussion at the Curtis Institute, performed with Yo-Yo Ma and the Philadelphia Orchestra, then found her voice and career in jazz and improvisation.Patricia’s latest album, Of The Near And Far, takes constellations from the summer sky and turns them into music. She superi",
    "pubDate": "2026-01-11T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "69595bb318c941d6d610b1da",
    "title": "Phil Haynes: Banging the Drum for Liberty Now",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/phil-haynes-banging-the-drum-for-liberty-now",
    "description": "Today we're putting The Tonearm's needle on drummer&nbsp;Phil Haynes.Since moving to New York from Oregon in 1983, Phil's played on scores of recordings with artists like Anthony Braxton and David Liebman. Phil has joined me once already, in March 2024, to discuss his memoir,&nbsp;Chasing the Masters: First Takes of a Modernist Drumming Artist.Phil’s with me today to discuss his band&nbsp;Free Country, which takes American roots music and runs it through their particular jazz lens, using cello, ",
    "pubDate": "2026-01-04T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "69504cc6c9578c8cdade8df0",
    "title": "Bryan Senti: Strings, Migration, and Finding Home",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/bryan-senti-strings-migration-and-finding-home",
    "description": "Today we're putting&nbsp;The Tonearm's needle on violinist and composer Bryan Senti.Bryan Senti won a BAFTA for scoring the BBC series&nbsp;Mood. He's composed for films since 2015 and worked with artists like Regina Spektor and Mark Ronson. But his new album&nbsp;La Marea&nbsp;tells a different story—his father's story.La Marea&nbsp;takes Cuban migration and turns it into sound. His previous album,&nbsp;Manu, honored his Colombian mother through short violin pieces. This time, Bryan recorded wi",
    "pubDate": "2025-12-28T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6949b7d0184761c0210887c7",
    "title": "Holiday Bonus: Nels Cline on the Wilco Will Love You Podcast",
    "link": "https://podcast.thetonearm.com/holiday-bonus-nels-cline-on-the-wilco-will-love-you-podcast",
    "description": "Our recent episode featuring Wilco and creative music guitarist Nels Cline has proven to be a listener-favorite. This holiday season, we thought it might be fun to give you even more of what we know you love. So … we are excited to bring you another conversation with Nels, this one from the Wilco Will Love You Podcast.Wilco Will Love You is hosted by two fans who cover the music and influence of the Chicago band. The podcast is co-hosted by Mary MacLane Mellas and The Tonearm’s contributing writ",
    "pubDate": "2025-12-23T09:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6946e6e9184761c021371f3b",
    "title": "Graham St. John: Terence McKenna's Hallucinatory Life",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/graham-st-john-terence-mckennas-hallucinatory-life",
    "description": "Today, we're putting The Tonearm's needle on Graham St John, a cultural anthropologist and Senior Research Fellow at the University of Huddersfield in the UK.Graham has spent decades studying transformational events, psychedelic culture, and electronic dance music scenes. He's written ten books, and his latest is Strange Attractor: The Hallucinatory Life of Terence McKenna, published by MIT Press. McKenna was the 20th century's psychedelic renaissance man, a stand-up philosopher who became a sam",
    "pubDate": "2025-12-21T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "693db9adf817d7dbe8c94306",
    "title": "Nels Cline: Tales of a Daunted Guitarist",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/nels-cline-tales-of-a-daunted-guitarist",
    "description": "Today, we’re putting The Tonearm’s needle on guitarist Nels Cline.Most people know Nels Cline as Wilco's guitarist for the past two decades. But his range goes far beyond indie rock. He's spent forty-plus years moving between jazz clubs, punk venues, and studios where the rules get bent or thrown out entirely. Rolling Stone put him on their list of the top 100 guitarists of all time, but that tells you nothing about how he actually plays.His current project, Trio of Bloom, pairs him with keyboar",
    "pubDate": "2025-12-14T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "69348f2438a11f5f3e713b7c",
    "title": "Marcus Roberts: Jazz Piano and Technology's Promise",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/marcus-roberts-jazz-piano-and-technologys-promise",
    "description": "Today, we're putting The Tonearm's needle on pianist Marcus Roberts.Roberts plays jazz piano like he's lived through its entire history. His style pulls from Jelly Roll Morton and Fats Waller as much as it does from bebop. He spent years in Wynton Marsalis's band, has performed piano concertos with Seiji Ozawa, and today leads The Modern Jazz Generation, a 12-piece ensemble encompassing three decades of musicians.Roberts is here today to talk about something beyond performance. He's one of twent",
    "pubDate": "2025-12-07T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "692b6ef8426af84c6da8a436",
    "title": "Ned Rothenberg: Solo Improvisation in Bizarre Times",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/ned-rothenberg-solo-improvisation-in-bizarre-times",
    "description": "Show NotesNed Rothenberg just released his first solo album in thirteen years, Looms &amp; Legends, and it shows why he's been called America's most intimate composer and improviser. Ned’s improvisations and compositions display his use of extended techniques like circular breathing and multiphonics, while others tell stories through melody. He calls it music for an imaginary culture - sounds that feel indigenous to a place that doesn't exist yet.Ned shared his views on the nature of experimenta",
    "pubDate": "2025-11-30T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6920d0cac367efee96369fbc",
    "title": "Miguel Zenón: Vanguardia Subterránea and the Sound of Sanctuary",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/miguel-zenon-vanguardia-subterranea-and-the-sound-of-sanctua",
    "description": "Today, we're putting&nbsp;The Tonearm's needle on saxophonist and composer&nbsp;Miguel Zenón.A MacArthur Fellow, Guggenheim recipient, and Grammy winner, Miguel has spent over two decades creating music that connects jazz tradition with Puerto Rican rhythms and modern composition.He's here to talk about his latest release,&nbsp;Vanguardia Subterránea&nbsp;- his quartet's first live album, captured at the Village Vanguard with musicians he's played with for twenty years. Miguel and I first spoke ",
    "pubDate": "2025-11-23T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "69178b02243c8d88705c73f1",
    "title": "Linda May Han Oh: In Search of Strange Heavens",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/linda-may-han-oh-in-search-of-strange-heavens",
    "description": "Today we're putting&nbsp;The Tonearm's needle on bassist and composer&nbsp;Linda May Han Oh.Linda's a Grammy winner who's recorded with Pat Metheny, Kenny Barron, and Joe Lovano. She was even the model for the bassist character in Pixar's 'Soul.' But it's her own work that brings us together.Her latest album,&nbsp;Strange Heaven, explores why we choose familiar hells over strange heavens—why we stick with what we know even when change might save us. It's a question that cuts through everything f",
    "pubDate": "2025-11-16T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "690e63a8c72b7869e2ac1e94",
    "title": "The Inaugural Jazz Forward Award Winners",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/the-inaugural-jazz-forward-award-winners",
    "description": "Today on The Tonearm, we're celebrating the inaugural&nbsp;Jazz Forward Award&nbsp;winners from&nbsp;All About Jazz. Since 1995, All About Jazz has been a driving force for jazz discovery. Now they're recognizing industry trailblazers who actively promote jazz awareness and culture.We'll hear from four organizations reshaping how jazz connects with audiences worldwide. Ed Trefzger from JazzWeek tracks radio airplay across North America, giving artists and their teams vital exposure data. Jesus P",
    "pubDate": "2025-11-09T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "690bcb6bd4fac9e84b1d33c9",
    "title": "Spotlight On is now . . . The Tonearm!",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/spotlight-on-is-now-the-tonearm",
    "description": "Hi, this is Lawrence Peryer with a quick update about some exciting changes coming to our show. Spotlight On is now The Tonearm—same name as our online magazine at thetonearm.com. Same conversations with the people and ideas moving culture forward, just a new name and a fresh look. The timing works out: this week marks one year since we launched The Tonearm online.We're also shifting from Thursday to Sunday episode releases. Why Sundays? Thursdays have gotten crowded—it seems like everyone drops",
    "pubDate": "2025-11-06T08:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "69028c000b16f40c39d97e66",
    "title": "Peter Knight: Hand to Earth's Sonic Homecoming",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/peter-knight-hand-to-earths-sonic-homecoming",
    "description": "Today, the Spotlight shines On composer, trumpeter, and producer Peter Knight.Peter Knight has spent decades working in the spaces between genres and cultures. His latest project brings together 40,000-year-old Indigenous Australian songs with contemporary electroacoustic music through Hand to Earth's new album, the title of which translates as \"the scent of home.\" The record finds Peter collaborating with Indigenous songkeepers Daniel and David Wilfred alongside Korean vocalist Sunny Kim, creat",
    "pubDate": "2025-10-30T07:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68f9354db24744dd48903f4f",
    "title": "David Harrington of Kronos Quartet: The Musician Listens",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/david-harrington-of-kronos-quartet-the-musician-listens",
    "description": "Today, the Spotlight shines On&nbsp;David Harrington, founder and violinist of&nbsp;Kronos Quartet.For fifty years, David has led one of the most adventurous musical ensembles on the planet. Kronos has commissioned over 1,100 works, collaborated with everyone from Philip Glass to Nine Inch Nails, and earned three Grammys along the way. Their recent \"Hard Rain\" project brought together nearly fifty artists worldwide to reimagine Bob Dylan's nuclear-age anthem, while the Library of Congress has ju",
    "pubDate": "2025-10-23T07:23:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68f00b74c0456d557e89c903",
    "title": "Jeff Parker: The Return of The New Breed",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/jeff-parker-the-return-of-the-new-breed",
    "description": "Today, the Spotlight shines On guitarist, composer, and producer&nbsp;Jeff Parker.For nearly three decades, Jeff has balanced solo work with his role in the post-rock band Tortoise. His 2016 album&nbsp;The New Breedtakes hip-hop beats and puts them in the hands of live musicians. Named after his late father's clothing store, the album just got the deluxe reissue treatment from International Anthem.He's here to discuss how moving to Los Angeles shaped his sound, why making \"identifiably human-mad",
    "pubDate": "2025-10-16T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68e6afa053a5e2858f6778f1",
    "title": "Hampus Lindwall: Blizzard of Organ",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/hampus-lindwall-blizzard-of-organ",
    "description": "Today, the Spotlight shines On organist, composer, and sound artist&nbsp;Hampus Lindwall.Hampus started as a guitarist who cut his teeth copying Steve Vai solos but who now sits behind a 78-stop church organ. He has been the organist at Saint-Esprit in Paris since 2005, but his latest album,&nbsp;Brace for Impact, throws tradition out the window. Recorded on a massive organ in Düsseldorf with guitarist Stephen O'Malley, this music draws on everything from experimental music pioneer Xenakis to he",
    "pubDate": "2025-10-09T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68ddad4f597bc7d53f290668",
    "title": "Chris O'Leary: Rebel Rebel - Blogger, Author",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/chris-oleary-rebel-rebel-blogger-author",
    "description": "Today, the Spotlight shines On writer&nbsp;Chris O'Leary.Chris has spent over a decade and a half writing what's become the definitive study of David Bowie's songbook. His blog, Pushing Ahead of the Dame, covers every song on every album in Bowie’s extensive canon. The first post from 2009 covers David’s first single, 1964’s “Liza Jane”, and the most recent is about Chris’s latest work, a newly revised edition of&nbsp;Rebel Rebel,&nbsp;a collection of his writings on Bowie songs from 1963 - 1976",
    "pubDate": "2025-10-02T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68d46435826776877c20c000",
    "title": "Donny McCaslin: From Stadium Jazz to Lost Lullabies",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/donny-mccaslin-from-stadium-jazz-to-lost-lullabies",
    "description": "Today, the Spotlight shines On saxophonist&nbsp;Donny McCaslin.Donny's new album,&nbsp;Lullaby for the Lost, arrives September 26th on Edition Records, and what a record it is. It’s Donny’s saxophone with guitar-driven rock energy, drawing from influences like Neil Young and Nine Inch Nails, resulting in what Donny calls his most personal music to date.You might know Donny from his pivotal role on David Bowie's final album ★ (pronounced Blackstar). His latest work demonstrates what may have draw",
    "pubDate": "2025-09-25T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68cb2e34bcf26cbb56a4e560",
    "title": "Matt Piucci of Rain Parade: Return to the Paisley Underground",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/matt-piucci-of-rain-parade-return-to-the-paisley-underground",
    "description": "Today, the Spotlight shines On Matt Piucci, founding member and principal guitarist of&nbsp;Rain Parade.Rain Parade helped define LA's Paisley Underground scene in the early '80s, creating music with psychedelic textures with punk energy. Their 1983 debut Emergency Third Rail Power Trip remains a touchstone album of the era, cited as an influence by everyone from My Bloody Valentine to the Stone Roses.Now Matt and the band are revisiting their catalog with deluxe reissues, including the newly ex",
    "pubDate": "2025-09-18T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68c202e405de5daa22bbd504",
    "title": "Robin Holcomb & Peggy Lee: Behind the Delicate Sound of 'Reno'",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/robin-holcomb-peggy-lee-behind-the-delicate-sound-of-reno",
    "description": "Today, the Spotlight shines On composer and pianist&nbsp;Robin Holcomb&nbsp;and cellist&nbsp;Peggy Lee.These two musicians have been creating music together for the better part of two decades. Their new album,&nbsp;Reno, out September 12, captures something rare: the kind of musical conversation that happens when two artists know each other's musical language inside and out. Robin's songs draw from American folk traditions while her piano work moves into territories that feel both classical and ",
    "pubDate": "2025-09-11T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68b8acf0ac09b9f650c6d59a",
    "title": "Larry Tye: The Jazzmen Who Changed American History",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/larry-tye-the-jazzmen-who-changed-american-history",
    "description": "Today, the Spotlight shines On bestselling author and journalist&nbsp;Larry Tye.Larry's latest book,&nbsp;The Jazzmen, tells the story of how Duke Ellington, Louis Armstrong, and Count Basie transformed America. But this isn't just another music biography. Larry explores nearly every aspect of the lives and music of these men and demonstrates how their artistry helped lay the groundwork for the civil rights movement.This is Larry's ninth book, following acclaimed biographies of figures like Bobb",
    "pubDate": "2025-09-04T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68af6cf0982c36846e54c01b",
    "title": "Rico Jones: The Spiritual Sax of BloodLines",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/rico-jones-the-spiritual-sax-of-bloodlines",
    "description": "Today, the Spotlight shines On tenor saxophonist&nbsp;Rico Jones.Rico's new album&nbsp;BloodLines&nbsp;captures something you don't hear much anymore—a live recording that feels like a complete story. Recorded at Brooklyn's Ornithology, it's five original compositions that explore his multicultural heritage, from his Indigenous and Latino roots to his deep connection with Black American musical traditions.Based in Harlem, Rico's already performed with Esperanza Spalding at the Blue Note and co-l",
    "pubDate": "2025-08-28T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68a638f73b6c865497240b78",
    "title": "Aqeel Aadam: Code, Creativity, and Democratization of Sound",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/aqeel-aadam-code-creativity-and-democratization-of-sound",
    "description": "Today, the Spotlight shines On musician, software engineer, and plug-in developer&nbsp;Aqeel Aadam.Aqeel's got deep roots in Philadelphia's music scene—his grandfather was a jazz musician who gifted him his first guitar. That foundation led him from Princeton's computer science and music programs to a five-year stint at Google, and eventually to creating his own company,&nbsp;Aqeel Aadam Sound.His plug-ins aim to bring the magic of hardware synthesizers and modular workflows into the digital rea",
    "pubDate": "2025-08-21T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "689cffdfb9b9dae0c7ad32d2",
    "title": "Rez Abbasi: When Everything Else Fades, Sound Remains",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/rez-abbasi-when-everything-else-fades-sound-remains",
    "description": "Today, the Spotlight shines On guitarist and composer&nbsp;Rez Abbasi.Rez's new album with his Acoustic Quintet,&nbsp;Sound Remains, puts steel-string acoustic guitar at the center of a deeply personal meditation on presence and impermanence. The album adds master percussionist Hasan Bakr to Rez's long-standing quartet with Bill Ware, Stephan Crump, and Eric McPherson, creating what Rez calls music where \"often the only thing that remains is sound.\"The 2021 Guggenheim Fellow has spent decades fi",
    "pubDate": "2025-08-14T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "689266df34f09da0e54d0070",
    "title": "Jeremy Sirota Grills Lawrence Peryer on Creative Leadership",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/jeremy-sirota-grills-lawrence-peryer-on-creative-leadership",
    "description": "Today, the Spotlight shines On someone we have not spoken to in a while…Over the years, we have periodically turned the tables by having friends and colleagues interview me, most notably in episode 100, or by airing talks and interviews I have done in other forums.Today is a little different. My longtime friend and colleague Jeremy Sirota is hosting a livestream series on LinkedIn called&nbsp;Creative Leadership. There, he interviews figures from the worlds of music, sports, business, and more t",
    "pubDate": "2025-08-07T07:03:35.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "688a84c16bbbf6afc71fd19e",
    "title": "Sean Imboden: Into the Heart of Big Band Jazz",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/sean-imboden-into-the-heart-of-big-band-jazz",
    "description": "Today, the Spotlight shines On saxophonist and composer&nbsp;Sean Imboden.Sean spent years touring with Broadway shows and working as a sideman, but something was missing. He stepped away from a lucrative career path and took a leap, returning to Indianapolis, where he ultimately formed his 17-piece orchestra. Now that ensemble releases&nbsp;Communal Heart, an album that captures the community spirit Sean has built around his music, as well as his transformation from comfortable sideman to big b",
    "pubDate": "2025-07-31T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68814a15f6d4262b07ebebf2",
    "title": "Glenn Dickson & Bob Familiar: The Clarinet in the Machine",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/glenn-dickson-bob-familiar-the-clarinet-in-the-machine",
    "description": "Today, the Spotlight shines On clarinetist&nbsp;Glenn Dickson&nbsp;and electronic musician&nbsp;Bob Familiar.When a cutting-edge klezmer artist meets a former rock synthesist, you might expect creative tension. Instead, Glenn and Bob found something else entirely—a shared language that turns clarinet and electronics into the most unlikely yet inspired pairings.Their new album&nbsp;All the Light of Our Sphere&nbsp;layers acoustic clarinet with synthesizers and loop devices to create what they des",
    "pubDate": "2025-07-24T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "687820476fb6cef50ff3e063",
    "title": "Gustavo Cortiñas: A Jazz Drummer's Call to Action",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/gustavo-cortias-a-jazz-drummers-call-to-action",
    "description": "Today, the Spotlight shines On drummer and composer&nbsp;Gustavo CortiñasGustavo's latest album,&nbsp;The Crisis Knows No Borders, tackles climate change head-on through music that's both urgent and beautiful. Working with guitarist Dave Miller, saxophonist Jon Irabagon, and violinist Mark Feldman, he's created compositions that explore how global warming sparks conflicts, drives migration, and connects us all, whether we like it or not.The Chicago-based artist has built a career using jazz as a",
    "pubDate": "2025-07-17T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "686ec6c3fe0897380e3ed4f3",
    "title": "Kim Perlak: Guitar, Percussion, and the Space Between",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/kim-perlak-guitar-percussion-and-the-space-between",
    "description": "Today, the Spotlight shines On guitarist and composer&nbsp;Kim Perlak.Kim chairs the guitar department at Berklee College of Music, where she's spent over a decade expanding from classical performance into composition and improvisation. Her new album,&nbsp;Spaces, is a collaboration with percussionist Francisco Mela. The record captures four nature-inspired suites that obliterate the lines between written music and spontaneous creation.The project shows how Kim moved from performing exclusively ",
    "pubDate": "2025-07-10T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68659f2d659c28f4ba556eb0",
    "title": "Terence Hannum: Revisiting Locrian's The Crystal World",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/terence-hannum-revisiting-locrians-the-crystal-world",
    "description": "Today, the Spotlight shines On&nbsp;Terence Hannum.Terence wears many hats. He is a visual artist, professor, and one-third of the experimental trio&nbsp;Locrian. It's the 15th anniversary reissue of Locrian's&nbsp;The Crystal World&nbsp;that brings us together today. This album marked a turning point for the band, transforming them from a duo into a full trio and giving structure to their sprawling sonic explorations.The record takes its name and inspiration from J.G. Ballard's 1966 novel, whic",
    "pubDate": "2025-07-03T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "685c64fdf42ce01224cca967",
    "title": "Knox Chandler: Exploring the Sound of the Shoreline",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/knox-chandler-exploring-the-sound-of-the-shoreline",
    "description": "Today, the Spotlight shines On guitarist&nbsp;Knox Chandler.Knox's name might ring a bell from his work with The Psychedelic Furs, Siouxsie and the Banshees, or maybe from his string arrangements on Depeche Mode's Exciter. However, his latest project takes an entirely different turn. After decades in the music business bouncing between New York, Berlin, and stages around the world, Knox found himself back in his Connecticut hometown caring for his aging mother.What started as a personal necessit",
    "pubDate": "2025-06-26T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "685334b6cf39b4f29a1f57b8",
    "title": "John Andrew Fredrick: The Black Watch Abides",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/john-andrew-fredrick-the-black-watch-abides",
    "description": "Today, the Spotlight shines On&nbsp;John Andrew Fredrick&nbsp;of&nbsp;The Black Watch.After thirty-seven years of making indie rock, the band’s latest album,&nbsp;For All the World, boasts an energy and vitality that surprises even John. John’s a great guest: His creative process remains rooted in uncertainty, he reads more about music than he listens to it, he draws inspiration from everything from Dostoyevsky to David Bowie, and believes the best songwriting comes from not knowing too much abo",
    "pubDate": "2025-06-19T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6849e98786b5e77739058ad8",
    "title": "Ingrid Laubrock: Purposing the Air with Music and Voices",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/ingrid-laubrock-purposing-the-air-with-music-and-voices",
    "description": "Today, the Spotlight shines On saxophonist and composer&nbsp;Ingrid Laubrock.Ingrid's just released&nbsp;Purposing The Air, a double album that sets 60 brief poems by&nbsp;Erica Hunt&nbsp;to music through four different vocal-instrumental duos. It's an ambitious project that transforms Hunt's emotionally sharp koans into what Ingrid calls \"a library of moods”—each piece capturing a different feeling, from the everyday to the searching.The project began during Ingrid’s master's studies, when she ",
    "pubDate": "2025-06-12T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68409a7ec8835d385c3c43d6",
    "title": "Kinan Azmeh: Live in Berlin, Rooted in Damascus",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/kinan-azmeh-live-in-berlin-rooted-in-damascus",
    "description": "Today, the Spotlight shines on clarinetist and composer&nbsp;Kinan Azmeh.Earlier this year, Kinan released&nbsp;Live in Berlin, his fourteenth album with his CityBand quartet. The album captures music he wrote during Syria's 2011 uprising—pieces that carry the weight of watching your homeland torn apart from thousands of miles away. Born in Damascus and now based in Brooklyn, Kinan has spent decades crossing the world with his clarinet, performing with Yo-Yo Ma's Silk Road Ensemble, the New York",
    "pubDate": "2025-06-05T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "683778ce9bd0275f2c58e15c",
    "title": "Tal Yahalom: A Guitarist's Mirror Image of Tradition",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/tal-yahalom-a-guitarists-mirror-image-of-tradition",
    "description": "Today, the Spotlight shines On guitarist and composer&nbsp;Tal Yahalom.Tal has built a reputation in New York's creative music scene for weaving post-bop, classical, and South American influences into a unique sound all his own. On his latest album,&nbsp;Mirror Image, Tal brings together a chamber quintet that puts his guitar in conversation with strings, woodwinds, and percussion, creating music that shifts between meditative reflection and striking exploration.(The musical excerpts heard in th",
    "pubDate": "2025-05-29T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "682e3a0ff1320103eb7e086f",
    "title": "Claire Cope: Orchestrating Stories of Brave Women",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/claire-cope-orchestrating-stories-of-brave-women",
    "description": "Today, the Spotlight shines On&nbsp;Claire Cope. This British composer crafts music that combines the freedom of jazz with the precision of classical music, drawing inspiration from women whose stories are often overlooked in history books.Caire’s new album&nbsp;Every Journey&nbsp;dropped in March to coincide with International Women's Day. On it, she expanded her original septet to an 11-piece band, giving her more colors to paint with as she tells stories of female explorers and their brave fi",
    "pubDate": "2025-05-22T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68250717571d171f04aa5f76",
    "title": "Mike Scott of The Waterboys: The Ballad of Dennis Hopper",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/mike-scott-of-the-waterboys-the-ballad-of-dennis-hopper",
    "description": "Today, the Spotlight shines On&nbsp;Mike Scott, founder of&nbsp;The Waterboys.In 2014, Mike stumbled upon Dennis Hopper’s photography in a London gallery and fell into a rabbit hole that led to&nbsp;Life, Death and Dennis Hopper, a bold concept album that tells the story of the&nbsp;Easy Rider&nbsp;star from childhood to beyond the grave. It's a sonic movie with guest turns from Bruce Springsteen, Fiona Apple, and Steve Earle that chronicles not just Hopper's journey but the cultural shifts he w",
    "pubDate": "2025-05-15T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "681bcdb0bdc60241402deccf",
    "title": "Craig Mod: Things Become Things That Last",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/craig-mod-things-become-things-that-last",
    "description": "Today, the Spotlight shines On&nbsp;Craig Mod, a writer, photographer, and walker who's spent the last 20 years making Japan his home.Random House has just released&nbsp;Things Become Other Things, a walking memoir that traces his 300-mile journey along ancient pilgrimage paths in rural Japan. The book blends sharp prose with striking photography, capturing conversations with aging fishermen, inn owners, and cafe \"mamas\" while reflecting on friendship, loss, and the disappearing village life of ",
    "pubDate": "2025-05-08T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68128e9dcea6682986757fa2",
    "title": "Tamiko Thiel: part 2 - art at technology's edge",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/tamiko-thiel-part-2-art-at-technologys-edge",
    "description": "Today, the Spotlight again shines on media artist&nbsp;Tamiko Thiel, in the second of our two-part conversation.In our first talk, we explored Tamiko's journey from designing the world's first AI supercomputer in the eighties to becoming a pioneering media artist. Today, we dive deeper into her groundbreaking work in virtual reality and other philosophical matters.Tamiko's been creating immersive digital worlds since the mid-1990s when she worked with Steven Spielberg on a virtual space for seri",
    "pubDate": "2025-05-01T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "68094a063744a61721bde473",
    "title": "Tamiko Thiel: part 1 - sculpting the electronic brain",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/tamiko-thiel-part-1-sculpting-the-electronic-brain",
    "description": "Today, the Spotlight shines On digital media artist Tamiko Thiel.To mark our special milestone of 250 episodes, we are kicking off a two-part conversation with media artist Tamiko Thiel.Tamiko has lived at the crossroads of art and technology for over 40 years. She designed the Connection Machine, the first commercial AI supercomputer that now sits in New York’s Museum of Modern Art. She's worked with everyone from Steven Spielberg to Richard Feynman, and pioneered virtual reality art before mos",
    "pubDate": "2025-04-24T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6800038b5d1edf45d20bbba9",
    "title": "Hunter Noack: Grand Piano & Grander Landscapes",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/hunter-noack-grand-piano-grander-landscapes",
    "description": "Today, the Spotlight shines On naturalist and classical pianist&nbsp;Hunter Noack.Redefining what a concert hall can be, Hunter Noack hauls a nine-foot Steinway grand piano to mountaintops, forests, and beaches for his series \"In a Landscape: Classical Music in the Wild.\"Hunter grew up in Central Oregon, where his love for music and nature took root. His concert series gives audiences wireless headphones and encourages them to wander through stunning settings while the music plays. It's part per",
    "pubDate": "2025-04-17T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67f6e37e0278731978734c94",
    "title": "Noah Preminger: A Veteran Saxophonist Tackles the Ballad",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/noah-preminger-a-veteran-saxophonist-tackles-the-ballad",
    "description": "Today, the Spotlight shines On renowned saxophonist&nbsp;Noah Preminger.Boston-based saxophonist Noah Preminger has spent years pushing jazz into new territories before focusing on one of the art form's most enduring traditions. He’s just released&nbsp;Ballads, a collection that finds this restless musical explorer settling into the quiet power of beautiful melodies.Noah's built his reputation on bold musical choices—from stark Delta blues interpretations to intricate duo sessions with bassist K",
    "pubDate": "2025-04-10T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67ed8d1474019617299f0cf6",
    "title": "Mary Halvorson & Sylvie Courvoisier: Bone Bells and the Art of Surprise",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/mary-halvorson-sylvie-courvoisier-bone-bells-and-the-art-of-",
    "description": "Today, the Spotlight shines On two artists who've taken the piano-guitar duo to bold new places.&nbsp;Sylvie Courvoisier&nbsp;and&nbsp;Mary Halvorson&nbsp;have just released&nbsp;Bone Bells, their third album, and a fresh showcase of their uncanny musical connection.These two players come from different worlds: Sylvie from European classical traditions and Mary from experimental jazz guitar circles. But when they join forces, something magical happens. Their music shifts from delicate to eruptiv",
    "pubDate": "2025-04-03T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67e4669f1d0429552eba3568",
    "title": "Phillip Golub: Recording the Impossible Piano",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/phillip-golub-recording-the-impossible-piano",
    "description": "Today, the Spotlight shines On&nbsp;Phillip Golub, a Brooklyn pianist taking his music in bold new directions.Phillip's new project,&nbsp;Loop 7, is a set of minimalist compositions performed on a piano tuned to 22 notes per octave instead of the usual 12. Working with producer Joseph Branciforte, he's created something that lives between acoustic chamber music and studio art.It's a groundbreaking approach—Phillip's performance was captured on a special Yamaha piano in a unique way he tells us a",
    "pubDate": "2025-03-27T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67d9d4b9d79e9e199107a3bb",
    "title": "TJ Dumser (Six Missing): Inner Space, Sobriety, and Soundscapes",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/tj-dumser-six-missing-inner-space-sobriety-and-soundscapes",
    "description": "Today, the Spotlight shines On&nbsp;Six Missing, the musical project of ambient artist&nbsp;TJ Dumser, who creates music that helps us connect with the present moment in ways we often forget.After encountering an intense phase of burnout, TJ turned his mental health struggles into&nbsp;Gentle Breath, a dark, lush EP that marks a new direction for this Austin-based artist. It's music that explores uncertainty with stunning depth—think Tangerine Dream meets the cosmic GAS records, but with TJ's di",
    "pubDate": "2025-03-20T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67d1ee822649312dd5df231d",
    "title": "Jenny Scheinman: A Violin in the Wild",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/jenny-scheinman-a-violin-in-the-wild",
    "description": "Today, the Spotlight shines On violinist and composer&nbsp;Jenny Scheinman.Jenny Scheinman grew up on California's remote Lost Coast, and now she brings us music that captures the wild beauty of her roots. Her double album&nbsp;All Species Parade&nbsp;brings together jazz and folk to create something wholly original that feels like the natural world itself.With a dream team of collaborators including Bill Frisell, Nels Cline, and Julian Lage on guitars, Jenny's violin leads us through soundscape",
    "pubDate": "2025-03-13T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67c8a97a3384591a38b3afad",
    "title": "Cary Baker: Adventures in Busking and Street Music",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/cary-baker-adventures-in-busking-and-street-music",
    "description": "Today, the Spotlight shines On&nbsp;Cary Baker, author of&nbsp;Down on the Corner: Adventures in Busking and Street Music.The music you hear on street corners and subway platforms has its untold history, and at age 16, Cary Baker followed a slide guitar's haunting melody through Chicago’s Maxwell Street Market to find himself face-to-face with bluesman Blind Arvella Gray. That chance encounter sparked a lifelong obsession.Cary's book,&nbsp;Down on the Corner, traces the heritage of street music ",
    "pubDate": "2025-03-06T08:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67bf66033beb1d1463b55dfc",
    "title": "Michael Dorf: From Knitting Factory to Patti Smith's Carnegie Tribute",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/michael-dorf-from-knitting-factory-to-patti-smith-carnegie",
    "description": "Today, the Spotlight shines On New York live music and venue impresario&nbsp;Michael Dorf.In addition to founding&nbsp;The Knitting Factory&nbsp;and&nbsp;City Winery, Michael has brought legendary artists together at Carnegie Hall for over twenty years, raising millions for music education while creating unforgettable tribute nights. He launched his first tribute show in 2004 after seeing how school music programs were vanishing.Now, he’s put together what might be his most powerful lineup yet. ",
    "pubDate": "2025-02-27T08:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67b4e072d24f7fcce81f92db",
    "title": "Greg Lisher: From Camper Van to Circuitry Man",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/greg-lisher-from-camper-van-beethoven-to-circuitry-man",
    "description": "Today, the Spotlight shines On&nbsp;Greg Lisher, a guitarist best known for alternative rock who has leaned hard into electronic music.Greg made his name playing with Camper Van Beethoven and Monks of Doom, but during the pandemic, he sat down at a keyboard and started exploring new sonic territory.The result is&nbsp;Underwater Detection Method, a collection of instrumental pieces that blend synthesizers with live strings and drums. It's an album that started as digital sketches and grew into so",
    "pubDate": "2025-02-20T08:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67acc1e59c6f7f7f285a33d5",
    "title": "Dorothy Lawson: ETHEL's String Theory for Quartets",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/dorothy-lawson-ethels-string-theory-for-quartets",
    "description": "Today, the Spotlight shines On&nbsp;Dorothy Lawson, a cellist who's helped redefine what a string quartet can be. Dorothy and the group&nbsp;ETHEL&nbsp;have spent years breaking down walls between classical, jazz, rock and world music.On March 13th at New York’s Carnegie Hall, Dorothy teams up with bass legend&nbsp;Ron Carter&nbsp;to reimagine his landmark Kronos Quartet recording from 40 years ago, featuring arrangements of music by Thelonious Monk.Dorothy shares how ETHEL has evolved through f",
    "pubDate": "2025-02-13T08:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67a26f1b81e6fa80bb24af50",
    "title": "Jamie Baum: a flutist sets poetry in motion",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/jamie-baum-a-flutist-sets-poetry-in-motion",
    "description": "Today, the Spotlight shines On flutist Jamie Baum.When COVID hit, Jamie found inspiration and solace in poetry. What started as daily readings of women poets became something much bigger: an album blending jazz and spoken word.As leader of her long-running Septet+, Jamie has crafted wide-ranging music for over twenty years. She has played everywhere, from major jazz festivals to tiny clubs in 35 countries, bringing her distinctive sound to collaborations with artists like Paul Motian, Randy Brec",
    "pubDate": "2025-02-06T08:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6799533ea7ace681d8255b9c",
    "title": "Anat Cohen: Clarinet in Full Bloom",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/anat-cohen-clarinet-in-full-bloom",
    "description": "Today, the Spotlight shines On clarinetist&nbsp;Anat Cohen.Anat’s been bringing her joyful spirit to jazz venues worldwide for two decades, blending swing, Brazilian rhythms, and melodies from her native Israel. Her 2024 album&nbsp;Bloom&nbsp;pairs her musical warmth with that of her quartet&nbsp;Quartetinho&nbsp;- Portuguese for \"little quartet\" - creating intimate conversations between clarinet, piano, bass, and percussion.Anat will mark her 50th birthday this spring with four special nights a",
    "pubDate": "2025-01-30T08:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67914910455ab42f9dd82240",
    "title": "Marina Albero: from pianist to nomad of sound",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/marina-albero-from-pianist-to-nomad-of-sound",
    "description": "Today, the Spotlight shines On pianist and composer&nbsp;Marina Albero.From Barcelona’s vibrant music scene to the heart of New Orleans, Marina keeps finding new ways to push musical boundaries. Her latest album,&nbsp;A Nomad of Sound, brings together jazz, classical, and world music traditions in a blend all her own.Marina has journeyed across continents and cultures—from her early years studying classical piano in Cuba to recent acclaim in Seattle, where she’s twice been named Musician of the ",
    "pubDate": "2025-01-23T08:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67881bf7339cdeb44cf54f03",
    "title": "Jonathon Grasse: the life & music of Eric Dolphy",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/jonathon-grasse-the-life-music-of-eric-dolphy",
    "description": "Today, the Spotlight shines On author Jonathon Grasse. His new book,&nbsp;Jazz Revolutionary, traces Eric Dolphy’s journey from the clubs of 1940s Los Angeles to his groundbreaking work in New York’s avant-garde jazz scene.Eric Dolphy’s revolutionary voice in jazz was silenced far too soon. He was an artist who pushed the boundaries of what was possible on alto sax, flute, and bass clarinet, collaborating with giants like John Coltrane and Charles Mingus before his tragic death in 1964 at the ag",
    "pubDate": "2025-01-16T08:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "677edbeef48b51537ca8c9b6",
    "title": "Lisa Pegher: Rhythms, Circuits, & Artificial Intelligence",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/lisa-pegher-rhythms-circuits-artificial-intelligence",
    "description": "Today, the Spotlight shines On innovative percussionist and drummer&nbsp;Lisa Pegher.Lisa turns percussion into something you’ve never heard before. A pioneering artist who moves easily between classical concert halls and electronic music spaces, Lisa wields everything from traditional drums to cutting-edge AI technology.She’s performed with major orchestras worldwide and premiered works by today’s leading composers, but what sets Lisa apart is her drive to push percussion into new territory.Her",
    "pubDate": "2025-01-09T08:03:15.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67759bef6768fc427143c034",
    "title": "Paul de Barros: chronicling Marian McPartland's life in jazz",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/paul-de-barros-chronicling-marian-mcpartlands-life-in-jazz",
    "description": "Today, the Spotlight shines On award-winning jazz critic and author&nbsp;Paul de Barros.Throughout his storied career, Paul was editor and critic at the Seattle Times and has written for Downbeat and Earshot Jazz, amongst other outlets. He is also the author of&nbsp;Jackson Street After Dark: The Roots of Jazz in Seattle&nbsp;but today, he joins us to talk about the updated edition of his book&nbsp;Shall We Play That One Together? The Life and Art of Jazz Piano Legend Marian McPartland, which co",
    "pubDate": "2025-01-02T08:03:46.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "676b2c9d8e646d14de324e56",
    "title": "Küf Knotz & Christine Elise: when hip-hop meets harp",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/kuf-knotz-christine-elise-when-hip-hop-meets-harp",
    "description": "Today, the Spotlight shines On the duo of songwriter, producer, and MC&nbsp;Küf Knotz&nbsp;and harpist, vocalist, and music therapist&nbsp;Christine Elise.Küf and Christine have turned the unlikely harp and hip-hop track combo into pure magic with their 2024 album&nbsp;Hypnagogia. The album explores the space between awake and dreaming, with surreal soundscapes and vivid imagery that pulls listeners in.They’ve shared stages with artists like Wyclef Jean, Rising Appalachia, and Digable Planets. E",
    "pubDate": "2024-12-26T08:03:11.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67631d0a6ba7599e648d28d0",
    "title": "Christoph Dallach: krautrock origins from schlager to synthesizers",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/christoph-dallach-krautrock-origins-from-schlager-to-synth",
    "description": "Today, the Spotlight shines On author&nbsp;Christoph Dallach, who joins me to discuss his book&nbsp;Neu Klang: The Definitive History of Krautrock.Christoph has spent years tracking down the pioneers who spent the late 1960s in West Germany’s basements and practice rooms, creating sounds unlike anything else in rock and roll.Through conversations with members of bands like Can, Kraftwerk, and Tangerine Dream, Christoph uncovers how these artists shaped a distinctly German sound in the shadow of ",
    "pubDate": "2024-12-19T08:03:35.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6759e3f5c2a496b7a34f4032",
    "title": "Marwan Allam: a Tunisian gateway to modern jazz",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/marwan-allam-a-tunisian-gateway-to-modern-jazz",
    "description": "Today, the Spotlight shines On bassist and composer&nbsp;Marwan Allam.Marwan’s debut album,&nbsp;Bab Bhar, takes Arabic rhythms and Tunisian musical traditions and hands them to a jazz quartet, creating something that feels both ancient and brand new.Marwan tunes and plays his bass to echo the sound of the gimbri, a traditional three-string instrument from his native Tunisia. He’s here to walk us through this groundbreaking approach and share how growing up at the crossroads of North African mus",
    "pubDate": "2024-12-12T08:03:39.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6750c513aeaa2d78dfa7216b",
    "title": "Joe Brent: mandolin magic from Vivaldi to Vinegar Hill",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/joe-brent-mandolin-magic-from-vivaldi-to-vinegar-hill",
    "description": "Today, the Spotlight shines On composer, mandolinist, multi-instrumentalist, teacher, and label founder&nbsp;Joe Brent.Joe has worked with artists ranging from Regina Spektor to the Philip Glass Ensemble, but his collaboration with Grammy-nominated violinist Sara Caswell and bassist Andrew Ryan in 9 Horses was the impetus for our time together. 9 Horses creates music between classical precision and folk intimacy with mandolins and violins. On their latest album, Strum, 25 musicians create what J",
    "pubDate": "2024-12-05T08:03:27.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "674782f5c4b78e9ebb32658c",
    "title": "Round Room Live: crafting family entertainment's next act",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/round-room-live-crafting-family-entertainments-next-act",
    "description": "Today, the Spotlight shines On&nbsp;Stephen Shaw&nbsp;and&nbsp;Jonathan Linden&nbsp;of&nbsp;Round Room Live.Round Room Live has become a powerhouse in family entertainment, from Broadway blockbusters to kids' favorite TV characters coming to life on stage.Stephen Shaw and Jonathan Linden launched the company in 2016 with a bold idea—take their experience from massive rock tours and use it to create live shows that capture the magic of beloved brands, from Sesame Street to Formula One. They’ve bu",
    "pubDate": "2024-11-28T08:03:58.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "673cf7deed9403388033684d",
    "title": "Taylor Deupree & Joseph Branciforte: reimagining Stil.",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/taylor-deupree-joseph-branciforte-reimagining-stil",
    "description": "Today, the Spotlight shines On experimental music producers and label owners&nbsp;Taylor Deupree&nbsp;and&nbsp;Joseph Branciforte.Back in 2002, Taylor Deupree released an electronic album called&nbsp;Stil.&nbsp;That release captivated listeners with its quiet, repeating patterns and stark digital sound. Twenty years later, Taylor and producer Joseph Branciforte linked up to reimagine the album as&nbsp;Sti.ll, rebuilding the entire work using only non-electronic instruments.The new version takes ",
    "pubDate": "2024-11-21T08:03:52.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6734fc60904ff5823dbfcb2c",
    "title": "Anders Koppel: the Hammond's Danish master",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/anders-koppel-the-hammonds-danish-master",
    "description": "Today, the Spotlight shines On legendary Danish organist&nbsp;Anders Koppel.Great music often runs in the family, and as proof, we have our first father-son episodes of Spotlight On. Last November, we had Benjamin Koppel, son and collaborator of today’s guest.But today’s story starts decades ago when Anders played Newport with his band Savage Rose. Fast forward to now, and Anders is back at the Hammond B3, making magic with Benjamin on alto sax and the incredible Brian Blade on drums.This trio c",
    "pubDate": "2024-11-14T08:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "672bd6415095c9add9e3ae64",
    "title": "Christian McBride: jazz notes from the engine room",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/christian-mcbride-jazz-notes-from-the-engine-room",
    "description": "Today, the Spotlight shines On Christian McBride, a musician, recording artist, prolific composer, arranger, producer, cultural curator, dedicated educator, and mentor.Christian has been called the hardest-working person in jazz, and based on what I just rattled off, that might be underselling it. From his early days in Philadelphia soaking up the sounds of Philly Soul to sharing stages with legends like Ray Brown and Chick Corea, Christian has become a bridge between jazz’s rich history and its",
    "pubDate": "2024-11-07T08:03:50.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6722812c9d32b8a193436c71",
    "title": "Erik Davis: the beatification of blotter art",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/erik-davis-the-beatification-of-blotter-art",
    "description": "What can be scarier than Halloween ghouls? How about a trip through the LSD underground?Today, the Spotlight shines On&nbsp;Erik Davis, and this trip is no bummer. Erik is an author, award-winning journalist, and teacher in San Francisco. He is the author, most recently, of&nbsp;Blotter: The Untold Story of an Acid Medium_, a study of LSD blotter art. And that’s what he’s joined us to talk about.Erik also wrote one of my favorite books,&nbsp;High Weirdness: Drugs, Esoterica, and Visionary Experi",
    "pubDate": "2024-10-31T07:03:22.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "671937e930187dfb6cd5ff78",
    "title": "Josh Johnson: unusual objects and saxophone stories",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/josh-johnson-unusual-objects-and-saxophone-stories",
    "description": "Today, the Spotlight shines On&nbsp;Josh Johnson, the Los Angeles-based saxophonist, composer, multi-instrumentalist, and Grammy Award-winning producer.Josh joined me earlier this year to talk about his second solo album,&nbsp;Unusual Object, which came out this past April on Northern Spy Records. Equal parts futuristic jazz and modern composition, Josh uses processed saxophone and subtle samples in his unique compositions.In addition to examining&nbsp;Unusual Object, we discussed the relevance ",
    "pubDate": "2024-10-24T07:03:27.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "670ed89eb1e7b0e7e5d0ec97",
    "title": "Shawn Mativetsky: a tabla adventure through Temporal Waves",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/shawn-mativetsky-a-tabla-adventure-through-temporal-waves",
    "description": "Today, the Spotlight shines On composer and percussionist&nbsp;Shawn Mativetsky. A renowned tabla player, Shawn is a pioneer in bridging the worlds of Western and Indian classical music.We discussed the intricacies of traditional Indian music, including the setup and tuning of the instruments, the guru-disciple relationship, and the reception of Western musicians in the Hindustani community. We also explored the importance of deep learning, consistent practice, and research in mastering a musica",
    "pubDate": "2024-10-17T07:03:17.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "67048391a77002bfdd0ee133",
    "title": "Paul Stache: The Art of Running Smoke Jazz Club in NYC",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/paul-stache-the-art-of-running-smoke-jazz-club-in-nyc",
    "description": "Today, the Spotlight shines On&nbsp;Paul Stache, co-owner (with his wife and partner Molly Sparrow Johnson) of&nbsp;Smoke Jazz Club, one of New York City’s premier live music venues. Smoke is celebrating its 25th anniversary throughout 2024 and Paul joined us to talk about the storied venue’s past, present, and future.In addition to the club’s 25th Anniversary Celebration plans, we hit on topics like how their business has navigated the transition to a digital world, insight into managing an ind",
    "pubDate": "2024-10-10T07:03:35.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66fdad214f98175c75361775",
    "title": "Building Music Communities: Thinking Global & Acting Local",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/building-music-communities-thinking-global-acting-local",
    "description": "Today, the Spotlight is going to shine a little differently. Instead of a single guest, we will have three segments dealing with the importance of local music scenes.Our first guest is Shain Shapiro. Shain is a thought leader working at the intersection of music, culture, and urban policy. His book, This Must Be The Place: How Music Can Make Your City Better, came out last year on Repeater Books. Shain has defined a new way to think about the value of music and the creative economy in cities and",
    "pubDate": "2024-10-03T07:03:08.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66f4652dc7d3a08180cec053",
    "title": "Devin Gray: Most Definitely's solo drum universe",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/devin-gray-most-definitelys-solo-drum-universe",
    "description": "Today, the Spotlight shines On drummer and composer&nbsp;Devin Gray.Like me, Devin is a born New Englander who made his way to Brooklyn, though unlike me, he splits his time between Brooklyn and Berlin.Devin has performed with Spotlight On alumni Angelica Sanchez and Satoko Fuji, as well as a who’s who of the creative music scene: David Liebman, Sylvie Couvoisier, Tim Berne, Nate Wooley, and many others.Our conversation ranged from Devin’s earliest exposures to music, his self-taught approach to",
    "pubDate": "2024-09-26T07:03:44.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66eb1aadbbcf745f11ab281c",
    "title": "Brad Mindich: the art and craft of archiving stardom",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/brad-mindich-the-art-and-craft-of-archiving-stardom",
    "description": "Today, the Spotlight shines On Brad Mindich, an entrepreneur who works directly with artists, athletes, and others in music, culture, and sports to expand their legacies and create powerful connections with their fans.Brad currently does this work as the founder and CEO of Inveniem/Definitive Authentic, which helps its clients organize, catalog, present, and oftentimes monetize their archives directly to their audiences.Brad has worked with Metallica, Def Leppard, Stephen Stills, basketball star",
    "pubDate": "2024-09-19T07:03:24.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66e1e3c19a7dcc160e6149ca",
    "title": "Andy McCluskey: kicking down fascist art with OMD",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/andy-mccluskey-kicking-down-fascist-art-with-omd",
    "description": "Today, the Spotlight shines On&nbsp;Andy McCluskey, the singer, songwriter, musician, and producer best known as the lead singer and bass guitarist of&nbsp;Orchestral Manoeuvres in the Dark&nbsp;(also known as OMD). Andy joined Spotlight On producer and guest host Michael Donaldson to discuss topics as varied as the political messages behind their latest work, post-modern society, Kraftwerk, and the Bauhaus art school.OMD is not working the nostalgia circuit, though no one would blame them if th",
    "pubDate": "2024-09-12T07:03:32.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66d8cf25eeeb1e3b7551f64d",
    "title": "Gordon Grdina: the axe man cutting down borders",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/gordon-grdina-the-axe-man-cutting-down-borders",
    "description": "Today, the Spotlight shines On JUNO Award-winning oud player and guitarist Gordon Grdina.Gordon’s work defies limitations, be they geographical, distance, time, or genre. He incorporates avant-garde jazz, free improvisation, indie rock, and Arabic tradition into his music.So much music, so many collaborators, and so much ground to cover in our talk. We made the most of our time together, exploring projects, processes, the fusion of musical traditions, appropriation, authenticity, and more.If you",
    "pubDate": "2024-09-05T07:03:22.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66cf78344960e4eb18d739a5",
    "title": "Steve Wynn: a music and memoir grand slam",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/steve-wynn-a-music-and-memoir-grand-slam",
    "description": "Today, the Spotlight shines On trailblazing songwriter and now memoirist&nbsp;Steve Wynn.Steve first hit public consciousness in the early 1980s with his band&nbsp;The Dream Syndicate, frequently mentioned in the same breath as REM and The Replacements as the pioneers of American indie rock.The Dream Syndicate’s initial run did not outlast the decade that birthed them, but Steve’s career did, with over 30 years of solo albums and collaborations to his credit—including a relaunched Dream Syndicat",
    "pubDate": "2024-08-29T07:03:56.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66c62422222779d3ef3d92a1",
    "title": "Graham Reynolds: soundtrack virtuoso takes center stage",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/graham-reynolds-soundtrack-virtuoso-takes-center-stage",
    "description": "Today, the Spotlight shines On the acclaimed and intriguing composer, bandleader, and improviser&nbsp;Graham Reynolds.The Austin-based Reynolds has composed for countless film, television, dance, and theatrical productions, serving most notably as the sonic collaborator of director Richard Linklater. He is also Artistic Director of the new music-focused non-profit Golden Hornet.Graham joined me on the occasion of his solo release from earlier this year,&nbsp;Music for Prophet (Parts 1–4), on&nbs",
    "pubDate": "2024-08-22T07:03:56.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66bd068bf499877c94d1277e",
    "title": "Satoko Fujii: composing beyond the jazz spirit",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/satoko-fujii-composing-beyond-the-jazz-spirit",
    "description": "Today, the Spotlight shines On pianist and composer&nbsp;Satoko Fujii, an incredibly unique and prolific artist.Satoko works at the intersection of jazz, contemporary classical, rock, and traditional Japanese music, composing for ensembles of many sizes and configurations. However, she is especially adept with the jazz orchestra format. For all of her efforts, Satoko is widely decorated as an improviser, composer, arranger, and band leader.Satoko has released over 100 albums as leader or co-lead",
    "pubDate": "2024-08-15T07:03:17.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66b3a9f2129e9b2ef6a07b75",
    "title": "David J: unearthing tracks from the attic",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/david-j-unearthing-tracks-from-the-attic",
    "description": "Today, the Spotlight shines On the musician and producer David John Haskins, better known to the world as&nbsp;David J, bassist and co-founder of both post-punk goth band Bauhaus and, subsequently, Love and Rockets.As if having such a luminary visiting our podcast isn’t enough, today’s talk is guest-hosted by Spotlight On producer Michael Donaldson, who filled in for me for this and another special episode we will tell you about soon.David came by to talk about&nbsp;Tracks from the Attic&nbsp;(r",
    "pubDate": "2024-08-08T07:03:44.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66aa90dcec85576657f0e00f",
    "title": "Ches Smith & Shara Lunon: dismantling musical conventions",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/ches-smith-shara-lunon-dismantling-musical-conventions",
    "description": "Today, the Spotlight was meant to shine On drummer, percussionist, and composer&nbsp;Ches Smith, whose album&nbsp;Laugh Ash&nbsp;was released earlier this year on&nbsp;Pyroclastic Records. As we arranged to get together, Ches suggested we include&nbsp;Shara Lunon, the transdisciplinary poet, vocalist, composer, and improviser featured on the album.Laugh Ash&nbsp;is one of the most intriguing records I have encountered in quite some time, with its mix of form and improvisation, acoustic and synth",
    "pubDate": "2024-08-01T07:03:10.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66a14009cf69f9782df2716c",
    "title": "Live at The Royal Room: improvisation in music and life",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/live-at-the-royal-room-improvisation-in-music-and-life",
    "description": "Today’s episode is a recording of our recent live event, which took place at The Royal Room in Seattle, WA, on June 22, 2024. The event, Improvisation in Music and Life, featured me in conversation with and performances by James Falzone’s Division Ensemble.The Division Ensemble is a group of master improvisers that includes James Falzone on clarinet, Ray Larsen on trumpet, Wayne Horvitz on piano, Abbey Blackwell on bass, and Rocky Martin on drums.During the live show, we explored the nature of i",
    "pubDate": "2024-07-25T07:03:04.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66980a4ac86d4486beb9c53c",
    "title": "Riccardo La Foresta: drumming without drumming",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/riccardo-la-foresta-drumming-without-drumming",
    "description": "Today, the Spotlight shines On Modena, Italy-based sound artist and percussionist&nbsp;Riccardo La Foresta.Riccardo has spent the last several years exploring the Drummophone—an array of bass drums that create sound by being confronted with compressed air and which, in turn, produce complex acoustic drones. By combining the Drummophone with other electro-acoustic devices and changes in the air pressure in the room where it is set up, a generative system results, one that can create endless possi",
    "pubDate": "2024-07-18T07:03:23.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "668ed3aec24ce97c60ef1dea",
    "title": "Janek van Laak: drumming up a circle of madness",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/janek-van-laak-drumming-up-a-circle-of-madness",
    "description": "Today, the Spotlight shines On Berlin-based drummer, composer, and producer&nbsp;Janek van Laak.Janek grew up in post-reunification Berlin which gave birth to a vibrant culture of music and art. He joined me earlier this year, around the&nbsp;Sonar Kollektiv&nbsp;release of his debut solo album,&nbsp;Circle Of Madness, a work that makes me glad I do not own a record store because I have no idea where I would file it. That said, it might not get filed at all because it would be playing all day.Li",
    "pubDate": "2024-07-11T07:03:04.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6685a9d4f364c6400821c659",
    "title": "Bill Anschell: unearthing jazz's improbable solutions",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/bill-anschell-unearthing-jazzs-improbable-solutions",
    "description": "Today, the Spotlight shines On Seattle pianist and composer Bill Anschell.We’ve had award winners of all types on the podcast, but as far as I can remember, Bill is the first to have won an award for humor: in 2014, Bill was the winner of the inaugural Paul Desmond Award, the website All About Jazz’s celebration of the funniest jazz artists. We get to that and his satirical essay, “Careers in Jazz,” which is the all-time most-read piece on All About Jazz.As a much younger man, Bill left Seattle ",
    "pubDate": "2024-07-04T07:03:01.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "667c5e662036786e1930fe91",
    "title": "Ruiqi Wang: subduing the silence with vocal improvisation",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/ruiqi-wang-subduing-the-silence-with-vocal-improvisation",
    "description": "Today, the Spotlight shines On vocalist, composer, and improviser 王睿琪 Ruiqi Wang (pronounced as “Ray-Chee Wong”).Ruiqi Wang creates stunning experimental music, combining influences from jazz, contemporary Euro-classical music, and traditional Chinese music.Ruiqi Wang joined me earlier this year on the heels of the release of her debut album, Subduing the Silence, out through Orchard of Pomegranates. This profound, 36-minute album boasts an all-female cast of collaborators and expresses a musica",
    "pubDate": "2024-06-27T07:03:49.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66731114d51efba9c84613d3",
    "title": "Paul Chastain: The Small Square's big sounds",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/paul-chastain-the-small-squares-big-sounds",
    "description": "Today, the Spotlight shines On singer, songwriter, and multi-instrumentalist Paul Chastain.Paul is one half of the duo The Small Square, with drummer, percussionist, and vocalist John Louis Richardson. He is also a songwriter for and co-founder of the group Velvet Crush and has worked with Matthew Sweet, Roger McGuinn, Susanna Hoffs, the late Tommy Keene, and many others.Paul and John released the second record from The Small Square, Ours &amp; Others, on Farm to Label Records in October 2023. W",
    "pubDate": "2024-06-20T07:03:33.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6669ee66fea45500124a39dd",
    "title": "Jeff Slate: tales from a rock 'n' roll troubadour",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/jeff-slate-tales-from-a-rock-n-roll-troubadour",
    "description": "Today, the Spotlight shines On musician, songwriter, journalist, and returning guest, Jeff Slate.Jeff joined us about two years ago and while that discussion was more focused on his work as a writer and cultural observer, this talk focuses on his music career.Based in New York City, Jeff has traveled quite an interesting road from his roots in the mid-80s post-punk world to rubbing shoulders and working with luminaries like Steve Jones of the Sex Pistols, Pete Townshend, Roger McGuinn, Jeff Twee",
    "pubDate": "2024-06-13T07:03:12.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6660c8d446cf46001219958f",
    "title": "Katie Ernst: bass notes and murder ballads",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/katie-ernst-bass-notes-and-murder-ballads",
    "description": "Today, the Spotlight shines On bassist and vocalist Katie Ernst. In addition to many other things, Katie is one half of the duo Wayfaring with last week’s guest James Falzone.Katie is also co-leader of the Chicago-based jazz trio Twin Talk, and the indie rock band Edith Judith, and has garnered much acclaim for her Dorothy Parker poetry song cycle Little Words, which premiered at the Kennedy Center in Washington, DC.Katie is a working musician, performing as part of many jazz and improvised musi",
    "pubDate": "2024-06-06T07:03:30.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66577d83904d07001325072f",
    "title": "James Falzone: joyful noise from the pain stick",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/james-falzone-joyful-noise-from-the-pain-stick",
    "description": "Today, the Spotlight shines on clarinetist, penny whistle player, composer, improviser, and educator James Falzone.James and I have been collaborating on an upcoming live event, Improvisation in Music and Life, taking place on June 22 at the Royal Room in Seattle. This will be a unique program of performance and conversation between me and the five-piece James Falzone Division Ensemble. We will explore the nature of improvisation in music and how its principles can be useful in all aspects of li",
    "pubDate": "2024-05-30T07:03:41.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "664e3ccf7372690012629fd8",
    "title": "Francesco Crosara: jazz journeys from Rome to Seattle",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/francesco-crosara-jazz-journeys-from-rome-to-seattle",
    "description": "Today, the Spotlight shines on jazz pianist, composer, and educator Francesco Crosara.Francesco was born and raised in Rome, Italy, where both jazz and classical music came into his life early on, particularly through his mother, the influential jazz singer, broadcaster, and educator Lilian Terry. Lilian presented many of the most important names in American jazz, and some—like Max Roach, Abbey Lincoln, Chick Corea, and Dizzy Gillespie—influenced young Francesco’s artistic growth.We spoke in ear",
    "pubDate": "2024-05-23T07:03:37.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "664501c0254df10012b0b291",
    "title": "Kavita Shah: embracing the saudade of Cape Verde",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/kavita-shah-embracing-the-saudade-of-cape-verde",
    "description": "Today, the Spotlight shines On award-winning vocalist, composer, ethnomusicology researcher, and educator Kavita Shah.Kavita’s work sits at the intersection of modern jazz, new creative music, and world traditions. The impetus for her visit today was her 2023 tribute to African legend Cesária Évora, Cape Verdean Blues (2023). We discuss that music as well as her personal experiences as a lifelong New Yorker of Indian origin, her work as an advocate for gender and racial equity in the arts, and m",
    "pubDate": "2024-05-16T07:03:54.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "663bae871859e200127e69f8",
    "title": "R.U. Sirius: inside the mind of a cyberdelic shaman",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/ru-sirius-inside-the-mind-of-a-cyberdelic-shaman",
    "description": "Today, the Spotlight shines On legendary writer, vocalist and digital culture commentator, Ken Goffman, better known as R.U. Sirius.Most will know R.U. from his time as co-publisher and editor-in-chief of the 1990s cyberpunk magazine MONDO 2000. MONDO covered topics like transhumanism, virtual reality and smart drugs at a time when these things offered hope for a better or at least more interesting world, though the editorial tone always subversively poked at the soft white underbelly of technoc",
    "pubDate": "2024-05-09T07:03:24.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "662e9d37437bd70012e69c8a",
    "title": "Markus Reuter: recording music across space and time",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/markus-reuter-recording-across-space-and-time",
    "description": "Today, the Spotlight shines On returning guest, the innovative musician and composer Markus Reuter.Markus originally joined us for Episode 130 back in November 2022. He joins us now to discuss his project Sea of Hopeless Angels (Unsung Records), which began as several unedited studio solo improvisations by Markus on his electric touch guitar. Those recordings were turned over to mixer Stefano Castagna, whose sonic wizardry included not only mixing but fully collaborating with the recordings, add",
    "pubDate": "2024-05-02T07:03:04.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6625722f0b1232001234072a",
    "title": "Hainbach: crafting soundscapes from forgotten relics",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/hainbach-crafting-soundscapes-from-forgotten-relics",
    "description": "Today, the Spotlight shines On Berlin-based electronic music composer and performer Hainbach.I have come to view Hainbach as much an archeologist or audio specimen collector as he is a musician. While he makes beautiful music and soundscapes, they are often showcase pieces for the devices he works on, which include not only vintage and rare modular synthesizers but also tape machines, test equipment, and other industrial machinery. A particular highlight of his work is his YouTube channel, where",
    "pubDate": "2024-04-25T07:03:06.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "66203ffb3b67380013a7c791",
    "title": "Kevin Sun: emotion, technique, and the language of jazz",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/kevin-sun-emotion-technique-and-the-language-of-jazz",
    "description": "Today, the Spotlight shines On saxophonist/composer Kevin Sun.Kevin joined us to discuss, among other things, his dramatic double album from 2023, The Depths of Memory, which was released in two halves: From All This Stillness in July of that year and The Depths in Slow Motion in October of that year.Kevin’s an intense yet accessible player and composer—and a true working musician. He leads an ensemble most Tuesday nights at Lowlands Bar and appears regularly at Bar Bayeux and Ornithology, all t",
    "pubDate": "2024-04-18T07:03:31.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6616fbe31ede9400165db366",
    "title": "Will Barnes: jazz impressions of the Welsh landscape",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/will-barnes-jazz-impressions-of-the-welsh-landscape",
    "description": "Today, the Spotlight shines On Will Barnes, leader of the Will Barnes Quartet, who joins me to talk about his life in music and, specifically, his ongoing collaboration with landscape artist Erin Hughes.Their first album together, Source of the Severn, is a 21st-century take on classic bebop-era sounds. Erin’s nine original works of art respond to Will and the Quartet’s music, using her own hand-marbled papers as a palette to create collages that evoke the Mid-Wales landscape in which the partic",
    "pubDate": "2024-04-11T07:03:33.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "660c705fdce7e5001601402c",
    "title": "Lucky Lo: Swedish pop music with a twist",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/lucky-lo-swedish-pop-music-with-a-twist",
    "description": "Today, the Spotlight shines On in a much different way than usual, as I am turning the microphone over to guest host Miriam Boulos.Miriam has been a guest contributor to Bonus Tracks, the official blog of Spotlight On, since August 2023. Miriam publishes with us frequently, and her work has included interviews with and essays about a diverse array of artists like James Walsh of Starsailor, Chappell Roan, Fuera, Ella More, Chagall, and most recently PEPTALK. As an international contributor, MIria",
    "pubDate": "2024-04-04T07:03:36.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "660062c22280af0016d323c9",
    "title": "Chalk: a relentless and genre-busting band from Belfast",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/chalk-a-relentless-and-genre-busting-band-from-belfast",
    "description": "Today, the Spotlight shines On the Belfast, Ireland, band Chalk.Chalk is Ross Cullen on vocals, Ben Goddard on guitar, and Luke Niblock on drums. They cook up a pretty stunning racket with a unique sound that is nonetheless recognizable in its post-punk, dance, and industrial lineages. If that makes sense to you, you will love Chalk. If it does not, give them a listen. Chances are you will dig what they do.This is the second of two episodes I recorded on-site, in my hotel room/recording studio, ",
    "pubDate": "2024-03-28T07:03:24.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65fb2eea1c46ed0017027bca",
    "title": "Sui Zhen: Sleepless at SXSW",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/sui-zhen-sleepless-at-sxsw",
    "description": "Today, the Spotlight shines On Chinese-Malaysian Australian artist, musician and creative producer, Sui Zhen.This is the first of two episodes I recorded on-site at the SXSW Conference and Festival in Austin, Texas.This year’s edition of South By Southwest has been the subject of controversy related to event’s work with the US Army and several weapons manufacturers as sponsors for various programming segments throughout, and the reactions — including withdrawals from and boycotts of the event — ",
    "pubDate": "2024-03-21T07:03:50.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65f1e8bdff17410016c61f58",
    "title": "Nic Dembling: recalling new wave New York with Comateens",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/nic-dembling-recalling-new-wave-ny-with-the-comateens",
    "description": "Today, the Spotlight shines On musician and songwriter Nicholas Dembling, aka Nic North, aka Nic West, of seminal New York CIty New Wave Pop band, Comateens.The New York that birthed Comateens was in the midst of a particularly vibrant musical moment. There was new music everywhere. Jazz cats were staging loft concerts in pre-glitz SOHO. The punks and no wavers were holding court on the Lower East Side. Philip Glass and the minimalists were premiering new works and way up in the Bronx, hip hop w",
    "pubDate": "2024-03-14T07:03:02.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65e8b83a7e765d001757e29d",
    "title": "Phil Haynes: a renowned jazz drummer chases the masters",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/phil-haynes-a-renowned-jazz-drummer-chases-the-masters",
    "description": "Today, the Spotlight shines On drummer, composer, and improviser Phil Haynes.Phil published a unique memoir last November, which includes not only his reflections on a life in and of music but also stands as an important document of nearly 40 years of music in New York City and beyond.Phil delivers plenty of inside observations of his work with figures like Lee Konitz, Anthony Braxton, Dave Liebman, and Paul Smoker, as well as his own poetry, musical analysis, philosophical musings, and lessons ",
    "pubDate": "2024-03-07T08:03:39.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65df8dfb5568ae00163ff4c4",
    "title": "Dave Wish (Music Will): The Kids Are Alright … With Music Education",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/dave-wish-music-will-the-kids-are-alright-with-music-educati",
    "description": "Today, the Spotlight shines On Dave Wish, founder and Chief Vision Officer for Music Will. This nonprofit organization funds and runs one of the largest instrumental and vocal music programs in US public schools.Dave, a former Palo Alto, California school teacher, launched Music Will due to frustration with the lack of music programming in his school. He started by borrowing instruments from friends and hitting area flea markets for deals. From there, he began offering free guitar lessons after ",
    "pubDate": "2024-02-29T08:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65d64c2ccb2a2600165458fb",
    "title": "Daniel Ögren: Nordic Psychedelia & Global Beats",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/daniel-ogren-nordic-psychedelia-global-beats",
    "description": "Today, the Spotlight shines On musician and producer Daniel Ögren.Daniel is one of the artists propelling Sweden’s contemporary new music scene. He has an extensive body of work as a solo artist and as a member of Sven Wunder, The Greys, and, most notably, Dina Ögon. He also works as a producer and musician for other artists.Daniel joined us upon the release of his album Fastingen-92 on the Mr Bongo label. The record “draws from Daniels's love of South American folk music, soul, Nordic folk musi",
    "pubDate": "2024-02-22T08:03:46.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65cd31dcfcbe4d0016b28b64",
    "title": "Mareike Wiening: 'Reveal' Offers Jazz Rhythms of Hope",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/mareike-wiening-reveal-offers-jazz-rhythms-of-hope",
    "description": "Today, the Spotlight shines On Mareike Wiening.Mareike is a drummer and composer who joined us on the occasion of the release of her third record as bandleader, Reveal, out on Greenleaf Music. Featuring her long-time group: tenor saxophonist Rich Perry, pianist Glenn Zaleski, guitarist Alex Goodman, and bassist Johannes Felscher, the band is joined on three tracks by trumpeter and Greenleaf founder Dave Douglas.After several years in New York City, Mareike is now based in Cologne, in her native ",
    "pubDate": "2024-02-15T08:03:09.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65c3dbb3f377ea00171ac70e",
    "title": "Jonathan Shank of Terrapin Station Ent.: from Mickey Hart to Peppa Pig",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/jonathan-shank-of-terrapin-station-ent-from-mickey-hart-to-p",
    "description": "Today, the Spotlight shines On music impresario Jonathan Shank, the CEO and Founder of Terrapin Station Entertainment.Jonathan is known for his instincts and successes in sniffing out unique opportunities in under-served spaces in the live entertainment industry, creating business successes in categories and markets often overlooked by the large corporations that dominate so much of the entertainment sector today.Jonathan has developed projects for names as disparate as the Bob Marley Estate, Mi",
    "pubDate": "2024-02-08T08:03:06.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65baa8115fcb67001755b43b",
    "title": "Brendan Grey (Super Duty Tough Work): hip-hop's liberation through hedonism",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/brendan-grey-super-duty-tough-work-hip-hops-liberation-throu",
    "description": "Today, the Spotlight shines On multi-instrumentalist, composer, educator, and performer Brendan Grey of the Canadian hip-hop group Super Duty Tough Work.In addition to his duties as MC, drummer, and band leader, Brendan has become a sought-after performance, session, and touring drummer.We spoke back in the autumn of 2023 for a conversation that still sticks with me. I look forward to hearing what you think.(all musical excerpts heard in the interview are taken from the album Paradigm Shift by S",
    "pubDate": "2024-02-01T08:03:24.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65b14629e969a60016afb104",
    "title": "Susan Alcorn: Nueva Canción on Pedal Steel",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/susan-alcorn-nueva-cancion-on-pedal-steel",
    "description": "Today, the Spotlight shines On the innovative pedal steel guitar player Susan Alcorn.While Susan got her start playing in country &amp; western bands in Texas, she has taken the pedal steel into new and uncharted territories, exploring 20th-century classical music, improvisational jazz, and various world musics.On her latest project, CANTO, Susan explored Chilean folk music and nueva canción, which translates as “new song” and refers to an intertwined musical and leftist social movement so impo",
    "pubDate": "2024-01-25T08:03:19.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65a82aa92841bb0017533e8c",
    "title": "Kris Davis: defining jazz's vanguard",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/kris-davis-defining-jazzs-vanguard",
    "description": "Today, the Spotlight shines On Grammy-winning pianist and composer Kris Davis.Kris joined us in the wake of the September 2023 release of her album Live at the Village Vanguard, out on her own Pyroclastic Records label.Live at the Village Vanguard is the second release from her band Diatom Ribbons, an adventurous quintet featuring drummer Terri Lyne Carrington, turntablist and electronic musician Val Jeanty, bassist Trevor Dunn – and new addition guitarist Julian Lage.In addition to talking abou",
    "pubDate": "2024-01-18T08:03:32.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "659eead99dfc4400156fd20e",
    "title": "Angelica Sanchez: jazz keys and nighttime creatures",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/angelica-sanchez-jazz-keys-and-nighttime-creatures",
    "description": "Today, the Spotlight shines On pianist and composer Angelica Sanchez, who joined us late last year to discuss her latest record, Nighttime Creatures, out on Pyroclastic Records.Since moving to New York from Arizona in 1994, Angelica has collaborated with artists including Wadada Leo Smith, Paul Motian, Richard Davis, Tim Berne, Ben Monder, and many others.On Nighttime Creatures, Angelica leads a nonet through material she composed while living in a secluded cabin in Upstate New York. There, she ",
    "pubDate": "2024-01-11T08:03:53.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6595a7e2b8861d00162d42cf",
    "title": "Adam Rudolph: conjuring music’s global essence",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/adam-rudolph-conjuring-musics-global-essence",
    "description": "Today, the Spotlight shines On composer, improviser, and master percussionist Adam Rudolph.A global performer - and global citizen - Adam has been called \"a pioneer in world music\" by the New York Times. With dozens of recordings to his credit, he joined us upon the release of Timeless from his percussion group, Hu: Vibrational, on his own Meta Records.Adam has worked with artists including Don Cherry, Jon Hassell, Sam Rivers, Pharaoh Sanders, and many others but had a particularly extensive col",
    "pubDate": "2024-01-04T08:03:40.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "658c5d80729d3d00166b242b",
    "title": "Ibrahim Maalouf: a conversation on harmony, heritage, and hope",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/ibrahim-maalouf-a-conversation-on-harmony-heritage-and-hope",
    "description": "Today, the Spotlight shines On trumpet virtuoso and international superstar Ibrahim Maalouf.Ibrahim is exactly the type of artist we love hosting - sensitive, open and unwilling to be limited by genre or expectations. His work mixes jazz, pop, classical, electronic, Middle Eastern, and African influences into a cosmopolitan sound all his own.Ibrahim and his family fled the civil war in Beirut when he was still a child, settling in France, where his musical education and accomplishments took flig",
    "pubDate": "2023-12-28T08:03:01.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "658346c299be20001598fddb",
    "title": "Roberto Di Gioia + Max Herre: Web Web’s experiments in electronic jazz",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/roberto-di-gioia-max-herre-web-webs-experiments-in-electroni",
    "description": "Today, the Spotlight shines On Roberto Di Gioia of the German Jazz supergroup Web Web and his group’s collaborator, the songwriter and producer Max Herre. WEB WEB’s fifth album is also their second with Max, appropriately titled, WEB MAX II, out now on Compost Records.This is an exciting, genre-bending album that includes appearances from Los Angeles-born percussionist and producer Carlos Gabriel Niño, hot on the heels of his own work on the new Andre 3000 album…This record is the complete pack",
    "pubDate": "2023-12-21T08:03:31.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "657a0fb8babc4c0017a1add2",
    "title": "James McKeown: Hawksmoor’s kosimiche hauntology",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/james-mckeown-hawksmoors-kosimiche-hauntology",
    "description": "Today, the Spotlight shines On James McKeown, the Bristol, UK-based artist who releases music under the name Hawksmoor.&nbsp;James first created Hawksmoor five years ago, inspired by the six 18th-century churches in London designed by architect Nicholas Hawksmoor. Described as ‘English Baroque’ in style, these buildings are large, foreboding, and even Gothic in nature. Imagine the music inspired by such things, and you have Hawksmoor. Each Hawksmoor album features unique themes and inspirations ",
    "pubDate": "2023-12-14T08:03:19.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6570c0c49c60b60011a89195",
    "title": "Diana Pasulka: a religious study of UFOs and nonhuman intelligences",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/diana-pasulka-a-religious-study-of-ufos-and-nonhuman-intelli",
    "description": "Today, the Spotlight shines On Diana Pasulka, religious studies professor and the author of two books I have really enjoyed in the last few years: 2019’s American Cosmic: UFOs, Religion, Technology and Encounters: Experiences with Non-Human Intelligences, released in November 2023.As Diana points out in her work and in our discussion, religious studies is not about the veracity of any particular religion or religious claim, instead, it is about the implications of belief on the believers and the",
    "pubDate": "2023-12-07T08:03:03.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65675f1482b9f700125973d9",
    "title": "Eric Hilton: from Thievery Corporation to Corazón Kintsugi",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/eric-hilton-from-thievery-corporation-to-corazon-kintsugi",
    "description": "Today, the Spotlight shines On downtempo electronic music godfather and Thievery Corporation co-founder Eric Hilton.Eric joined us a few weeks after the September release of Corazón Kintsugi, his album with longtime Thievery vocal collaborator Natalia Clavier.Eric produced, arranged, and played the majority of the instruments on the 9-track album, which fuses elements of dub, trip-hop, Bossa nova, vintage film music, and electronica with Natalia’s emotive Spanish and Portuguese vocals.&nbsp;We t",
    "pubDate": "2023-11-30T08:03:51.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "655e67462578260012a7a6e7",
    "title": "Javon Jackson gives Peter Bradley's art a swinging soundtrack",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/javon-jackson-gives-peter-bradleys-art-a-swinging-soundtrack",
    "description": "Today, the Spotlight shines On saxophonist and composer Javon Jackson.&nbsp;Javon sat with us in early October to talk about his film score for the art-world documentary With Peter Bradley, music which came out back in June 2023 on the saxophonist's Solid Jackson Records.Peter Bradley has had a 50-year career as an abstract artist, but one that saw him getting little acclaim until the last few years. In addition to his work as an artist, the daily practice of which is documented in the film, Bra",
    "pubDate": "2023-11-23T08:03:19.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65550ecaf0fa320012d6d96a",
    "title": "Tea Krulos explores hidden subcultures in American society",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/tea-krulos-explores-hidden-subcultures-in-american-society",
    "description": "Today, the Spotlight shines On freelance journalist and author Tea Krulos.Tea wrote two books that I enjoyed this year: Heroes in the Night: Inside the Real Life Superhero Movement from 2013 and 2020’s American Madness: The Story of the Phantom Patriot and How Conspiracy Theories Hijacked American Consciousness.&nbsp;Both of those works take the reader deep into parts of contemporary American society that are not often explored and if they are, it is usually done with ridicule or scorn. Tea take",
    "pubDate": "2023-11-16T08:03:28.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "654be049122faa00123c1cad",
    "title": "Benjamin Koppel plays jazz with a novelist's narrative",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/benjamin-koppel-plays-jazz-with-a-novelists-narrative",
    "description": "Today, the Spotlight shines On Danish saxophonist, composer, and best-selling author Benjamin Koppel.Benjamin joined us to discuss his July 2023 release Perspective, the latest work from KCB Collective, a trio that, in addition to Koppel, includes Scott Colley on bass and Brian Blade on drums. It looks great on paper and sounds even better.Benjamin is the grandson of Danish classical composer Herman D. Koppel, while his father, Anders Koppel, is a renowned Hammond organ player and a composer. As",
    "pubDate": "2023-11-09T08:03:40.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6542a17958f3b50012908c12",
    "title": "On Minimalism: Kerry O'Brien and William Robin in conversation",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/on-minimalism-kerry-obrien-and-william-robin-in-conversation",
    "description": "Today, the Spotlight shines On Kerry O’Brien and William Robin, co-authors of the book On Minimalism: Documenting a Musical Movement from University of California Press.Philip Glass, Steve Reich, Terry Riley and LaMonte Young are stereotypically described as the “Big Four” of minimalism in music. While On Minimalism does nothing to undermine or belittle their pioneering and important contributions to the form, the authors widen the aperture to show a broader scope to the music, from its beginnin",
    "pubDate": "2023-11-02T07:03:13.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "65394fa0ab9fa20012f1ff4c",
    "title": "Simon Berz creates art with drums, sound, and trash",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/simon-berz-creates-art-with-drums-sound-and-trash",
    "description": "Today, the Spotlight shines On drummer and sound artist Simon Berz.&nbsp;The impetus for our conversation was the release of Simon’s collaboration with American bassist and sonic wizard Bill Laswell and the Japanese avant garde trumpeter Toshinori Kondo. While Kondo passed away in October of 2020, this work, Breath versus Beats, was not released until August 2023.Simon is a prolific artist across multiple forms and media. His perspective on creativity, process, collaboration and sound resulted i",
    "pubDate": "2023-10-26T07:03:36.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6530237993a2360012df8514",
    "title": "Seth Godin and The Song of Significance",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/seth-godin-and-the-song-of-significance",
    "description": "Today, the Spotlight shines On author, entrepreneur, and teacher Seth Godin.&nbsp;I recently watched an interview with Seth wherein he was describing a discussion he had with someone asking him for career advice and he remarked, “I was not always Seth Godin”. For some of us, that is hard to believe. While his thinking and teachings have, of course, grown and expanded over the years, it seems like there has always been a Seth Godin and that he’s been Seth Godin that whole time.&nbsp;I grew up as ",
    "pubDate": "2023-10-19T07:03:49.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6526df41b774f700110a77c0",
    "title": "Dengue Fever’s Ting Mong might be our album of the year",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/dengue-fevers-ting-mong-might-be-our-album-of-the-year",
    "description": "Today, the Spotlight shines On Chhom Nimol and Ethan Holtzman, vocalist and keyboardist, respectively, of the band Dengue Fever.&nbsp;This episode is a little bit different. Dengue Fever was in the midst of a run of shows up the West Coast of the US in support of their new record Ting Mong, which is on my shortlist for Album of the Year. Their team suggested I meet the band in person instead of recording over Zoom, the way most of our recent episodes have come together. As a result, this talk to",
    "pubDate": "2023-10-12T07:03:52.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "651db5f2de8b6700112a793e",
    "title": "Gabriel Kennedy leads us into the Chapel Perilous",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/gabriel-kennedy-leads-us-into-the-chapel-perilous",
    "description": "Today, the Spotlight shines On Gabriel Kennedy, the author of the forthcoming biography Chapel Perilous: The Life and Thought Crimes of Robert Anton Wilson, which hits shelves in February 2024 from Strange Attractor/ MIT Press.&nbsp;The subject of that book, Robert Anton Wilson, wrote 35 books and over 1,500 published articles. His more well-known works include The Illuminatus! Trilogy, co-authored with Robert Shea, The Schrödinger’s Cat Trilogy, The Cosmic Trigger Trilogy, Prometheus Rising, Qu",
    "pubDate": "2023-10-05T07:03:06.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "651470f435c0e300118efe31",
    "title": "Aline Homzy plays violin in the cosmos with étoile magique",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/aline-homzy-plays-violin-in-the-cosmos-with-etoile-magique",
    "description": "Today, the Spotlight shines On award-winning violinist and composer Aline Homzy. Aline joins us on the occasion of the release of her first solo record, Éclipse, which is also the debut album with her group ‘Aline’s étoile magique’.&nbsp;Aline is known as one of Canada’s finest jazz violinists. Her music has been performed by the Toronto Symphony Orchestra, Swedish guitarist Mikko Hilden, and South Korean bassist Yongwon Cho. She is also interested in and committed to the cause of economic justi",
    "pubDate": "2023-09-28T07:03:07.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6509fbc4d8ccda00119d6920",
    "title": "Cat Henry of Live Music Society champions small venues",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/cat-henry-of-live-music-society-champions-small-venues",
    "description": "Today, the Spotlight shines On Cat Henry, the Brooklyn, NY-based Executive Director for Live Music Society, a philanthropic foundation whose mission is to recognize and protect small music venues and listening rooms across the U.S. so that live music remains accessible to all.&nbsp;Before LMS, Cat served as Vice President, Concerts &amp; Touring, for Jazz at Lincoln Center and is currently curator of jazz programs for Hudson Hall, in Hudson, New York; Cat is also talent buyer for Bethel Woods Ce",
    "pubDate": "2023-09-21T07:03:40.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6501fe4755456200112f31bc",
    "title": "Joe Mills (Aver) of Move 78 decodes jazz from the algorithms",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/joe-mills-aver-of-move-78-decodes-jazz-from-the-algorithms",
    "description": "Today, the Spotlight shines On Joe Mills, a musician and producer who performs under the name ‘Aver’ in the Berlin-based band Move 78.Move 78’s music sits at the intersection of improvised jazz and programmed hip-hop. Their music is crafted from hours of studio improvisations that have been chopped-up, rearranged, and layered with live instrumentation provided by the band members.In this chat, Aver explains their technique and process as well as how it extends to their live performances. It’s am",
    "pubDate": "2023-09-14T07:03:48.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64f8b9b1aa4e5a0011dc0565",
    "title": "Steven Milne of The Little Kicks writes songs from the heart",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/steven-milne-of-the-little-kicks-writes-songs-from-the-heart",
    "description": "Today, the Spotlight shines On Steven Milne, singer, songwriter, keyboardist and vocalist in the Aberdeen, Scotland-based band The Little Kicks.The Little Kicks make sophisticated pop music, with three of the members providing vocal harmonies, over songs with enticing guitar hooks, and featuring the seductive sound of analogue synthesizers.The band is still supporting their most recent record, People Need Love, which was released back in September 2022. Look for it or link to it through the show",
    "pubDate": "2023-09-07T07:03:06.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64ef8b267b9ac0001112eb3b",
    "title": "EMBER are a jazz trio with a collective mindset",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/ember-are-a-jazz-trio-with-a-collective-mindset",
    "description": "Today, the Spotlight shines On EMBER, a trio featuring saxophonist and trumpeter Caleb Wheeler Curtis, bassist Noah Garabedian and drummer Vincent Sperrazza. Their latest album, August in March, came out August 11, 2023 on Imani Records and is “a vivid representation of the musical, interpersonal and community-oriented ideas that the three forward-thinking musicians that make up EMBER…care deeply about.”Today’s conversation explores the heady thematic elements of EMBER’s music: humanism, communi",
    "pubDate": "2023-08-31T07:03:13.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64e63bab51c1f0001264ef53",
    "title": "Pete Josef has a modern take on classic soul",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/pete-josef-has-a-modern-take-on-classic-soul",
    "description": "Today, the Spotlight is On singer, songwriter, and multi-instrumentalist Pete Josef.The impetus for Pete’s visit was a series of tracks that he has been dropping throughout the Spring and Summer of 2023 - one of which, “Utopia”, you can listen to at the end of this episode. Before we got to his new music, we discussed Pete’s musical upbringing, his connection to classic soul “message music”, and much more.&nbsp;Pete is an artist deeply in tune with his times, which is reflected in the lyrical co",
    "pubDate": "2023-08-24T07:03:51.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64dd116c28e37400101d2b7c",
    "title": "Kirsten Agresta Copely creates New Age harp soundscapes",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/kirsten-agresta-copely-creates-new-age-harp-soundscapes",
    "description": "Today, the Spotlight is On international award-winning harpist and composer, Kirsten Agresta Copely.Kirsten, who is known for her charismatic, telegenic presence on stage, is also the go-to harpist for pop artists including Jay-Z, Beyoncé, Stevie Wonder, Enya, The Roots, Lady Gaga, and many others.&nbsp;Kirsten joins Spotlight On to talk about her recently released New Age album, Aquamarine, which is “Inspired by her deep connection with the ocean and imbued with memories of her late mother, thi",
    "pubDate": "2023-08-17T07:03:35.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64d3b0092b16290011a6bf74",
    "title": "mr. master and his never-ending rap project",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/mr-master-and-his-never-ending-rap-project",
    "description": "Today, the Spotlight is On Gabriel Jacob Luansing, who produces music under the name mr. master.&nbsp;For over six years, Gabriel has been working on an ever-expanding experimental hip-hop project called ‘ultra,’ which, as of this recording, currently spans 138 songs, clocking over six hours of music.&nbsp;‘ultra’ is a project meant to be dived deep into, and we do, discussing the intention and aims of the project, artistic identity and much more.We would like to encourage listeners to spend som",
    "pubDate": "2023-08-10T07:03:25.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64cab19d71653700116b72b5",
    "title": "Spotlight On Us — the podcast talks to itself",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/spotlight-on-us-the-podcast-talks-to-itself",
    "description": "Spotlight On producer and editor Michael Donaldson and host Lawrence Peryer communicate constantly throughout the research and production of each episode, but they rarely actually speak in person. So when Michael suggested they spend time catching up to discuss some topics of shared interest, the pair decided to press ‘record’ and share their discussion with listeners.&nbsp;The two had a freewheeling and sprawling talk which Michael worked his editing magic on in order to bring to you. Enjoy.&nb",
    "pubDate": "2023-08-03T07:03:21.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64c165730a9bc7001179e7a1",
    "title": "Brandon Seabrook’s magic clusterf**k of merciless banjo torture",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/brandon-seabrooks-magic-clusterk-of-merciless-banjo-torture",
    "description": "The Spotlight shines On guitarist and banjoist Brandon Seabrook, hot off the release of his new album brutalovechamp on Pyroclastic Records.Brandon is known for pushing his music past the far reaches of the extreme, fusing elements from punk, jazz, pop, and metal. His music has been called “abrasive” and “angular”, with an intense focus on virtuosity. brutalovechamp covers new ground.&nbsp;With his octet, Epic Proportions, Brandon explores beauty, personal emotion and a lyricism not usually asso",
    "pubDate": "2023-07-27T07:03:51.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64b82c576710c50011886975",
    "title": "Peter Kruder, Roberto Di Gioia, and the art of sonic synergy",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/peter-kruder-roberto-di-gioia-and-the-art-of-sonic-synergy",
    "description": "Today, the Spotlight shines On Peter Kruder and Roberto Di Gioia, who join us to talk about their new but long-gestating duo project, “--------”.&nbsp;&nbsp;Viennese artist, producer and DJ Peter Kruder is one of the legendary figures in electronic music, known for his pioneering work as a member of Kruder &amp; Dorfmeister.Kruder &amp; Dorfmeister, named after Peter and collaborator Richard Dorfmeister, is an Austrian duo who broke out creating trip hop and downtempo remixes of pop, hip-hop, an",
    "pubDate": "2023-07-20T07:03:22.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64aef638ee115a0011dea7c1",
    "title": "Dan Mackta — from punk rock to hi-res audio",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/dan-mackta-from-punk-rock-to-hi-res-audio",
    "description": "Today, the Spotlight shines On Dan Mackta, Managing Director of North America and Northern Europe for the high-resolution music service, Qobuz.&nbsp;We get pitched constantly by publicists to have their music business clients on as guests. Long-time listeners have noticed that we host fewer of those types of discussion than in the past but when we do, we aim to feature only the most interesting people, solutions and companies.&nbsp;Dan, his background, and his work at Qobuz check those boxes and",
    "pubDate": "2023-07-13T07:03:45.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64a5b0c84c9ff70011e8ec3c",
    "title": "Brian McCarthy blends jazz, astronomy, and the AfterLife",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/brian-mccarthy-blends-jazz-astronomy-and-the-afterlife",
    "description": "Today, the Spotlight shines On Vermont-based saxophonist, composer and arranger Brian McCarthy. Brian joins us on the occasion of his most recent project, AFTER|LIFE released back in late May, just a few days after we recorded this talk.&nbsp;AFTER|LIFE is the second album of Brian’s in the nonet format as well as the second to be brought to fruition through support from the Vermont Community Foundation and the Vermont Arts Council.&nbsp;Chris Pearson in The Times of London wrote, “Imagine John ",
    "pubDate": "2023-07-06T07:03:50.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "649b42a871939a00115a121b",
    "title": "David Rodriguez talks community, culture, and his work with NJPAC",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/david-rodriguez-talks-community-culture-and-his-work-with-nj",
    "description": "Today, the Spotlight shines On David Rodriguez, Executive Vice President and Executive Producer at NJPAC - the New Jersey Performing Arts Center.&nbsp;David works in his hometown of Newark, New Jersey, and has led a fascinating life in the performing arts. He was a full-time musician on the road with groups ranging from Isaac Hayes to Tito Puente to the Rochester Philharmonic. He studied at Juilliard, the Eastman School of Music, and Mansfield University. He worked at Carnegie Hall, Aaron Davis ",
    "pubDate": "2023-06-29T07:03:02.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64934165cf7be500110f7bd4",
    "title": "LILAMORS electronically redefine the jazz trio",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/lilamors-electronically-redefine-the-jazz-trio",
    "description": "Today, the Spotlight shines On the Basel-based band LILAMORS, which consists of vocalist Ana Čop, pianist Thilo Seevers, and sound artist Jaka Arh.With their debut album, When I Am Dead, My Dearest, out on June 30th, LILAMORS is taking&nbsp;jazz into new territories of experimental electro-acoustic music, utilizing poetry from the last two centuries as well as original lyrics written by Ana. Theirs is a new sonic identity of surrealist collage featuring stylistic and thematic contrasts throughou",
    "pubDate": "2023-06-22T07:03:04.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6480ec4f2b317a001190d2c9",
    "title": "MISS C-LINE makes soulful magic in the studio",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/miss-c-line-makes-soulful-magic-in-the-studio",
    "description": "Today, the Spotlight shines On MISS C-LINE, a neo-soul singer, producer, and multi-instrumentalist based in Switzerland.&nbsp;Her music blends soul and groove with elements of hip-hop and jazz, resulting in a unique and memorable sound. This conversation is memorable, too, and and it pairs well with the MISS C-LINE track we have for you at the end of this episode, her latest single, “Intimately”. Conversation and song, all taken together, will make a lot of sense.&nbsp;Enjoy.------------------Di",
    "pubDate": "2023-06-15T07:03:59.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6480e01ab4749600115191c9",
    "title": "Danny Fox loves good jazz and great pizza",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/danny-fox-loves-good-jazz-and-great-pizza",
    "description": "Today, the Spotlight shines On Brooklyn-based pianist and composer Danny Fox and the latest work from the Danny Fox Trio, Time Took Care of It.Danny’s trio, with bassist Chris van Voorst van Beest and drummer Max Goldman, has been a working group with a consistent lineup since their founding in 2008. Their distinctive sound is a testament not only to their time together but also to their interests in chamber music, bluegrass, and rhythm and blues, all of which they integrate to their special ble",
    "pubDate": "2023-06-08T07:03:47.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6477bbbbbcaad50011ef8489",
    "title": "Michael Scott Dawson’s ambient music draws on rural memories",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/michael-scott-dawson",
    "description": "Today, the Spotlight shines On Canadian producer and sound artist Michael Scott Dawson.Michael joined us to mark the release of his third solo album, Find Yourself Lost, a collection of country-adjacent, Western-themed ambient recordings issued by Toronto label We Are Busy Bodies. This album is ethereal without being space music and is steeped in melody, tape loops, and Michael’s own field recordings. He has made an emotional, never sterile, ambient work. You can visit this episode’s show notes ",
    "pubDate": "2023-06-01T07:03:32.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "646d2ab3fd072e0011df292e",
    "title": "Bruno Råberg pushes the boundaries of acoustic bass",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/bruno-raberg",
    "description": "In this episode, the Spotlight shines On internationally-renowned bass player and composer Bruno Råberg.Since coming to the US from his native Sweden in 1981, Bruno has made many recordings as both a leader and sideman — and has performed with an incredible number of world-class artists - including Terri Lyne Carrington, Sam Rivers, Donny McCaslin, Billy Hart, Matt Wilson, and countless others. He currently leads several incarnations of his own Bruno Råberg Trio and the Triloka Ensemble.&nbsp;Br",
    "pubDate": "2023-05-25T07:03:39.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "646502a932c63500114a1ce8",
    "title": "Marijus Aleksa",
    "link": "https://www.spotlightonpodcast.com/marijus-aleksa",
    "description": "Today, the Spotlight shines On Lithuanian drummer and producer Marijus Aleksa.Marijus has worked as a band leader, session musician and solo artist, and in each setting, his sound is his own, reflecting his interests in jazz, world and electronic club music.&nbsp;Marijus spent a decade in London, embedded in the dynamic new jazz scene there. Now back in Lithuania, he recently programmed a small local jazz festival in Vilnius, Tamsta Jazz Weekend. At the same time, he was rolling out his latest r",
    "pubDate": "2023-05-18T07:03:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "645a91ebfd49820011b7a713",
    "title": "EMAMKAY",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/emamkay",
    "description": "Today, the Spotlight shines On South African record producer, emcee, and keyboardist EMAMKAY.EMAMKAY visited us to talk about his new album, Love Is Energy, released back in March. As he explains in our talk, the music was crafted from jam sessions and band rehearsals that le later revisited and mined for inspiration. The resulting album is finely crafted but surprisingly organic.EMAMKAY’s music blends the best of jazz, R&amp;B, and hip-hop into a unique sound all his own. He’s a unique person, ",
    "pubDate": "2023-05-11T07:01:52.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64528cb856fd69001134feb8",
    "title": "Dominic Miller",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/dominic-miller",
    "description": "Today, the Spotlight shines On guitarist Dominic Miller, a musician unique in his ability to fit in and contribute as a sideman, but also to step up as a band leader.Dominic may be best known as guitarist — and in his own words, “Lieutenant” — for Sting, a position he has filled for over 30 years, but he has been creating his own diverse body of work for many decades as well.&nbsp;Dominic joined Spotlight On to talk about his latest release on ECM Records, Vagabond, an instrumental album rich in",
    "pubDate": "2023-05-04T07:01:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "644148a173010400118fe2d2",
    "title": "Lem Oppenheimer",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/lem-oppenheimer",
    "description": "Today, the Spotlight shines On Lem Oppenheimer, co-founder of Easy Star Records, an independent record label specializing in pushing and expanding the boundaries of reggae music.&nbsp;Founded in mid-90s New York City, Easy Star first focused on raising the bar for US reggae but soon expanded to uncovering and highlighting great artists from regional scenes around the world.&nbsp;Their in-house band, the Easy Star All-Stars, are a touring and recording outfit that has played on some of the label’",
    "pubDate": "2023-04-20T14:13:53.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6438085946c3330011b460c2",
    "title": "Monika Herzig",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/monika-herzig",
    "description": "Today, the Spotlight shines On Monika Herzig, whose career as a jazz pianist and composer spans three decades and dozens of releases. Monika joins us to talk about the release of a reimagined set of Joni Mitchell’s music, which she arranged and features vocals interpreted by her late friend, award-winning vocalist Janiece Jaffe.To quote from the liner notes: “This album is, first and foremost, about relationships: between Janiece and Monika; between the stretch of time that gave rise to Joni’s s",
    "pubDate": "2023-04-13T14:09:35.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6425986093caf0001271e214",
    "title": "Harold Sherrick",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/harold-sherrick-2",
    "description": "Today, the Spotlight shines On an episode from about a year ago, our conversation with photographer Harold Sherrick. Harold joined Spotlight On to talk about A Pig's Tale, a book he co-authored which tells the story of the legendary bootleg record label, Trade Mark of Quality, and the adventures of its founders in the late 1960s and early 1970s.&nbsp;Trade Mark of Quality was really the first bootleg record label of its kind, spawning many later imitators. From the end of the '60s to the mid '70",
    "pubDate": "2023-03-30T14:23:31.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "641c6123c494dd001113f755",
    "title": "Jane Ira Bloom & Mark Helias",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/jane-ira-bloom-mark-helias",
    "description": "Today, the Spotlight shines On New York-based jazz innovators Jane Ira Bloom and Mark Helias, who join us to discuss their latest collaboration with drummer Bobby Previte, 2.3.23.I’d like to read from Mark’s notes for the album, “2.3.23 was an outgrowth of the improvisational recording project that emerged between myself and Jane Ira Bloom beginning at an early stage of the pandemic in April/May of 2020. We struggled to come to terms with the technological limitations of playing remotely over th",
    "pubDate": "2023-03-23T14:24:35.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "641268f1c35e580011313e23",
    "title": "John Brodeur of Bird Streets",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/john-brodeur",
    "description": "Today, the Spotlight shines On John Brodeur, leader of the music project, Bird Streets.&nbsp;John conceived of Bird Streets as his return to a band format after a long career as a solo artist. The new band point of view proved to be artistically freeing, and John joins us today to talk about Lagoon, the second Bird Streets album.Among John’s collaborators on Lagoon are Pat Sansone of Wilco, Michael Lockwood, who has worked with Aimee Man and Fiona Apple, Ed Harcourt, John Davis of Superdrag, and",
    "pubDate": "2023-03-16T09:02:43.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64092dabbbc03500116c1049",
    "title": "Christopher Hale",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/christopher-hale",
    "description": "Today, the Spotlight shines On Australian jazz heavyweight Christopher Hale.&nbsp;Christopher has been called “one of the most unique and respected musicians in Australia” (Glam Adelaide) and an “unconventional virtuoso of the bass guitar” (The Age). His new release, Ritual Diamonds, came out on March 3 through Earshift Music. The work reimagines Korean ritual drumming and contemporary jazz, creating music that is mysterious, complex and beautiful. On it, Christopher is joined by collaborator an",
    "pubDate": "2023-03-09T10:00:08.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "63fffb2d03be0f0011a3100f",
    "title": "Phyphr",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/phyphr",
    "description": "Today, the Spotlight shines On rising electro soul artist, Nick Locke, who performs under the name Phyphr.&nbsp;A songwriter and producer, Phyphr combines his own live guitar playing with electronic elements to create a unique,&nbsp;vibrant twist on electronic funk, soul and blues.&nbsp;Phypht and host Lawrence Peryer had a great time connecting which hopefully comes across in this recording.&nbsp;About Phyphr and his musicHost Lawrence PeryerMore Spotlight On Hosted on Acast. See acast.com/priv",
    "pubDate": "2023-03-02T10:00:18.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "63f6bec61561a70011b67bfd",
    "title": "Jesse Colin Young",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/jesse-colin-young",
    "description": "Today’s episode is a live recording of a conversation Spotlight On host Lawrence Peryer had in Santa Barbara, at the FestForums conference, with American musical treasure, Jesse Colin Young.&nbsp;&nbsp;Jesse Colin Young has been a pioneer of American roots music for more than half a century and has left his unique mark on the intersecting worlds of folk, blues, jazz, country, and rock &amp; roll.&nbsp;As the frontman of the Youngbloods, he immortalized the ideals of the Woodstock generation with",
    "pubDate": "2023-02-23T10:00:49.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "63ee4fe12b83290011a5bec9",
    "title": "Conic Rose",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/conic-rose",
    "description": "Today, the spotlight shines on the German electronic jazz collective Conic Rose. Their new, self-released debut album Heller Tag (or, Bright Day, in English), is out tomorrow, February 17, worldwide.&nbsp;&nbsp;Members of the group who joined our talk included Trumpeter Konstantin Döben, keyboardist Johannes Arzberger, bassist Franziska Aller and guitarist Bertram Burkert. All come from diverse musical backgrounds, with their individual projects including work with artists like arena-filling Ge",
    "pubDate": "2023-02-16T15:46:41.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "63e5130ff51cd50011d9129c",
    "title": "Janishia Jones",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/janishia-jones",
    "description": "Today, the spotlight shines on Janishia Jones, CEO &amp; Founder of Fresh 'N Sassy Productions, a holding company whose mission is to empower and create an ecosystem of safe spaces for women of color in the music industry.Janishia had four main initiatives to tell us about: The Pub Royalty Queen Podcast, The Juke Joint Non-profit Foundation, her consultancy Encore Music Tech Solutions and Market Research Agency A Seat at the Table.&nbsp;Each of these projects contributes to Janishia’s mission in",
    "pubDate": "2023-02-09T15:36:47.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "63db15a2a986f600116113d6",
    "title": "The Latest in Music and Tech",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/adam-hasslert-soundation-max-goldberg-steven-segel-hotdrop",
    "description": "Today, the spotlight shines on two companies doing interesting work at the crossroads of music and technology.&nbsp;In our first segment, we talk to Adam Hasslert, CEO of online digital audio workstation and beatmaking platform Soundation. Every month, Soundation’s online music studio is used by over 100,000 creatives who produce music directly in their web browsers. Focusing on building the next-generation music software for upcoming music producers with professional ambitions, Soundation offer",
    "pubDate": "2023-02-02T10:00:03.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "63d27f660aa7fa0010d38a17",
    "title": "Bart Wirtz and Emiel van Rijthoven of WAAN",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/bart-wirtz-and-emiel-van-rijthoven-of-waan",
    "description": "Today, the spotlight shines on musicians Bart Wirtz and Emiel van Rijthoven who perform and record together under the name WAAN (Dutch for ‘Craze’).&nbsp;WAAN have a new record, Echo Echo, out on February 24 through the Sonar Kollektiv label. As of this recording three tracks have already appeared on streaming outlets and through the band’s bandcamp page. In fact, just hours before we spoke the final advance track, Omi, dropped.&nbsp;If you are a fan of Floating Points, BADBADNOTGOOD, Ezra Colle",
    "pubDate": "2023-01-26T13:25:58.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "63c89656eb0a7a00108c7128",
    "title": "Michael Kuelker on The Ozark Mountain Daredevils",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/michael-kuelker-on-the-ozark-mountain-daredevils",
    "description": "Today, the spotlight shines on author and educator Michael Kuelker, here to talk about his recent book, The Ozark Mountain Daredevils On Record: A Narrative Discography. Michael is a teacher, writer, and reggae radio DJ in St. Louis, Missouri.&nbsp;The Ozark Mountain Daredevils are an American rock group who first formed in 1972. Hailing from Springfield, Missouri, the band had two major hits, \"If You Wanna Get to Heaven\" from their debut album in 1974 and a certified smash,&nbsp;\"Jackie Blue\" f",
    "pubDate": "2023-01-19T10:00:03.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "63c01518ea425200116ba2c7",
    "title": "That Petrol Emotion",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/that-petrol-emotion",
    "description": "Today, the spotlight shines on the wildly influential post-punk group, That Petrol Emotion. Guitarist and songwriter Raymond Gorman and lead singer Steve Mack joined Spotlight On host Lawrence Peryer to mark the release of the band’s career-spanning box set, Every Beginning Has a Future: An Anthology 1984-1994.Spawned from the ashes of the Northern Irish pop-punk group, The Undertones, the Petrols synthesized all of the music, culture and politics around them to create something vibrant and new.",
    "pubDate": "2023-01-12T14:11:36.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "639133176c074700106b445a",
    "title": "Creativity and Innovation",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/creativity-and-innovation",
    "description": "Brigadoon is a global affairs news and information platform for founders + thought leaders with global ambition.&nbsp;Brigadoon curates the emerging issues and the independent thinkers shaping commerce + culture. Brigadoon sees this curation as global street smarts.&nbsp;The conversation covers the history of technology and innovation in creative fields - specifically music - and highlights the innovations of artists like Franz Liszt, Frank Sinatra and David Bowie.Born out of personal frustratio",
    "pubDate": "2022-12-08T10:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6387c9f2c61e240011e02bdf",
    "title": "Jeremy Rose",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/jeremy-rose",
    "description": "Saxophonist-composer Jeremy Rose leads a multi-dimensional career spanning a dozen releases of original music with collaborative and solo projects across the world, including The Earshift Orchestra, Jeremy Rose Quartet, and The Vampires. Rose is the founder and director of the Earshift Music record label and festival. Rose has performed at festivals, venues, and concert halls throughout Australia, Europe, and the UK, including recently touring Europe with guitarist Kurt Rosenwinkel and collabora",
    "pubDate": "2022-12-01T10:00:49.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6375b02880ce5000114e7e71",
    "title": "Markus Reuter",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/markus-reuter",
    "description": "Markus Reuter is a music producer, composer, performer, and creative educator with international credentials and a vast discography.&nbsp;Reuter's work as a recording artist, solo performer, and collaborator spans (and frequently fuses) electrophonic loop music, contemporary classical music, progressive and art rock, industrial music, world jazz, jazz fusion, pop songs, and pure improvisation. Over the course of a two-decade career, he has been a member of multiple bands, ensembles, and projects",
    "pubDate": "2022-11-17T10:49:55.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "636c25e205b0d90012184e7f",
    "title": "Duncan Chapman",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/duncan-chapman",
    "description": "Duncan Chapman is a composer/musician based in Lincolnshire, UK. Much of his work involves collaborations with a wide range of people creating performances, installations &amp; recordings.&nbsp;Recent projects include online live-streaming events, curating a concert for the Aural Diversity project, and performing morning music with Supriya Nagarajan at the Jaipur Literature Festival in India.&nbsp;Recent projects include work with BCMG, x-church Gainsborough, COMA Glasgow, online performances wi",
    "pubDate": "2022-11-10T10:00:04.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "636280f1082c8b00114bcc48",
    "title": "Grahame Lesh",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/grahame-lesh",
    "description": "Based in the musical hotbed of Marin County, California, Grahame Lesh is a guitar player and singer-songwriter for Midnight North, Phil Lesh &amp; Friends, &amp; the Terrapin Family Band. A mainstay in the scene centered around Terrapin Crossroads in San Rafael, Grahame has joined such luminaries as The Mother Hips, Chris Robinson, Twiddle, Amy Helm, The North Mississippi All Stars, Neal Casal, Jackie Greene, Eric Krasno, ALO, and many more in singing, playing, and interpreting the American song",
    "pubDate": "2022-11-03T09:00:05.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6358609527852c0011ea49a2",
    "title": "Nick Mason of Pink Floyd",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/nick-mason",
    "description": "Nicholas Berkeley Mason, CBE (born 27 January 1944) is an English drummer and founding member of the progressive rock band Pink Floyd. He is the only member to feature on every Pink Floyd album, and the only constant member since its formation in 1965. He co-wrote Pink Floyd compositions such as “Echoes”, “Time”, “Careful With That Axe, Eugene” and “One of These Days”. In 2018, he formed a new band, Nick Mason’s Saucerful of Secrets, to perform music from Pink Floyd’s early years.Nick Mason’s Sa",
    "pubDate": "2022-10-27T09:47:46.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "63503ca48942ad001215890c",
    "title": "John Barry on Levon Helm",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/john-barry-on-levon-helm",
    "description": "Writer John Barry joins us on the podcast to talk his new book, \"Levon Helm: Rock, Roll &amp; Ramble—The Inside Story of the Man, the Music and the Midnight Ramble.\"Ringo wrote the foreword, and Roger Waters, Graham Nash and Warren Haynes are among those interviewed. Larry Campbell, who served as Levon Helm Band Musical Director and produced or co-produced Levon's three Grammy-winning solo albums, which were inspired by the Rambles, had this to say about the book:\"John Barry was the perfect 'fly",
    "pubDate": "2022-10-20T08:00:54.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6346fa7be59de00012416f48",
    "title": "The Headhunters",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/the-headhunters",
    "description": "Back in the early 70s, drummer Mike Clark and bassist Paul Jackson were best friends living in East Oakland, playing flatbed gigs at Black Panther rallies, and generally raising hell. Cooking was not their forte, so the barbecue joint next door became a hangout. Mrs. Jones (of Everett and Jones) asked them to write a song to promote the spot, and they came up with the first version of&nbsp;‘God Made Me Funky.’ Bill Summers worked with Jackson at the local record store, and he jumped at an opport",
    "pubDate": "2022-10-13T09:26:21.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "633e2bb3de7d5d00122b1222",
    "title": "Don Slepian",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/don-slepian",
    "description": "Born into a scientific family, music technologist Don Slepian showed both musical and technical talent early in life. He was a tester on the early internet as a member of the Defense Advanced Research Projects Agency (DARPA), Synthesizer Soloist with the Honolulu Symphony and Musical Director of the Honolulu Theater For Youth. He has been presented by WNYC’s “New Sounds” in New York’s Lincoln Center and performed at the Pompidou Center in Paris. He currently lives in the Pocono Mountains of Penn",
    "pubDate": "2022-10-06T09:15:05.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6334d231fcfc1400125a60ad",
    "title": "Backstage Pass: HERMIXALOT In Conversation with LP",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/backstage-pass-hermixalot-in-conversation-with-lp",
    "description": "FEMME HOUSE fosters more equitable opportunity for women and gender-expansive individuals in the technical and behind-the-scenes areas of music. They are creating the future producers, mixers, engineers, DJs, artists, and executives of the industry by providing education and scholarships, cultivating community, propagating visual representation, and offering professional development opportunities.&nbsp;Learn more about how to get involved with their mission to change the music industry at https:",
    "pubDate": "2022-09-29T09:00:14.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "632c7dc0b58ea30011e0d559",
    "title": "David Carpenter",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/david-carpenter",
    "description": "David Carpenter has spent 22 years in media and entertainment. He is an experienced Off-Broadway and Broadway producer, Multiplatform content developer, and has worked extensively in sales and marketing. David is currently the Founder and CEO of Gamiotics, Inc, which is bringing audience engagement technology to the live entertainment market and powering the next generation of experiential entertainment. He is proud to be a partner and CEO of Session Zero LLC along with Sarah Davis Reynolds and ",
    "pubDate": "2022-09-22T15:22:51.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6320e5ecee656200134d74a4",
    "title": "Steven Hall",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/steven-hall",
    "description": "Steven Hall grew up in Scotland in the '60s, singing in church choirs and learning the bagpipes. \"I was shy, and wanted to be cool and meet boys and girls, so I taught myself the guitar and learned the songs of The Beatles, Joni Mitchell, and Donovan.\" Steven emigrated to the US at age 15. After high school, he moved to New York where he hung out with artists, dancers, and musicians. There he met Allen Ginsberg who invited him to attend Naropa Buddhist University in Colorado. At Naropa Steven st",
    "pubDate": "2022-09-15T06:00:38.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6317e9053c385a00110c3d00",
    "title": "DiViNCi",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/divinci",
    "description": "As a founding member &amp; producer of Orlando-based Hip Hop group, Solillaquists of Sound, DiViNCi first gained notoriety by using multiple drum machines in ways the world had never seen before. His frenetic finger drumming, sonic dynamism &amp; innovative use of music technology have led to stage &amp; studio collaborations with such artists as Ms. Lauryn Hill, Nas, Victor Wooten, MF DOOM, Doug Wimbish &amp; El-P (Run The Jewels).&nbsp;As a public speaker &amp; educator, DiViNCi shares his pas",
    "pubDate": "2022-09-08T09:00:41.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "630e7dd3b373f60012b29f04",
    "title": "Trends and Innovations in Music & Tech",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/trends-and-innovations-in-music-tech",
    "description": "We’re excited to feature 4 guests on this episode, where we’re sharing some of the latest trends and innovations in music &amp; tech. Our guests this week are:Jesse Kirshbaum - Dreamstage&nbsp;Jesse Kirshbaum is an American entrepreneur, talent agent, author, executive producer and dealmaker. The multi-hyphenate creative businessman has made his career focused on the epicenter of entertainment, technology, and brand marketing. He writes and curates Beats &amp; Bytes, one of the premiere weekly n",
    "pubDate": "2022-09-01T06:00:27.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6306433557694e00119451ef",
    "title": "Clem Snide",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/clem-snide",
    "description": "Named for a William S. Borroughs character, Clem Snide first emerged from Boston as a three-piece in the early 1990s, and the group would go on to become a cult and critical favorite, picking up high-profile fans from Bon Iver to Ben Folds over the course of three decades and more than a dozen studio albums. NPR highlighted the Israeli-born Barzelay as “the most underrated songwriter in the business today, with a sneakily firm grasp on poignancy and humor,” while Rolling Stone hailed his songwri",
    "pubDate": "2022-08-25T06:00:44.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "62fd41833e14f5001219d08c",
    "title": "Terry Grant",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/terry-grant",
    "description": "Terry Grant on More Ghost Than Man:\"Who is this guy?\" and \"Where does he come from?\"I grew up in and around Cleveland, Ohio. Fell in love with science fiction and film scores as a kid. Mom and Dad listened to Motown and the blues, and so did I. Decided to pick up a guitar at age 15 after realizing that I sucked at baseball. I moved to Nashville at 22, toured as a guitar player for a few years, and then somehow fell in with the club crowd - despite never having been a nightclub kind of guy (still",
    "pubDate": "2022-08-18T06:00:56.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "62f2cbdfc8c50f0013304149",
    "title": "Sonia Stevenson",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/sonia-stevenson",
    "description": "Sonia Stevenson is Head of Music Patron, a new start-up connecting composers and patrons.Sonia grew up in St Andrews, Scotland. She studied at St Mary’s Music School in Edinburgh and King’s College London, where she gained a Bachelors of Music and Masters of Music.&nbsp;Her work has spanned many different aspects of the music business. In 2012 she founded her own festival, St Andrews Voices, dedicated to vocal and choral music. She has also worked as a Composer Agent, Project Consultant at Macbe",
    "pubDate": "2022-08-11T09:00:02.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "62e9efd832b92d00127a05f8",
    "title": "Ryan Wines",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/ryan-wines",
    "description": "Ryan is the Founder and CEO of Marmoset — a full-service music agency based in Portland, Oregon, specializing in music licensing and original music production for brands, film, and TV. Ryan co-pilots Marmoset’s creative teams and spends most of his time studying people and human systems — constantly deconstructing the status quo, pushing boundaries, and searching for a better way to lead and nurture people.A fiery advocate of creators, makers and artists, Ryan gave a TED Talk about “leading crea",
    "pubDate": "2022-08-04T09:00:56.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "62e18657fce75f0012c6bd7d",
    "title": "Obie Fernandez",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/obie-fernandez",
    "description": "Obie Fernandez is a veteran technologist, published author, and serial entrepreneur. Remarkably, he’s also an accomplished music producer and DJ, and is currently pioneering the future of the music industry on the blockchain as CEO &amp; Founder of RCRDSHP. Previous accomplishments include his role as CTO of Andela, where he helped the largest VC-backed startup in Africa train 100 thousand young Africans to become world-class software developers.Interact with Obie here:&nbsp;https://twitter.com/",
    "pubDate": "2022-07-28T09:00:23.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "62d8222e9f30c40012a18ee2",
    "title": "Chris Duffy",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/chris-duffy",
    "description": "From an early age, a camera was in his hands and he had the influence of his father’s friends and peers; David Bailey and Terence Donovan with their numerous debates on photography around the kitchen table.&nbsp;It was inevitable that photography would have a huge influence on Chris’s life.&nbsp;He is perhaps the only person to have assisted all three photographers nicknamed by Norman Parkinson as ‘The Black Trinity’.At 17 Chris began work as a Trainee Processor in a photo lab but after a year s",
    "pubDate": "2022-07-21T09:00:05.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "62cee56f0964ca0012a181d3",
    "title": "Shahida Mausi",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/shahadi-mausi",
    "description": "This week we’re coming to you live from the National Independent Venues Association conference in Cleveland, sharing a keynote conversation between LP and Shahida Mausi, President/CEO of the Right Productions.&nbsp;Shahida Mausi has built a career in cultural and entertainment programming designed to serve the public. In 1996 she formed The Right Productions, Inc. (TRP). The company has managed and operated the 6,000-seat Chene Park Amphitheater, providing food and beverage service, security, pa",
    "pubDate": "2022-07-14T09:00:45.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "62c5ca27a908090012443a79",
    "title": "Steve Kimock",
    "link": "https://shows.acast.com/spot-lyte-on/episodes/steve-kimock",
    "description": "This episode is a conversation between LP and Steve Kimock, once touted by Jerry Garcia as his “favorite unknown guitar player.” Now Steve is known for his guitar playing in Zero, KVHB, Bob Weir’s Kingfish, Ratdog, in addition to post-Grateful Dead ensembles including The Other Ones, Phil Lesh &amp; Friends, and the Rhythm Devils featuring Mickey Hart and Bill Kreutzmann.&nbsp;&nbsp;&nbsp;Steve Kimock has proved himself a master of fluid improvisation for over four decades, in the process inspir",
    "pubDate": "2022-07-07T07:00:52.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "31676531-234d-4898-83a4-2b1a7405f406",
    "title": "Fiona Bloom",
    "link": "https://www.spotlightonpodcast.com/fiona-bloom/",
    "description": "Prior to running her own business, Fiona has overseen many careers, including her time at EMI Records, where she ran marketing campaigns for Digable Planets,&nbsp;Gang Starr, Shara Nelson, The Solsonics, Eternal, and others.She co-owned Sub Verse Music and 3-2-1 Records, where she signed and marketed Blackalicious, MF Doom, C-Rayz Walz, Skeme Team, and more.At the parent company Zero Hour Records, she spearheaded the publicity department and ran campaigns for The Notwist, Varnarline, Swervedrive",
    "pubDate": "2022-05-12T07:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "28bfdd35-030e-4f7c-8684-c129f43aa2bc",
    "title": "Frankie Tan and Kelvin Lee",
    "link": "https://www.spotlightonpodcast.com/frankie-tan-and-kelvin-lee/",
    "description": "Frankie Tan and Kelvin Lee join Spot Lyte On to talk about their company OraStream's end-to-end audio delivery platform that powers companies such as NAXOS, the Neil Young Archives, Primephonic and others. Curious about hi-resolution audio? We have the experts here with Frankie and Kelvin. The OraStream Service is an end-to-end audio delivery platform for a new generation of cloud music services. It works with full resolution audio recordings to deliver the highest (or any specified lower) quali",
    "pubDate": "2022-05-05T07:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "c77b7581-b115-465d-a2ce-2ac8c01dfe1e",
    "title": "Carrie Kania",
    "link": "https://www.spotlightonpodcast.com/carrie-kania/",
    "description": "Kania, who grew up in a small town outside of Milwaukee, says she was the black sheep of her family. A child of the 1980s punk/new wave scene, her influences were people like Andy Warhol, Julian Schnabel and Francesco Clemente. So it follows that her first aspiration was to be an artist. But a few semesters at the School of the Art Institute of Chicago convinced Kania she didn't have the talent to make it as a painter. Fortunately, she had a side job as a bookseller.“I can tell you, almost to th",
    "pubDate": "2022-04-28T12:49:48.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "25eb54f9-c230-4409-8030-21ce4c7f78bd",
    "title": "Constant Follower",
    "link": "https://www.spotlightonpodcast.com/constant-follower/",
    "description": "Self-described as \"soaring-ambient-dreampop- experimental-folk\", Constant Follower is the band formed around Scottish songwriter Stephen McAll. As a teenager, McAll survived an attack by a gang that left him with a catastrophic head injury, and every memory of his childhood gone.The next decade was spent in a cabin on Scotland’s Western coastline, where he eventually began composing again. The result is a childhood imagined against a backdrop that, like the sea, is as serene as it is wild; ever-",
    "pubDate": "2022-04-21T07:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "fe2d5023-9fe4-40ab-8868-e2001ed278f8",
    "title": "MANE",
    "link": "https://www.spotlightonpodcast.com/mane/",
    "description": "In a time when the entire world is more starved of human connectivity than maybe anytime in history, Australian artist MANE has penned perfect, booming, beautiful anthems that celebrates the people that mean the most to us and the love that those relationships represent.&nbsp;Her breakout hit ‘Chasing Butterflies’ clocked up over 2 million streams and MANE's debut EP ‘Coping Mechanisms’ released by Dew Process/UMG Australia features lush, baroque pop production, MANE’s soaring vocals and dark, f",
    "pubDate": "2022-04-14T07:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "7d5984ec-e3e0-4d61-8a8f-1e95d6bdd2a5",
    "title": "Harold Sherrick",
    "link": "https://www.spotlightonpodcast.com/harold-sherrick-1/",
    "description": "This book is essential for record collectors and dealers.&nbsp;In that hot summer of ’69 two longhaired music freaks created an underground LP record album of unreleased tracks by one of their music gods and put it out on the streets of Los Angeles. No one had ever been crazy enough to do such an audacious thing before. The god’s official record label was not amused but the music fans were thrilled. Were these guys pirates or heroes? It was so much fun the first time, they soon pressed up even m",
    "pubDate": "2022-04-07T07:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "0198b1cc-0c97-4fc9-80ea-2e808327903f",
    "title": "Cynthia Parsons",
    "link": "https://www.spotlightonpodcast.com/cynthia-parsons/",
    "description": "Cynthia Parsons is Director of Concierge Services at Lyte, ​the reservations technology platform reimagining ticketing for artists, venues and fans.For decades, Cynthia has dedicated her career in the music industry through building meaningful relationships with artists, fans, and industry professionals. At Lyte, she has the opportunity to continue her passion in helping to create memorable and accessible live experiences for fans through Lyte’s innovative technology platform. Lyte’s mission is ",
    "pubDate": "2022-03-31T07:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "a4e35a75-68f1-425b-8915-5d9955ac2f54",
    "title": "Vito Iaia",
    "link": "https://www.spotlightonpodcast.com/vito-iaia/",
    "description": "Vito Iaia joins us to discuss the genesis of the Immersive Van Gogh exhibition that his company Impact Museums co-produced. He shares the story of his immersive studio and how content gets licensed and exhibited.&nbsp; Hosted on Acast. See acast.com/privacy for more information.",
    "pubDate": "2022-03-24T07:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "184b2f76-33f0-4fc1-a5bb-c87c4e2f233c",
    "title": "Lauren A. Spalding",
    "link": "https://www.spotlightonpodcast.com/lauren-a-spalding/",
    "description": "Lauren A. Spalding graduated from high school on a Thursday afternoon and started working as a publicity intern at Capitol Records the next morning. That was over fifteen years ago, and she hasn’t&nbsp;worked a “real” job since. As an artist management consultant for her own shop, The Spalding Company, she's shepherded fruitful partnerships to help bring her clients' big ideas to life. As a managing&nbsp;member of Sofi Tukker’s artist oasis, Animal Talk Collective, she’s been a songwriter, party",
    "pubDate": "2022-03-17T07:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "4c181abf-bd9d-4ce8-85b0-ab4bd9b11481",
    "title": "Theresa Vibberts",
    "link": "https://www.spotlightonpodcast.com/theresa-vibberts/",
    "description": "Theresa Vibberts is the Executive Vice President of North America at CAMI Music, a performing arts agency that reps Lang Lang, Howard Shore, American Ballet Theatre, Alexandre Desplat and others.&nbsp;Vibberts leads the development of CAMI Music’s North American business strategy. In addition she directs CAMI Music’s domestic booking efforts and serves as an artist manager. She also served as the&nbsp;company’s national director of booking since 2016, booking tours and producing promotional asse",
    "pubDate": "2022-03-10T18:07:12.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "e79abb27-4fbb-4fc3-a832-04312a2ea43d",
    "title": "Lawrence Peryer",
    "link": "https://www.spotlightonpodcast.com/lawrence-peryer/#guest",
    "description": "Lawrence Peryer is an American producer, writer, filmmaker, and business person best known for his work with Keith Richards, for whom he has produced numerous projects, including an ongoing series of reissues from Richards’ solo catalog. In 2021, Peryer produced and oversaw Bowie 75, two temporary, experiential retail locations dedicated to the work and legacy of musician David Bowie. The shops were open to the public from October 25, 2021 and closed on January 23, 2022. His 2016 project, UNBOUN",
    "pubDate": "2022-03-03T08:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "1433c021-6f08-4fb3-b623-494bdacf7116",
    "title": "Marissa Licata",
    "link": "https://www.spotlightonpodcast.com/marissa-licata/",
    "description": "With over 15 years of classical violin training, and her Bachelor’s and Master’s degrees from the New England Conservatory of Music, Marissa proved her natural versatility on her very first audition for Ian Anderson of Jethro Tull – winning the lead violin position on his 2006 US tour. She would go on to join Jethro Tull for 5 more international tours.Marissa quickly became high in demand as both a featured soloist and recording artist. In the years from 2006 to present, Ms. Licata has collabora",
    "pubDate": "2022-02-24T16:34:07.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "df1196ed-d8bb-44b9-93ee-d0914295754b",
    "title": "Mike Butera",
    "link": "https://www.spotlightonpodcast.com/mike-butera/",
    "description": "After a lifetime of playing music and a Ph.D. in Sound Studies, Mike Butera founded Artiphon to reinvent the musical instrument as a smart, connected device. Mike is intent on building a future where everyday creativity is augmented by technology. He thinks everyone can play music with the right tool, regardless of their training or skill. Beyond Artiphon, Mike likes to think and write about the social structures, phenomenologies, and possible futures of creative technologies.&nbsp; Hosted on Ac",
    "pubDate": "2022-02-17T15:36:55.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "f8957095-e581-4fb0-b633-286df4fedd38",
    "title": "Jeff Slate",
    "link": "https://www.spotlightonpodcast.com/jeff-slate/",
    "description": "Jeff Slate is an ASCAP award winning singer-songwriter from New York City.&nbsp;He co-founded the 1980’s mod/punk band the Mindless Thinkers, and in the mid-90’s released The Townshend Tapes, on which The Who’s Pete Townshend acted as executive producer. He later opened for Sheryl Crow on her “Tuesday Night Music Club” tour before founding the band The Badge in 1997, who released three albums and countless singles, EPs and live “bootleg” sets, two “best of” compilations, and went on to become da",
    "pubDate": "2022-02-11T14:51:01.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "03bb061d-f51b-4cc6-b56c-03f620206707",
    "title": "Jordy Freed",
    "link": "https://www.spotlightonpodcast.com/jordy-freed/",
    "description": "Jordy describes himself as a Marketing Generalist with 13+ Years of Integrated Marketing Experience (Brand, Product, Digital, Content, Influencer, Experiential, Paid, Comms) driving high-impact global programs for Sony Corporation, Intel Corporation, Pernod Ricard, the E.U. Government &amp; more. Both in-house + agency. He's got Deep experience in Emerging Technology (VR, Immersive Audio) &amp; Entertainment/Music verticals. Hosted on Acast. See acast.com/privacy for more information.",
    "pubDate": "2022-01-27T08:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "b50a1b1f-60a9-4a18-845a-ecfafeef76f2",
    "title": "Scott Register",
    "link": "https://www.spotlightonpodcast.com/scott-register/",
    "description": "Scott Register is head of A&amp;R at ThinkIndie, a distribution company that was founded by the Coalition of Independent Music Stores in 1999. They are also a proud partner of Record Store Day (and have been from the very beginning). Their mission is the same one today as it was the day they started the company: to bring great special releases to independent music stores all over. They are working all day, every day to do our part to accomplish this mission as well as continue to connect great a",
    "pubDate": "2022-01-20T16:22:48.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "fdcd2d09-0468-4d9f-872f-92c625c7522f",
    "title": "Angus Hayes",
    "link": "https://www.spotlightonpodcast.com/angus-hayes/",
    "description": "Founded and based in Sydney, Harvest Media sprang from a team of serial tech entrepreneurs Angus Hayes, Roland Hélène, and Hamish Diver. Hayes created Mule Music, Australia’s first B2C download service to sign distribution agreements with major labels in Australia. Hélène and Diver were the technologists who delivered the framework. The platform drew in many new opportunities, but was challenged by the arrival of cashed up music juggernaut iTunes. The trio used their first mover advantage and de",
    "pubDate": "2022-01-13T08:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "513c6886-0418-4f50-b65a-844c9a1788e7",
    "title": "Jon Weisberger",
    "link": "https://www.spotlightonpodcast.com/jon-weisberger/",
    "description": "Immersed in the bluegrass scene since the early 1980s, Jon Weisberger has enjoyed success in multiple aspects of the music business and community.&nbsp;As a music journalist, his work earned him two International Bluegrass Music Association awards, as well as the Charlie Lamb Award for Excellence in Country Music Journalism, while his resume as a bluegrass broadcaster includes more than a dozen years as producer and co-host of the popular SiriusXM Bluegrass Junction show, “Hand-Picked With Del M",
    "pubDate": "2022-01-06T08:00:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "b3bff3c5-cd1c-4f97-91ae-18f8e928d82f",
    "title": "Jeeyoon Kim",
    "link": "https://www.spotlightonpodcast.com/jeeyoon-kim/",
    "description": "Award-winning classical pianist Jeeyoon Kim has delighted audiences across the U.S. and around the world with her sparkling combination of sensitive artistry, broad emotional range, impeccable technique, and uniquely engaging and innovative concert experiences. She's performed everywhere from Carnegie Hall to her fans' living rooms during a live-streamed series that Jeeyoon launched during the pandemic. She recently launched a fast-growing new podcast dedicated to helping people of all musical t",
    "pubDate": "2021-09-30T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "c3d741aa-1722-4bf9-9c55-2b3e94a5c42c",
    "title": "Dre Wallace",
    "link": "https://www.spotlightonpodcast.com/dre-wallace/",
    "description": "Opnr is a cloud-based application that connects musicians with concert organizers offering opener performance opportunities. Its easy-to-use, organized system professionally harnesses all the relevant social media data and music distribution channels with the sole purpose to book opening performance opportunities for artists and help concert promoters and venues sell tickets.Dre started Fourtifeye and sold it to opnr in June 2021.&nbsp; Hosted on Acast. See acast.com/privacy for more information",
    "pubDate": "2021-09-23T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "9dc82f5c-88c6-4623-8234-9f8446341727",
    "title": "Tyler Grant",
    "link": "https://www.spotlightonpodcast.com/tyler-grant/",
    "description": "Tyler has appeared at most major US festivals and performed thousands of concerts and guitar workshops worldwide. He was an original member of the Emmitt-Nershi Band and a sideman for Abigail Washburn, April Verch and Adrienne Young. He has produced five solo albums and six releases by Grant Farm for his own Grant Central Records. The latest 2019 release, Kanawha County Flatpicking, with West Virginia music legend Robin Kessinger, made #15 on the National Folk DJ charts. Grant Farm released thei",
    "pubDate": "2021-09-16T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "4ec28950-bfaf-4fd5-a73d-4cf9c2a1e1ec",
    "title": "Gabrielle Basha",
    "link": "https://www.spotlightonpodcast.com/gabrielle-basha/",
    "description": "Gabrielle Basha is a writer and educator based in Cambridge, Massachusetts. In addition to her lifelong study of American folklore and pop culture, she holds a BFA in art history and illustration and an MFA in writing for young people from Lesley University. She's currently working on behalf of the Joseph Campbell Foundation, a 501.c3 devoted to preserving the work of Joseph Campbell.&nbsp;Joseph Campbell was an American professor of literature at Sarah Lawrence College who worked in comparative",
    "pubDate": "2021-09-09T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "4fd7a684-2408-4b79-93a3-b0223de6e53f",
    "title": "Scotty Stoughton",
    "link": "https://www.spotlightonpodcast.com/scotty-stoughton/",
    "description": "At the heart of all his endeavors, Bonfire Entertainment Founder Scotty Stoughton is a connector. He lives and breathes music and the world that holds its sound waves. Onstage as frontman with Bonfire Dub or behind the scenes producing his many festivals and events, including WinterWonderGrass and Campout for the Cause, Stoughton values music as more than a platform where rhythm meets beat. For him, it’s an expression that sets the stage for a life worth living, a vision worth having, and a drea",
    "pubDate": "2021-09-02T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "5479abe9-0caa-4bea-a26f-f906e7c0393d",
    "title": "Charlie Watts",
    "link": "https://www.spotlightonpodcast.com/charlie-watts/",
    "description": "Charlie Watts: June 2, 1941 - August 24, 2021 Hosted on Acast. See acast.com/privacy for more information.",
    "pubDate": "2021-08-26T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "01f67fb8-b0d2-4de5-a72e-afe1ae6b982e",
    "title": "John Raso",
    "link": "https://www.spotlightonpodcast.com/john-raso/",
    "description": "John Raso is the Senior Vice President, Client Services for HFA &amp; Rumblefish and oversees the teams who provide support to thousands of music publishers and licensing administration clients. John directs the implementation of Rumblefish administration digital music services including streaming, video, lyrics, guitar tablature and other digital music uses. John is also the host of This Music Hour on Radio Free Brooklyn. He also hosts a great showcase at SXSW each year.&nbsp; Hosted on Acast. ",
    "pubDate": "2021-08-19T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "7f1f295c-a3a3-45ba-804a-8ab0829d35d7",
    "title": "Jim Rondinelli and JJ Johnston",
    "link": "https://www.spotlightonpodcast.com/jim-rondinelli-and-jj-johnston/",
    "description": "Immersion Networks is a company that creates software and hardware to improve the human listening experience. Founded in 2014 by industry-leading audio experts and engineers, the privately held company operates out of a purpose-built facility in Redmond, Washington.The company’s founders are responsible for hundreds of patents that have been instrumental in the evolution of audio technology. If you listen to music on a modern device, you are using technology created by one of our founders.Their ",
    "pubDate": "2021-08-12T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "3f32a737-52f5-443f-ac7a-90c8230f2b6b",
    "title": "James Felice",
    "link": "https://www.spotlightonpodcast.com/james-felice/",
    "description": "The Felice Brothers, Ian (guitar and lead vocals) and James (multi-instrumentalist and vocals), hail from the Catskills, NY, where their early songs echoed off subway walls and kept company with travelers and vagrants. Their current lineup, with the addition of bassist and inaugural female Felice member Jesske Hume (Conor Oberst, Jade Bird) and drummer Will Lawrence (also a singer/songwriter) as their rhythm section, promises to be the best yet. Nathaniel Walcott (trumpet) and Mike Mogis (pedal ",
    "pubDate": "2021-08-05T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "37151d4d-1020-4b95-b9bf-191d31c9a6b2",
    "title": "Sally Lidinsky",
    "link": "https://www.spotlightonpodcast.com/sally-lidinsky/",
    "description": "Sally’s passion for operational excellence, process, and problem solving has led her to a successful career in event operations; producing music festivals, MMA fights, B-to-B and B-to-C expos, triathlons, hot air balloon festivals and more. She cut her teeth in the event industry as an intern at the NJ Balloon Festival and hasn’t looked back since.Most recently, Sally was VP of Event Operations &amp; Ticket Sales for the Professional Fighters League, where she was responsible for all logistics s",
    "pubDate": "2021-07-29T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "dc030b86-9417-47f1-aa4d-c6d8148a51cd",
    "title": "Ola Sars",
    "link": "https://www.spotlightonpodcast.com/ola-sars/",
    "description": "Ola Sars is a Stockholm-based serial entrepreneur active in the music-tech space.He is the Founder, CEO &amp; Chairman of Soundtrack Your Brand, the world's fastest-growing music platform for B2B.Before Soundtrack, he co-founded Spotify Businesses together with Spotify, a stand-alone effort to expand Spotify’s reach into B2B streaming. 2018 he pivoted Spotify Business into Soundtrack as a fully independent brand and business.Previous to co-founding Spotify Business, he was the co-founder and COO",
    "pubDate": "2021-07-22T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "bc0ca59b-0fa1-40f6-9b3c-bd0390b0f1b8",
    "title": "Dave McMurray",
    "link": "https://www.spotlightonpodcast.com/dave-mcmurray/",
    "description": "Dave McMurray&nbsp;has taken a long, strange trip to arrive at his sophomore release for Blue Note Records. On Grateful Deadication, the saxophonist takes his gritty, soulful Detroit sound and reimagines the flower empowered songs of San Francisco icons the Grateful Dead with an album as vibrant as it is unexpected.For this spirited excursion into the Dead’s vast repertoire, McMurray reconvened the rhythm section that graced his 2018 Blue Note debut, Music Is Life. This time out, bassist Ibrahim",
    "pubDate": "2021-07-15T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "c99a62fc-7fc7-4c05-8f1d-e8df20eec182",
    "title": "Dr. Richard Brent Turner",
    "link": "https://www.spotlightonpodcast.com/dr-richard-brent-turner/",
    "description": "Dr. Turner joined the University of Iowa faculty in 2001 and holds appointments in Department of Religious Studies, African American Studies Program, and International Programs.His research program focuses on twentieth-century and contemporary African-American religious history and African diaspora religions in the Black Atlantic world. He is especially interested in the following areas: Islam in the United States; religion and music in New Orleans, before and after Hurricane Katrina; Vodou in t",
    "pubDate": "2021-07-08T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "26194c1d-8bfc-45d8-929a-2be6e4014b8c",
    "title": "Eli Ball and David Boxenbaum",
    "link": "https://www.spotlightonpodcast.com/eli-ball-and-david-boxenbaum/",
    "description": "Lyric Financial helps artists make their dreams and goals real, via royalty advances&nbsp;and smaller-scale financing through its automated vATM product, currently offered to Tunecore artists. It works with all the leading music companies, performance societies (ASCAP, BMI, SESAC, Sound Exchange), publishers, labels, and distributors. The company looks at 14 months of an artist’s data and projects future royalty earnings, making a reasonable plan for repayment. Artists retain all rights, while L",
    "pubDate": "2021-07-01T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "592ff589-057a-4fab-afa8-7238d4cd83ec",
    "title": "Incub8next",
    "link": "https://www.spotlightonpodcast.com/incub8next/",
    "description": "Incub8next, a collaborative incubator project, has launched to help people and projects from underserved communities reach their full potential. Recognizing the need for tech development projects for people who have not had access to the resources, capital, connections, and experience needed to launch companies, Incub8next will work to insure that innovation knows no bounds for those in need of help getting off the ground.The Incub8next team comes from many different perspectives, with key leade",
    "pubDate": "2021-06-24T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "8e0a3b50-eafc-434a-a0d6-c86bc057ba50",
    "title": "Nettie Baker",
    "link": "https://www.spotlightonpodcast.com/nettie-baker/",
    "description": "Even by the often outlandish extremes of the rock world, Nettie Baker has lived a life less ordinary. Ginger’s eldest daughter grew up in the modest maisonette in which Cream were formed and where, as a child, she sat on Jimi Hendrix‘s lap, then she was fast-tracked to a world of limousines and luxury and back again just as fast.Many of those tales are now shared in Tales Of A Rock Star’s Daughter, newly available from Wymer Publishing,and via Amazon, as the first of her two-part memoir. The boo",
    "pubDate": "2021-06-17T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6b06eaeb-7484-414d-a5c4-089baa2b39dc",
    "title": "Jeremy Sirota",
    "link": "https://www.spotlightonpodcast.com/jeremy-sirota/",
    "description": "Jeremy Sirota is the CEO of Merlin, the largest and most important organization on behalf of independent labels, distributors, and other rightsholders. In his current role, Jeremy sits at the juncture of music and technology. Under his direction, Merlin has expanded its international reach, strategically increased its membership, and added key digital services to the Merlin offering (e.g., Apple, JOOX, Snap, Triller, YouTube Shorts).Jeremy has been three times recognized by Billboard as an Inter",
    "pubDate": "2021-06-10T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "8ac694e3-c772-4f3e-8160-291c73e02c2a",
    "title": "Ida Mae",
    "link": "https://www.spotlightonpodcast.com/ida-mae/",
    "description": "Ida Mae moved to the USA with nothing but Chris' National Steel guitar, a tin tambourine, a broken major record deal and their debut record under our arms.It was at huge personal risk they made this decision. After years of sleepless nights on the road, saying yes to every show offer we had, driving ourselves 15 hours to the next show after 6.5 weeks on the road, sleeping in dilapidated Motel's, playing in Casino bars, falling asleep in hotel lobby's, losing guitars across Europe, writing songs ",
    "pubDate": "2021-06-03T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "4ad4841d-6df9-4a91-b21b-b1870e4b66b5",
    "title": "Kieron Maughan",
    "link": "https://www.spotlightonpodcast.com/kieron-maughan/",
    "description": "Kieron Maughan started Rockstars Cars over 10 years ago out of his love of rock n' roll and cars.&nbsp;He's currently working on a tv show but in the meantime you can see many of the interviews on the site and on Youtube.&nbsp;So far his team has amassed:&nbsp;30,000 photos, both Private and public telling the stories of the cars that rockers purchased and drove.&nbsp;The Rockstarscars Database of known cars is currently over 1500, and growing dailyThere is a considerable Video archive, both B&a",
    "pubDate": "2021-05-11T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "92bdd5f8-a380-4a9b-8a70-c9f339694372",
    "title": "Nick Polizzi",
    "link": "https://www.spotlightonpodcast.com/nick-polizzi/",
    "description": "Nick has spent his career directing and producing feature-length documentaries about holistic alternatives to conventional medicine. Most recently, Nick directed The Tapping Solution and co-edited Simply Raw - Raw for 30 Days. His current role as producer of The Sacred Science—a documentary about explorations in the Amazon to learn about traditional, healing practices—stems from a calling to honor, preserve, and protect the ancient knowledge and rituals of the indigenous peoples of the world.Lea",
    "pubDate": "2021-05-04T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "a5fe94c5-7806-4b66-b623-eaeeb891cbcb",
    "title": "Jason Davis",
    "link": "https://www.spotlightonpodcast.com/jason-davis/",
    "description": "Jason Davis grew up in Northwest NJ, wrote songs and landed a career as an artist manager through his hustle and drive. Working throughout the years with such iconic acts as Boyz ll Men, The Go-Go’s, Alabama, Lonestar and Dolly Parton, among many others. He is co-founder and partner of label, management and publishing conglomerate Radar Label Group, as well as One One 7 Entertainment (Fahrenheit Media Group, One One 7 TV), Awaken Records, Care For Kids, and&nbsp;works with Noble Management.Jason",
    "pubDate": "2021-04-27T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "f5c2901f-2ded-4491-bec1-9d8b8e7555a6",
    "title": "DEVO",
    "link": "https://www.spotlightonpodcast.com/devo/",
    "description": "We need YOU to go vote for DEVO. Go to I Rocked the Fan Vote today and vote for DEVO to make it into the Rock and Roll Hall of Fame. Vote today and tell all your friends.&nbsp;Gerald Casale's music career spans more than 40 years. He came to prominence in the late 1970s as co-founder and bass player of the new wave band Devo, which released a Top 20 hit in 1980 with the single \"Whip It\". Casale is the main lyricist and one of the main composers of Devo's music and directed most of Devo's music v",
    "pubDate": "2021-04-22T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "13ffbf91-0b96-4462-af31-2a23bd988ac9",
    "title": "David Page",
    "link": "https://www.spotlightonpodcast.com/david-page/",
    "description": "Two-time Emmy winner&nbsp;David Page&nbsp;changed the world of food television by creating, developing, and executive-producing the groundbreaking show&nbsp;Diners, Drive-Ins and Dives. Before that, as a network news producer based in London, Frankfurt, and Budapest, he travelled Europe, Africa, and the Middle East doing two things―covering some of the biggest stories in the world, and developing a passion for some of the world’s most incredible food.Page walked through Checkpoint Charlie into E",
    "pubDate": "2021-04-20T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "8e5e71b6-fe8a-4115-958a-2ee41826f304",
    "title": "Jack Casady",
    "link": "https://www.spotlyteonpodcast.com/",
    "description": "John William \"Jack\" Casady (born April 13, 1944) is an American bass guitarist, best known as a member of Jefferson Airplane and Hot Tuna. Jefferson Airplane became the first successful exponent of the San Francisco Sound. Their singles, including \"Somebody to Love\" and \"White Rabbit\", had a more polished style than their other material, and successfully charted in 1967 and 1968. Casady, along with the other members of Jefferson Airplane, was inducted into the Rock and Roll Hall of Fame in 1996.",
    "pubDate": "2021-04-13T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "64fea09f-8450-467f-8ce4-6f9ef9ba7fb6",
    "title": "Hilary Gleason",
    "link": "https://www.spotlightonpodcast.com/hilary-gleason/",
    "description": "Backline is a national 501(c)(3) nonprofit organization that connects music industry professionals and their families with mental health and wellness resources— streamlining access to a network of trusted organizations and care providers that understand this line of work.Backline is hosting their first-ever livestream fundraiser to support mental health in the music industry. Set Break will serve as a celebration and showcase of the work they’ve been able to accomplish since launching in 2019, w",
    "pubDate": "2021-04-06T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "8d3f8763-918f-4f30-9893-8b16a63742e7",
    "title": "Faisel Durrani",
    "link": "https://www.spotlightonpodcast.com/faisel-durrani/",
    "description": "Durrani is an accomplished entertainment executive, entrepreneur, and artist manager with more than 25 years of success in the entertainment industry. Leveraging extensive and diverse industry experience, Faisel has been able to help artists and companies grow by developing and executing world-class strategies.Throughout his executive career, Faisel has held leadership positions at Island Records, Palm Pictures, Live Nation, Parkwood Entertainment, Def Jam Recordings and Universal Music Group. H",
    "pubDate": "2021-03-30T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "28853101-571d-4312-81b8-6b9f5c73ce92",
    "title": "Rudy Sarzo",
    "link": "https://www.spotlightonpodcast.com/rudy-sarzo/",
    "description": "Rudy Sarzo is a professional recording and performing artist worldwide with a career spanning over 35 years.As a member of Ozzy Osbourne’s band, from March 1981 to September 1982,&nbsp;Rudy toured the world in support of the “Blizzard of Ozz” and “Diary Of a Madman” records. His bass playing can be heard on Ozzy’s multimillion selling CD “Tribute” and “Speak of the Devil” CD and DVD.As a member of Quiet Riot&nbsp;from&nbsp;1982 to&nbsp;1985, Rudy recorded the multi-platinum albums “Metal Health,",
    "pubDate": "2021-03-23T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "044fbabc-c151-4a56-933a-55f2f781145c",
    "title": "Jonathan Stone",
    "link": "https://www.spotlightonpodcast.com/jonathan-stone/",
    "description": "Jonathan is a highly regarded music-publishing executive, and the chief creative curator of all the songs you hear on Rocket Songs – he’s got the “ears”.Jonathan began his career at ATV Music, becoming the Manager of Creative Services for the Nashville office, before moving on to become Director of Creative Services for MCA Music, working with such famed songwriters as Glen Ballard, Robbie Nevil, Mark Mueller, and Brock Walsh.Jonathan's success at MCA caught the eye of the legendary Quincy Jones",
    "pubDate": "2021-03-16T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "1bae6a88-b208-4c06-9d01-c26dbaf71def",
    "title": "Florian Richling",
    "link": "https://www.spotlightonpodcast.com/florian-richling/",
    "description": "ForTunes is an Austrian based company that collects performance-insights of songs, social media posts and profiles. This includes data from Spotify, Apple Music, SoundCloud, YouTube, Instagram, Facebook, Twitter, and SubmitHub blogs.&nbsp;They have features such as: an intelligent newsfeed, playlist notifications on Spotify and Apple Music, a playlist recommendation engine, social media growth and engagement data, and YouTube comments. ForTunes is available in for Apple iOS and on Android.&nbsp;",
    "pubDate": "2021-03-09T17:50:24.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "eeb89f78-fe3c-401a-88de-4a6eb7e97adb",
    "title": "Mr. Soul",
    "link": "https://www.spotlightonpodcast.com/mr-soul/",
    "description": "From 1968 to 1973, the public television variety show SOUL!, guided by the enigmatic producer and host Ellis Haizlip, offered an unfiltered, uncompromising celebration of Black literature, poetry, music, and politics—voices that had few other options for national exposure, and, as a result, found the program an improbable place to call home.The series was among the first to provide expanded images of African Americans on television, shifting the gaze from inner-city poverty and violence to the v",
    "pubDate": "2021-03-02T08:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "ed27a15f-4ad2-4d3e-8f9a-ae46b8f96898",
    "title": "Barrett Martin",
    "link": "https://www.spotlightonpodcast.com/barrett-martin/",
    "description": "Latin Grammy-winning producer, composer, percussionist, and writer, Barrett Martin, has been playing music professionally for over 30 years, including work on over 100 albums worldwide. His work can be heard on albums by REM, Queens Of The Stone Age, Mad Season, Screaming Trees, Tuatara, Blues&nbsp;legend CeDell Davis, and&nbsp;recording sessions that range from the Peruvian Amazon, to Brazil, Cuba, the Palestinian West Bank, the Mississippi Delta, and the Alaskan Arctic. Barrett&nbsp;also holds",
    "pubDate": "2021-02-23T08:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "56c64495-8b3b-41ad-aa65-ab2f5593283a",
    "title": "Dr. Lisette Garcia",
    "link": "https://www.spotlightonpodcast.com/dr-lisette-garcia/",
    "description": "As a Latin percussionist with a PhD and the General Manager of Sunyata Records &amp; Books, Dr. Lisette Garcia has carved out a wide path in her formidable artistic and academic career. Dr. Garcia recently recorded percussion on the 3 most recent albums from the Barrett Martin Group: “Transcendence” (2017), “Indwell: Music For Movement” (2019), and “Songs Of The Firebird” (2019), which also includes performing with this modern jazz ensemble. She recently returned from a recording project in the ",
    "pubDate": "2021-02-16T08:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "4a19e934-6ba5-4dc0-a1bb-5e6f78eeca6a",
    "title": "Art Chang",
    "link": "https://www.spotlightonpodcast.com/art-chang/",
    "description": "Art Chang has spent over 25 years in technology transformation for large companies and government. As an insider, he has helped design and implement technology change and as an entrepreneur and investor, led major projects that delivered web-based software solutions for enterprise and government. Art’s experience includes financial services, music, e-commerce, publishing, fashion, architecture, and government. Art believes that great software, applied intelligently, can result in positive social",
    "pubDate": "2021-02-09T08:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6a73c5c0-262c-4f20-8718-ff42847abcf9",
    "title": "Tyler Pinckard",
    "link": "https://www.spotlightonpodcast.com/tyler-pinckard/",
    "description": "Tyler talks about his love of coffee, military experience, roles in engineering which eventually lead him to start Coffee Shift. Coffee Shift is a coffee company doing it differently. Coffee Shift is co-owned by the participating growers and was created to share greater benefit with the very farmers who produce our coffee,&nbsp;coffee that is&nbsp;fairer&nbsp;than fair trade.With corporate presence in both Silicon Valley and Chinchina, Colombia, Coffee Shift is&nbsp;not only sourcing and importi",
    "pubDate": "2021-02-02T08:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "2cdcfe81-343d-4818-89ae-fc1d0e92b677",
    "title": "Michaelangelo Matos",
    "link": "https://www.spotlightonpodcast.com/michaelangelo-matos/",
    "description": "Michaelangelo Matos is the author of \"The Underground Is Massive: How Electronic Dance Music Conquered America\" and \"Can't Slow Down: How 1984 Became Pop's Blockbuster Year.\"&nbsp;\"Can't Slow Down\" is the definitive account of pop music in the mid-eighties, from Prince and Madonna to the underground hip-hop, indie rock, and club scenesEverybody knows the hits of 1984 – pop music's greatest year. From \"Thriller\" to \"Purple Rain,\" \"Hello\" to \"Against All Odds,\" \"What's Love Got to Do with It\" to \"",
    "pubDate": "2021-01-26T08:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "1c9f15a1-bc43-4da0-832c-146d4d3bd1de",
    "title": "David Whitehead",
    "link": "https://www.spotlightonpodcast.com/david-whitehead/",
    "description": "David has quite a storied career having managed many artists you know the names of, working as a motorcycle messenger at Stiff Records, MD at Pinnacle Records, and distribution at Rough Trade Records. He's worked with artists like David Bowie, David Byrne, Luna, Natalie Merchant and Jimmie Dale Gilmore. He currently manages Keeley Forsyth, Joe Jackson, Lloyd Cole, Helmet, Joe Henry and the instinctive theatrical brilliance of Hugh Laurie through his management company, Maine Road.He shares a bun",
    "pubDate": "2021-01-19T08:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "c40aa16a-b69a-408a-88f4-fcf2bf0531c6",
    "title": "Michael F. Schein",
    "link": "https://www.spotlightonpodcast.com/michael-f-schein/",
    "description": "Michael F. Schein is the author of The Hype Handbook: 12 Indispensable Success Secrets From the World’s Greatest Propagandists, Self-Promoters, Cult Leaders, Mischief Makers, and Boundary Breakers (McGraw Hill, January 12, 2021).His articles have appeared in Fortune, Forbes, Inc., Huffington Post, and Psychology Today..He speaks to international audiences spanning from the northeastern United States to the southeastern coast of China.As founder and president of marketing agency MicroFame Media, ",
    "pubDate": "2021-01-12T08:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "2c75ba90-d179-411d-92cf-6151707dd323",
    "title": "Austin Arthouse Film Festival",
    "link": "https://www.spotlightonpodcast.com/austin-arthouse-film-festival/",
    "description": "We're bad at hiatuses. What can we say?&nbsp;But we're super excited to feature Giselle and Elizabeth on the podcast talking about the Austin Arthouse Film Festival which takes place THIS WEEK. Grab your tickets here.&nbsp;Spend an evening at AFS viewing work from filmmakers who \"defy conventions, champion art and challenge audience expectations.\" Some 60 films ranging from short, mid-length and feature length will be available on Vimeo Dec. 26 through Dec. 31. Documentaries, narrative features ",
    "pubDate": "2020-12-21T17:51:03.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "1e19de4e-9dda-4fd7-b950-4e08065374e2",
    "title": "Hanif Abdurraqib",
    "link": "https://www.spotlightonpodcast.com/hanif-abdurraqib/",
    "description": "Hanif Abdurraqib is a poet, essayist, and cultural critic from Columbus, Ohio.&nbsp;His poetry has been published in&nbsp;Muzzle, Vinyl, PEN American,&nbsp;and various other journals. His essays and music criticism have been published in&nbsp;The FADER, Pitchfork,&nbsp;The New Yorker, and&nbsp;The New York Times.&nbsp;His first full length poetry collection,&nbsp;The Crown Ain't Worth Much,&nbsp;was released in June 2016 from Button Poetry. It was named a finalist for the Eric Hoffer Book Prize,",
    "pubDate": "2020-12-01T08:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "dcf6bada-4ae2-4078-b9f0-6280577957d7",
    "title": "Ethan Clift - Tonic Labs",
    "link": "https://www.spotlightonpodcast.com/ethan-clift-tonic-labs/",
    "description": "Ethan is an entrepreneur in his own right who has turned his natural talents to elevating women and minorities. Founder of Girl Empire, Parlor Shows, Lean Crafting and Checklet, he’s a start-up super-connector. He’s played a critical role in countless business launches and partnerships. It’s no surprise he sits on Lieutenant Governor Mark Hutchison’s Nevada Entrepreneurship Task Force.Distributed ledgers? He got in on the ground floor and has it on lock. His wife, Allison Clift-Jennings, is the ",
    "pubDate": "2020-11-24T08:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "7140e43d-a614-4456-a676-6ffb8cf17087",
    "title": "Dimitri Ehrlich",
    "link": "https://www.spotlightonpodcast.com/dimitri-ehrlich/",
    "description": "Dimitri was raised on a macrobiotic commune. He has studied Tibetan Buddhism and Chinese martial arts for more than 25 years. He has jammed with Prince and the Beastie Boys, gotten drunk with Keith Richards. His travel writings include sojourns to Tibet, Cuba, India, Cambodia, China, Nepal, and the Amazon rainforest where he was nearly eaten by a crocodile.Dimitri Ehrlich is a television writer, author, journalist and musician. He was head writer for three years of VH1 Hip-Hop Honors. He was als",
    "pubDate": "2020-11-18T16:04:28.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "e27f6efa-255c-4c68-a35a-34f13799534f",
    "title": "Marc Brown - Byta",
    "link": "https://www.spotlightonpodcast.com/marc-brown-byta/",
    "description": "Marc’s deep music business background and digital audio knowledge has helped him deliver unique insights to audiences from Tallinn to Toronto.Marc is the founder of Byta / byta.com “the platform for music before it’s on streaming services”. Run as a distributed team across 3 continents, Byta enables everyone to send &amp; receive digital audio in a clean and simple way.Marc got his start at Sloan’s murderecords in Halifax during eastern Canada’s 90s indie rock explosion, then moved to the UK to ",
    "pubDate": "2020-11-10T16:00:46.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "7c8adfef-a409-4156-afab-3f3f014909c6",
    "title": "J Scott Christianson",
    "link": "https://www.spotlightonpodcast.com/j-scott-christianson/",
    "description": "J. Scott Christianson is an Associate Teaching&nbsp;Professor in the Management Department at the Robert J.&nbsp;Trulaske, Sr.&nbsp;College of Business,&nbsp;University of Missouri - Columbia. Prior to joining the Trulaske College of Business, Scott was a business owner with more than 21 years of experience in video-conferencing technology, project management and information technology.You can connect with Scott on Twitter:&nbsp;https://twitter.com/JScottMOScott has a variety of&nbsp;information",
    "pubDate": "2020-11-02T08:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "f50369f5-9e25-4101-9b97-83fe9346ed1e",
    "title": "Phil Messier - Bopper",
    "link": "https://www.spotlightonpodcast.com/phil-messier-bopper/",
    "description": "For almost two decades, Phil built a thriving career at the crossroads of music and media. As the co-founder of Apollo Studios, a globally-recognized music production house boasting an all-star team of composers, producers, and engineers, he was&nbsp;involved in every aspect of the work, earning recognition at the Cannes Lions, CLIO Awards, New York Festivals, London International Awards, and numerous other festivals.&nbsp;In 2013, Phil led a team of software developers and music supervisors in ",
    "pubDate": "2020-10-27T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "38d55c07-81a5-4c08-9c4e-763b0c33be7d",
    "title": "David Gorman",
    "link": "https://www.spotlightonpodcast.com/david-gorman/",
    "description": "Equally comfortable working with artists and algorithms, David Gorman has made a career of cooking up new ways to connect folks to things they’ll love. Whether that means rolling up his sleeves to create Grammy-winning packages and click-worthy posts himself or commanding an army of creators and curators to put a human stamp on code-based platforms, David has spent more than twenty years turning curious fans in to profitable customers.&nbsp;Along the way, Gorman’s been hugged by Keith Richards, ",
    "pubDate": "2020-10-20T20:18:15.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "eee2002f-1e2e-4f36-b272-085d004817e2",
    "title": "Isabella Kelly - Kingdom of Mind",
    "link": "https://www.spotlightonpodcast.com/isabella-kelly-kingdom-of-mind/",
    "description": "Kingdom of Mind, founded by Isabella Kelly, is an event production and promotions business. Kelly's past promotions work has focused on secondary/tertiary markets in California and will be expanding moving forward to the Pacific Northwest. Kelly has produced benefit concerts as well as events for universities and colleges. The focus of Kingdom of Mind is to curate unique events that bring talent to cities they might not have visited on a typical tour route.&nbsp;She was awarded a Women Nation Fu",
    "pubDate": "2020-10-14T13:33:21.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "3e2e5271-e186-43a8-a5a5-6b73ce43dd7b",
    "title": "Marco Collins - Radio Personality",
    "link": "https://www.spotlightonpodcast.com/marco-collins-radio-personality/",
    "description": "Marco Collins is a Seattle radio personality best known as the flagship DJ and Music Director at Seattle’s 107.7 ‘The End’ during the 1990’s grunge explosion which landed him a spot in The Rock &amp; Roll Hall Of Fame.&nbsp;Although he worked at a number of radio stations on the West Coast, VH1 and several record labels/management teams, the role he played in the 90’s is what made Seattle synonymous with grunge music. Marco was instrumental in breaking artists such as Nirvana, Beck, Weezer, The ",
    "pubDate": "2020-10-06T07:05:00.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "4bd40956-cf5d-4973-813e-be407f9eb6e1",
    "title": "Dmitri Vietze - Music Tectonics",
    "link": "https://www.spotlightonpodcast.com/dmitri-vietze-music-tectonics/",
    "description": "Born in Nashville, Dmitri moved to NYC as a teen where he busked in the subways while studying music at “the Fame High School” for Music and the Arts. After earning his business degree, he leaned into his entrepreneurial bent and launched rock paper scissors in 1999. His vision was to combine cutting edge technology and deep organic storytelling to help clients crystallize their missions in compelling ways and amplify them in innovative ways. He continues to lead&nbsp;the company from music to t",
    "pubDate": "2020-09-29T07:05:04.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "a4d9f0ef-9ac7-4483-866f-2e97a9d0dad0",
    "title": "Joe Satriani",
    "link": "https://www.spotlightonpodcast.com/joe-satriani/",
    "description": "Joe Satriani was born on July 15, 1956 at Westbury (in the state of New York). He played a little on his sister’s guitar. She had played some folk music in high school. He was inspired since he was young by Blues music, the Beatles and the Stones so when he turned 8 he started playing drums, then some piano a bit later. On September 18, 1970 all collapsed around him when he learned that Jimi Hendrix passed away. Joe was only 14 but he decided from this moment to stop everything and dedicate his ",
    "pubDate": "2020-09-22T07:05:03.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "861180fc-cf55-480d-9b84-932382fedece",
    "title": "Ari Rosner, Erick Beavers and Brad Robertson",
    "link": "https://www.spotlightonpodcast.com/ari-rosner-erick-beavers-and-brad-robertson/",
    "description": "This is a two-part episode where LP chats with Caltech student, Ari Rosner and high school buddies, Erick Beavers and Brad Robertson.&nbsp;Ari Rosner was recently featured in Forbes for the algorithm he developed to help determine the proper socially distant layout for a classroom. LP got the scoop about what Ari developed and how it might be able to help events of all types. Ari is a Caltech student pursuing a double major in both Business, Economics, and Management (BEM) and Mechanical Enginee",
    "pubDate": "2020-09-15T07:05:12.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "d9f2bdd1-8f94-44ad-8468-f90fbafb1f5f",
    "title": "Lyte, Prism.fm, VEEPS.com, Antone's and Disco Donnie",
    "link": "https://www.spotlightonpodcast.com/lyte-prismfm-veepscom-antones-and-disco-donnie/",
    "description": "Listen into this panel that took place September 2nd that featured 3 music tech companies, a promoter and a venue. Juan Torres moderated this panel. He's the VP of Business Operations at Prism a company that is revolutionizing how live music events are managed.&nbsp;Here are the panelists:&nbsp;Matt Ford is CEO of Prism.fm.&nbsp;Mallory Ferro is currently serving as the GM of the historic Antone's Nightclub in Austin, TX.&nbsp;Megan Lazaroff is a jack-of-all-trades working on Disco Donnie Presen",
    "pubDate": "2020-09-08T07:05:05.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "e2471dac-81f9-43a1-8e84-27f4b038b0df",
    "title": "Jorma and Vanessa Kaukonen",
    "link": "https://www.spotlightonpodcast.com/jorma-and-vanessa-kaukonen/",
    "description": "In a career that has already spanned a half-century, legendary guitarist and vocalist,&nbsp;Jorma Kaukonen is one of the most highly respected interpreters of American roots music, blues, and Americana, and at the forefront of popular rock-and-roll. A member of the Rock &amp; Roll Hall of Fame and a Grammy recipient, he is a founding member of two legendary bands, Jefferson Airplane and the still-touring Hot Tuna. Jorma Kaukonen’s repertoire goes far beyond his involvement creating psychedelic r",
    "pubDate": "2020-09-01T07:05:11.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "eca5a40d-f86f-495a-bedc-7e58d0833404",
    "title": "Alan Goldfarb",
    "link": "https://www.spotlightonpodcast.com/alan-goldfarb/",
    "description": "Alan Goldfarb, a veteran wine journalist, began his career as a sportswriter for Newsday in New York, the&nbsp;San Francisco Examiner, and the Associated Press.Alan has been writing about wine for decades now. He’s been the wine editor at the St. Helena Star, and his work has also appeared in the San Jose Mercury News, Wine Enthusiast, American Airlines’ American Way, and the Underground Wine Journal. Hosted on Acast. See acast.com/privacy for more information.",
    "pubDate": "2020-08-25T07:05:06.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "1a139f54-2de7-40f4-9483-99bd3af4d7c1",
    "title": "Erin Barra",
    "link": "https://www.spotlightonpodcast.com/erin-barra/",
    "description": "With a wide ranging skill set as a music and tech educator, songwriter, producer, instrumentalist, entrepreneur, and activist, Erin Barra has been a key player in many projects.An authoritative voice in music, tech, and education, Barra is the Director of Popular Music at Arizona State University, Executive Director of Beats By Girlz, course developer for Berklee Online and former Associate Professor at the Berklee College of Music in Boston. She has a wide breadth of experience developing and t",
    "pubDate": "2020-08-18T07:05:02.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "e6713a6a-f723-4aab-9d8c-6ca8f2ec45c0",
    "title": "Ronnie Schneider",
    "link": "https://www.spotlightonpodcast.com/ronnie-schneider/",
    "description": "Ronnie Schneider is best known for being the business presence at the center of pivotal 1960s events including the Altamont Free Concert, the dissolution of The Beatles and the reorganization of their business arm, Apple Corps. Schneider managed the early US tours of The Rolling Stones while simultaneously dealing with the financial affairs of some of the biggest names in rock n' roll history including the Stones, The Beatles, Neil Sedaka, Sam Cooke, Nancy Wilson, Bobby Vinton, Herman’s Hermits ",
    "pubDate": "2020-08-11T07:05:17.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "714b1943-cfac-48ab-ad68-36498fb3db4c",
    "title": "Ted Cohen",
    "link": "https://www.spotlightonpodcast.com/ted-cohen/",
    "description": "Ted Cohen is an American digital entertainment industry executive. Having worked in senior management positions at EMI Music, Warner Bros. Records and Philips Media. Cohen is currently the Managing Partner of TAG Strategic.Cohen currently chairs the Visionary Committee for MidemNet, served on the NARAS (Grammy) Los Angeles chapter Board of Governors as well as the National Trustee Board and currently co-chairs the Grammy Technology Committee. Cohen serves on the Board of Directors for the Neil B",
    "pubDate": "2020-08-04T07:05:07.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "ca49136f-5d84-41a9-b9fc-8c5aef8f8bf5",
    "title": "Andrew Loog Oldham",
    "link": "https://www.spotlightonpodcast.com/andrew-loog-oldham/",
    "description": "The longtime manager and producer of the Rolling Stones, Andrew Loog Oldham promoted and nurtured the group's notorious reputation as the bad boys of the British Invasion, orchestrating their ultimate rise to prominence as the \"world's greatest rock &amp; roll band.\"Andrew currently hosts \"podchats\" on his own podcast called Sounds &amp; Vision. He's featured conversations with Mick Rock, Jerry Schatzberg, May Pang, Danny Goldberg and others there.&nbsp;You can also read more about Andrew throug",
    "pubDate": "2020-07-09T19:36:02.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "2637d043-abef-4f02-b7cb-18b1968b7236",
    "title": "Danny Scher",
    "link": "https://www.spotlightonpodcast.com/danny-scher/",
    "description": "The summer of 1968 looked like the summer of 2020. Americans were in the streets protesting racism, among other things. And a high school student in Palo Alto, Calif., got in on the action by enlisting the help of a jazz legend. Danny Scher came up with the idea to book Thelonious Monk to play his school's auditorium and now, a professional recording of this concert will be released publicly for the first time on July 31. The album is called Palo Alto and comes out on Impulse! Recordings in all ",
    "pubDate": "2020-07-06T15:55:45.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "8f737094-79d5-4458-9c25-f219aa11a1a9",
    "title": "Karen Allen - Author of \"Twitch for Musicians.\"",
    "link": "https://www.spotlightonpodcast.com/karen-allen-author-of-twitch-for-musicians/",
    "description": "LP chats with Karen Allen, author of \"Twitch for Musicians.\" For over 20 years Karen has been working at the intersection of technology and music. She's obsessed with livestreaming and wrote a book with best practices before COVID was even thought of. Hosted on Acast. See acast.com/privacy for more information.",
    "pubDate": "2020-07-02T14:19:13.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "37ef5c9d-5601-4355-85ae-9dfbca422637",
    "title": "Kirt Debique - SyncFloor",
    "link": "https://www.spotlightonpodcast.com/kirt-debique-syncfloor/",
    "description": "On this episode LP chats with Kirt Debique, CEO and CTO of SyncFloor. Kirt is a 20 year Microsoft veteran with experience as an engineer, architect, technology strategist and general manager. He has worked on mobile productivity, real-time communications, multimedia systems, distributed security, and operating systems. An accomplished inventor with 37 technology patents, Kirt is also the owner and founder of Brick Lane Records, a Seattle independent label.In addition to SyncFloor, Kirt also oper",
    "pubDate": "2020-06-29T15:29:09.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "11f70212-a992-4c60-8dd3-ef72bfbba1bb",
    "title": "Matt Adell",
    "link": "https://www.spotlightonpodcast.com/matt-adell/",
    "description": "On this episode, LP chats with his longtime friend, Matt Adell about his time at Napster, Music Now, Beatport, and advocating for creators. His new project OnNow.tv just launched is building tools to help creators with discovery, sharing, and promoting their live streams.------------------• Did you enjoy this episode? Rate Spotlight On ⭐️⭐️⭐️⭐️⭐️ and leave a review on Apple Podcasts.• Subscribe! Be the first to check out each new episode of Spotlight On in your podcast app of choice.•&nbsp;Looki",
    "pubDate": "2020-06-25T14:47:01.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6d72cb19-bc12-4bbf-b83f-b820ec4dbf2d",
    "title": "Music Fans Speak!",
    "link": "https://www.spotlightonpodcast.com/music-fans-speak/",
    "description": "LP sits down with two music fans to discuss their show going pre and post COVID-19. They share insights about how they buy tickets and what they're hoping to see when shows come back.------------------• Did you enjoy this episode? Rate Spotlight On ⭐️⭐️⭐️⭐️⭐️ and leave a review on Apple Podcasts.• Subscribe! Be the first to check out each new episode of Spotlight On in your podcast app of choice.•&nbsp;Looking for more? Visit&nbsp;spotlightonpodcast.com&nbsp;for bonus content, web-only interview",
    "pubDate": "2020-06-22T14:57:11.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "e0d34da1-7695-4b9c-b3e0-3edbee6c81d9",
    "title": "Angeline Chase Priefer and Justin Nordan",
    "link": "https://www.spotlightonpodcast.com/angeline-chase-priefer-and-justin-nordan/",
    "description": "LP shines a light once again on Lyte by talking with Angeline Chase Priefer, Director of Client Services for Lyte’s Festival partnerships. Justin Nordan has the same role for Lyte’s venue business.&nbsp;LP spoke with them separately about where they come from, their career paths and how they wound up at Lyte.&nbsp;Both of these conversations affirm that not only are there many ways to make a life in music, but that all of us in this business continue to invent and reinvent the business and ourse",
    "pubDate": "2020-06-18T17:18:44.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "09ec63b8-32bd-4375-a692-571ea4788e99",
    "title": "Laura Hutfless - FlyteVu",
    "link": "https://www.spotlightonpodcast.com/laura-hutfless-flytevu/",
    "description": "LP chat with Laura Hutfless, Co-Founder of FlyteVu. FlyteVu is a&nbsp;marketing agency that connects brands to consumers through compelling storytelling, unparalleled experience, and the authentic power of music.&nbsp;FlyteVu represents brands like Bumble, Cracker Barrel, Vanderbilt University Medical Center, among many others.&nbsp;In this episode Laura shares the campaigns she's been working with her clients&nbsp;post COVID-19 and George Floyd and the importance of brands \"standing for somethi",
    "pubDate": "2020-06-15T17:00:01.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "2dd1ddf3-6abc-4211-8e50-177a850a4b8f",
    "title": "Nicole d'Avis - Open Music Initiative",
    "link": "https://www.spotlightonpodcast.com/nicole-davis-open-music-initiative/",
    "description": "LP chats with Nicole d'Avis, managing director of Berklee Institute for Creative Entrepreneurship and the Open Music Initiative.Nicole has worked for 15 years in the education and creative tech sector in Boston, with Sociedad Latina, on a global scale with the Intel Computer Clubhouse Network and now in the world of innovation and the arts with Berklee College of Music's Institute for Creative Entrepreneurship and as a founding team member of the Open Music Initiative. Nicole specializes in prog",
    "pubDate": "2020-06-12T20:08:04.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6a3acc6f-8536-453d-9189-fbbb4ee226a9",
    "title": "Michael Donaldson",
    "link": "https://www.spotlightonpodcast.com/michael-donaldson/",
    "description": "LP sits down with Michael Donaldson to talk about his newsletter Ringo Dreams of Lawncare, his blog 8 Sided Blog, the virality of independent music pre-internet, Kraftwerk, Tony Allen, the Clash, and finding your scene.Best known in the industry as Astralwerks/Virgin Records recording artist Q-Burns Abstract Message, Michael Donaldson learned the ins-and-outs of the music business through managing the influential '90s electronic imprint Eighth Dimension Records. Once the 21st century was in full",
    "pubDate": "2020-06-08T17:00:11.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "151d9596-34ee-4c74-927b-eebb7ea3d108",
    "title": "Paul Perry",
    "link": "https://www.spotlightonpodcast.com/paul-perry/",
    "description": "LP talks with writer Paul Perry about pirates, Ken Kesey, Jesus in Egypt, Salvador Dali, the Miracle of the Sun, near-death experiences, and UFOs.&nbsp;Paul Perry is the co-author of several New York Times bestsellers, including Evidence of the Afterlife, Closer to the Light, Transformed by the Light, and Saved by the Light which was made into a popular movie by Fox. His books have been published in more than 30 languages around the world and cover a wide variety of subjects from near-death expe",
    "pubDate": "2020-06-04T17:32:55.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "77eeb92d-6e3c-4464-94aa-dcafa2980569",
    "title": "Rishi Dhir - Elephant Stone",
    "link": "https://www.spotlightonpodcast.com/rishi-dhir-elephant-stone/",
    "description": "Lawrence Peryer chats with Rishi Dhir. Formed in Montreal in 2009, Elephant Stone is the brainchild of vocalist, bassist, songwriter, and sitar player, Rishi Dhir.&nbsp;Elephant Stone have toured extensively throughout North America and Europe and are prominent members of the burgeoning psych rock scene. Dhir has recorded, performed, and toured with indie rock icons (Beck), legendary cult bands (The Brian Jonestown Massacre), and contemporary psych titans (The Black Angels and The Horrors).Relea",
    "pubDate": "2020-06-01T20:01:56.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6eb63ae5-ee2f-4192-9c9a-72fd23b03dd8",
    "title": "Start of Summer",
    "link": "https://www.spotlightonpodcast.com/start-of-summer/",
    "description": "LP celebrates the start of summer. Technically he's off this week but has provided a playlist of summer music that he's been listening to. Enjoy!Playlist:Lee \"Scratch\" Perry - PopcornThe Skatalites - El Pussy Cat&nbsp;No. 1 de No. 1&nbsp;- Guajira VanBurning Spear - LionThe Itals - Rastafari ChariotToots &amp; The Maytals - Take Me Home Country Roads&nbsp;Junior Murvin - Give Me Your Love&nbsp;Mahmoud Ahmed&nbsp;- YasdestalMulatu Astatqe&nbsp;- Tezetaye Atchi Lidj&nbsp;The Gladiators - Bellyfull",
    "pubDate": "2020-05-28T14:41:56.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "28a4c058-5249-4ade-9b0c-b48e8f0144ab",
    "title": "Caitlin Flood and Jon Carr",
    "link": "https://www.spotlightonpodcast.com/caitlin-flood-and-jon-carr/",
    "description": "Lawrence Peryer chats separately with Caitlin and Jon to hear about their roles at Lyte and lives outside of work.&nbsp;Caitlin Flood is the Office and Community Manager at Lyte. She's been tasked with keeping Lyters connected and productive during quarantine. Caitlin is part of our Impact team where she works on charitable initiatives that range from Lyte's partnerships with PLUS1 and Backline to COVID-19 relief.&nbsp;Jon Carr is a visual designer at Lyte. He grew up in the music industry and h",
    "pubDate": "2020-05-25T17:30:20.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "1207b727-b284-4814-b5e2-8e97d7bd8814",
    "title": "Kaitlin Sandeno - Olympic Medalist",
    "link": "https://www.spotlightonpodcast.com/kaitlin-sandeno-olympic-medalist/",
    "description": "Kaitlin Sandeno Hogan is an American former competitive swimmer, Olympic gold medalist, world champion, and former world record-holder.&nbsp;She also is now the national spokesperson of the Jessie Rees Foundation, a motivational speaker, coach, sports commentator, emcee, and host for world-class sporting events.&nbsp;She's also the GM of the D.C. Trident which is part of the International Swimming League. She joins Lawrence Peryer to discuss the impact of COVID-19 on collegiate, Olympic, and pro",
    "pubDate": "2020-05-21T17:00:08.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "c0ea2d20-06c4-4972-9d72-8309320336a8",
    "title": "Emily White",
    "link": "https://www.spotlightonpodcast.com/emily-white/",
    "description": "Emily White’s career spans the entertainment industry, carving out a unique path that defines a modern maven. She talks with Lawrence Peryer about her new book \"How to Build a Sustainable Music Career &amp; Collect All Revenue Streams\", artists + athletes she manages, and #iVoted, an initiative where venues reward voters with free concerts.&nbsp;A bit more about Emily:Emily has worked with artists such as the Dresden Dolls, Imogen Heap, The Fiery Furnaces, Dinosaur Jr., The Secret Machines, Ange",
    "pubDate": "2020-05-18T17:00:06.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "ea91522a-23a9-43d9-8aca-ba1e69e7295d",
    "title": "Dan Runcie - Trapital Media",
    "link": "https://www.spotlightonpodcast.com/dan-runcie-trapital-media/",
    "description": "Dan Runcie, founder of Trapital Media. talks about the genesis of Trapital and through a few hip hop case studies including Travis Scott, Jay-Z, Kanye, and others.&nbsp;Trapital is written exclusively by Dan Runcie. For years, Dan was a go-to source among friends about any and everything related to hip-hop. That led Dan to start his own personal blog to see what others thought. Those stories landed him freelance gigs at publications such as WIRED, Pigeons &amp; Planes, Medium, and several other ",
    "pubDate": "2020-05-14T17:00:05.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "77f760f9-f70a-42bf-90a6-251b0f5e72d9",
    "title": "Nicole Barsalona",
    "link": "https://www.spotlightonpodcast.com/nicole-barsalona/",
    "description": "Born and raised in the music industry, Nicole Barsalona is Founder of 525 Entertainment Group / Everyday Rebellion Entertainment, an artist management and consulting firm. Barsalona specializes in artist development and international market development for artists including Prateek Kuhad and Mark Wilkinson. A passionate advocate, Nicole proudly serves as President of Women in Music, where she has served on the Board of Directors since 2013, and on the Executive Board for the Music Managers Forum",
    "pubDate": "2020-05-11T17:00:11.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "8e095dd4-01a7-4207-8627-9dd18992e683",
    "title": "Alexandra Naughton",
    "link": "https://www.spotlightonpodcast.com/alexandra-naughton/",
    "description": "Alexandra Naughton is the founder and editor-in-chief of Be About It Press, which started as a literary/art zine in 2010 and now publishes poetry collections in print and online.Alexandra is the author of a place a feeling something he said to you, as well as ten other published books. To learn more about Alexandra and her work visit www.alexandranaughton.com------------------• Did you enjoy this episode? Rate Spotlight On ⭐️⭐️⭐️⭐️⭐️ and leave a review on Apple Podcasts.• Subscribe! Be the first",
    "pubDate": "2020-05-04T18:32:39.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "a3c7f41a-df69-490b-a796-4889ac032900",
    "title": "John Petrocelli",
    "link": "https://www.spotlightonpodcast.com/john-petrocelli/",
    "description": "John Petrocelli, the founder of Bulldog Digital Media, has been pioneering live streaming for over 20 years and has worked with the likes of AT&amp;T, Samsung, NHL Hockey, Prince, Kanye West, Coachella, Governor's Ball, Solange and many many others. John joins host Lawrence Peryer to share his thoughts and insight on the New Normal.------------------• Did you enjoy this episode? Rate Spotlight On ⭐️⭐️⭐️⭐️⭐️ and leave a review on Apple Podcasts.• Subscribe! Be the first to check out each new epis",
    "pubDate": "2020-04-30T18:39:18.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "db719c41-b9f0-4107-8af2-ebf031183524",
    "title": "NIVA (National Independent Venue Association)",
    "link": "https://www.spotlightonpodcast.com/niva-national-independent-venue-association/",
    "description": "The National Independent Venue Association (NIVA) was recently formed to lobby with a unified voice for assistance from the federal government after thousands of small businesses across the country were imperiled by the spread of coronavirus. Within a matter of days its membership grew to some 450 members and a week later it had expanded to 900.First Avenue CEO Dayna Frank, Pabst Theater Group CEO and co-owner Gary Witt and Marauder Managing Partner Rev. Moose join Lawrence Peryer to discuss NIV",
    "pubDate": "2020-04-27T17:00:26.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "b1f88506-0526-4cfe-af15-0e1f73c3199a",
    "title": "Nick Turner",
    "link": "https://www.spotlightonpodcast.com/nick-turner/",
    "description": "Nick Turner, Co-Founder of Google DEMAND joins host Lawrence Peryer to talk about his journey from playing in bands such as Lords of the New Church and the Barracudas to becoming a technology innovator and entrepreneur.&nbsp;They discuss his experiences working in artist management, streaming the first live concert on the internet, building early artist websites and now democratizing data for the music business at Google.&nbsp;DEMAND is Google's new data analytics platform for live music industr",
    "pubDate": "2020-04-23T18:57:07.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "803695f4-c956-4f81-b827-97ad95647819",
    "title": "Mike Armstrong - ReedPOP",
    "link": "https://www.spotlightonpodcast.com/mike-armstrong-reedpop/",
    "description": "Mike Armstrong, VP at ReedPOP, the company behind New York Comic Con, PAX, C2E2, Star Wars Celebration, etc. joins host Lawrence Peryer to share his thoughts and insight on the New Normal.ReedPOP started up back in 2006, and has been on an epic ride ever since. From the very first New York Comic Con to launching and acquiring the coolest events all over the world, they’ve always stayed true to their core beliefs of always putting fans first, creating killer events and being as transparent and au",
    "pubDate": "2020-04-20T17:00:12.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "c8d8fab6-ca32-482a-b80c-eb8eee03a8f7",
    "title": "David Marsh - Team Elite Aquatics",
    "link": "https://www.spotlightonpodcast.com/david-marsh-team-elite-aquatics/",
    "description": "David Marsh,&nbsp;Head Coach of Team Elite Aquatics, the top professional swimming training group in the United States, joins host Lawrence Peryer to share his thoughts and insight on the New Normal.&nbsp;In 2016, Team Elite placed more athletes on the U.S. Olympic team than any other program. If Team Elite were a country, they would have placed 3rd in the 2016 Rio Olympics medal standings. Marsh was the Head U.S. Olympic Women's Swim Coach in Rio, leading Team USA to the most medals in USA Swim",
    "pubDate": "2020-04-16T17:00:32.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "0423a399-f02c-4538-9fd6-25ddae629e07",
    "title": "Marcie Allen - MAC Presents",
    "link": "https://www.spotlightonpodcast.com/marcie-allen-mac-presents/",
    "description": "Marcie Allen, President of MAC Presents joins host Lawrence Peryer to share her thoughts and insight on the New Normal.Marcie Allen leverages her 25+ years of music industry experience to negotiate high-profile partnerships between the world’s leading brands and artists. Allen has brokered and helmed multi-faceted programs on behalf of brands including Sony, Uber, Southwest Airlines, YouTube, Microsoft, Verizon, Samsung, Citi, Adidas, Hollister, Capital One, Delta, AT&amp;T and artists including",
    "pubDate": "2020-04-14T17:00:13.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "1beaa48d-8fe0-4406-b50f-1057c941012b",
    "title": "Cejih Yung - CG Sports Management",
    "link": "https://www.spotlightonpodcast.com/cejih-yung-cg-sports-management/",
    "description": "Cejih Yung of CG Sports Management joins host Lawrence Peryer to share his thoughts and insight on the New Normal.Through his agency, CG Sports Management, CG connects his Olympic, Paralympic, and Professional athlete clients with brands, speaking opportunities, and media outlets to help them share their stories and their skills with the wider world.CG and his team have created the CG Sports Network, which produces and airs daily streaming programming where US Olympic athlete hosts deliver a mix",
    "pubDate": "2020-04-10T17:00:34.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "78c47f67-6bb0-49d5-bad9-836232e9e364",
    "title": "Eric Fuller",
    "link": "https://www.spotlightonpodcast.com/eric-fuller/",
    "description": "Eric Fuller joins host Lawrence Peryer to share his thoughts and insight on the New Normal.Eric Fuller is a long time fan of all things live. Last year he went to 11 music festivals and 75 other events from conferences to concerts to theater. He's been known to fly across the country for a good meal or a great show.During working hours he is a consultant helping problem-solve for the live entertainment industry. Eric also advises clients on growth strategy, marketing, consumer engagement, and tr",
    "pubDate": "2020-04-08T17:18:05.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "ba0a71c5-9e85-4d73-8aab-938b17456af5",
    "title": "Perry Bashkoff - Instagram Music",
    "link": "https://www.spotlightonpodcast.com/perry-bashkoff-instagram-music/",
    "description": "Perry Bashkoff, Head of Music at Instagram, joins host Lawrence Peryer to share his thoughts and insight on the New Normal.Perry and LP worked together at Warner Music Group and navigated the digital music space together for years. They catch up about what Perry is seeing in his role at Instagram as well as how he's trying to help his local community.------------------• Did you enjoy this episode? Rate Spotlight On ⭐️⭐️⭐️⭐️⭐️ and leave a review on Apple Podcasts.• Subscribe! Be the first to chec",
    "pubDate": "2020-04-06T20:47:20.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "af3c3074-d01d-4931-8e5d-3e11a61d85e9",
    "title": "David Goldberg - Advisor at TPG Global",
    "link": "https://www.spotlightonpodcast.com/david-goldberg-advisor-at-tpg-global/",
    "description": "David Goldberg is an entertainment pioneer who's innovated ticketing, sports viewing and betting, digital music, and entertainment investments. He sat down with Spotlight On host, Lawrence Peryer in January 2020 at Germano Studio in NYC&nbsp;to talk about his career.David shares his experiences at Ticketmaster, Sportvision, Youbet.com, and TPG Global.David got his start working at JAM Productions in Chicago booking shows for&nbsp;one of the largest promoters in the country. He worked at Ticketma",
    "pubDate": "2020-04-02T17:11:12.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "11096454-035b-4084-99f7-77807940f145",
    "title": "Cherie Hu - Water and Music",
    "link": "https://www.spotlightonpodcast.com/cherie-hu-water-and-music/",
    "description": "Cherie Hu joins host Lawrence Peryer to share her thoughts and insight on the New Normal.Cherie is an award-winning writer and researcher who specializes in analyzing, tracking and critiquing innovation in the global music business.&nbsp;Her email newsletter, Water &amp; Music dives deep into hot topics in the music business and reaches nearly 6,000 subscribers weekly, from budding artists and managers to C-Suite executives at major labels and tech companies.You've probably read Cherie's bylines",
    "pubDate": "2020-04-01T14:56:49.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "887b8ae7-4dbb-4e94-aba3-e34d6e05496f",
    "title": "Patrick Whalen - Backstage Productions",
    "link": "https://www.spotlightonpodcast.com/patrick-whalen-backstage-productions/",
    "description": "Patrick Whalen, CEO of Backstage Productions, joins host Lawrence Peryer to share his thoughts and insight on the New Normal.------------------• Did you enjoy this episode? Rate Spotlight On ⭐️⭐️⭐️⭐️⭐️ and leave a review on Apple Podcasts.• Subscribe! Be the first to check out each new episode of Spotlight On in your podcast app of choice.•&nbsp;Looking for more? Visit&nbsp;spotlightonpodcast.com&nbsp;for bonus content, web-only interviews + features, and the Spotlight On email newsletter. Hoste",
    "pubDate": "2020-03-27T14:39:57.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "e969c693-bd67-488c-8308-d678e2de2db2",
    "title": "Laurie Kirby - FestForums",
    "link": "https://www.spotlightonpodcast.com/laurie-kirby-festforums/",
    "description": "Laurie Kirby Co-Founder FestForums joins host Lawrence Peryer to share her thoughts and insight on the New Normal.------------------• Did you enjoy this episode? Rate Spotlight On ⭐️⭐️⭐️⭐️⭐️ and leave a review on Apple Podcasts.• Subscribe! Be the first to check out each new episode of Spotlight On in your podcast app of choice.•&nbsp;Looking for more? Visit spotlightonpodcast.com for bonus content, web-only interviews + features, and the Spotlight On email newsletter. Hosted on Acast. See acast",
    "pubDate": "2020-03-27T03:22:28.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "6df65720-00c8-406c-be51-7ccf9faf0018",
    "title": "Patrick Ryan - Eventellect",
    "link": "https://www.spotlightonpodcast.com/patrick-ryan-eventellect/",
    "description": "Patrick Ryan, co-founder of Eventellect joins host Lawrence Peryer to share his thoughts and insight on the New Normal.------------------• Did you enjoy this episode? Rate Spotlight On ⭐️⭐️⭐️⭐️⭐️ and leave a review on Apple Podcasts.• Subscribe! Be the first to check out each new episode of Spotlight On in your podcast app of choice.•&nbsp;Looking for more? Visit spotlightonpodcast.com for bonus content, web-only interviews + features, and the Spotlight On email newsletter. Hosted on Acast. See ",
    "pubDate": "2020-03-25T19:18:50.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "cc78b4fc-60f5-4371-a7f0-a639d6be62c3",
    "title": "Zach Edwards - AC Entertainment",
    "link": "https://www.spotlightonpodcast.com/zach-edwards-ac-entertainment/",
    "description": "Zach Edwards, Director of Ticketing and Crowd Services at AC Entertainment joins host Lawrence Peryer to share his thoughts and insight on the New Normal.------------------• Did you enjoy this episode? Rate Spotlight On ⭐️⭐️⭐️⭐️⭐️ and leave a review on Apple Podcasts.• Subscribe! Be the first to check out each new episode of Spotlight On in your podcast app of choice.•&nbsp;Looking for more? Visit spotlightonpodcast.com for bonus content, web-only interviews + features, and the Spotlight On emai",
    "pubDate": "2020-03-24T16:23:17.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "eff016fb-5baf-47a6-a3b9-86fdbb513a1e",
    "title": "Matt Watts of Fender Guitars and the Starting Line",
    "link": "https://www.spotlightonpodcast.com/matt-watts-of-fender-guitars-and-the-starting-line/",
    "description": "Matt Watts is a music industry double threat. By day he's the VP of Marketing at Fender Guitars. At night he continues to play guitar with pop-punk legends, the Starting Line. Matt joined us in 2019 for a live conversation in front of an audience about his varied pursuits - on stage and off.&nbsp;------------------• Did you enjoy this episode? Rate Spotlight On ⭐️⭐️⭐️⭐️⭐️ and leave a review on Apple Podcasts.• Subscribe! Be the first to check out each new episode of Spotlight On in your podcast ",
    "pubDate": "2020-03-05T08:00:04.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  },
  {
    "id": "28a4e0b4-d25f-4b29-a878-ad632f9e4a74",
    "title": "Ben Lovett of Mumford & Sons",
    "link": "https://www.spotlightonpodcast.com/ben-lovett-of-mumford-sons/",
    "description": "Ben Lovett is a true multi-hyphenate. A founding member of Mumford &amp; Sons, Ben sings, plays keyboards and drums, writes and produces music. He develops venues and promotes shows. He owns a record label, music publishing, is a restaurateur, activist, philanthropist and all-around interested and engaged human being.------------------• Did you enjoy this episode? Rate Spotlight On ⭐️⭐️⭐️⭐️⭐️ and leave a review on Apple Podcasts.• Subscribe! Be the first to check out each new episode of Spotligh",
    "pubDate": "2020-02-06T08:05:21.000Z",
    "feedUrl": "https://feeds.acast.com/public/shows/spot-lyte-on"
  }
]